[NoCoverage] ConditionalExpression
src/core/systems/aoeOnImpactSystem.ts:21:7
 
 function getSnapshots(world: GameWorld): AoeSnapshot[] {
   let arr = trackedSnapshots.get(world);
-  if (arr === undefined) {
+  if (true) {
     arr = [];
     trackedSnapshots.set(world, arr);

[NoCoverage] BlockStatement
src/core/systems/aoeOnImpactSystem.ts:29:62
 }
 
 /** Call before damageSystem to snapshot current AoE projectile data. */
-export function aoeOnImpactPreDamage(world: GameWorld): void {
-  const snapshots = getSnapshots(world);
-  snapshots.length = 0;
-
-  const entities = query(world.ecs, [AoeOnImpact, Position]);
-  const { position, aoeOnImpact, owner, team } = world.stores;
-
-  for (const eid of entities) {
-    if (eid === undefined) continue;
-
-    snapshots.push({
-      eid,
-      x: position.x[eid] ?? 0,
-      y: position.y[eid] ?? 0,
-      radius: aoeOnImpact.radius[eid] ?? 0,
-      damage: aoeOnImpact.damage[eid] ?? 0,
-      ownerEid: hasComponent(world.ecs, eid, Owner) ? (owner.eid[eid] ?? 0) : -1,
-      teamId: hasComponent(world.ecs, eid, Team) ? (team.id[eid] ?? 0) : 0,
-    });
-  }
-}
+export function aoeOnImpactPreDamage(world: GameWorld): void {}
 
 /** Call after damageSystem to spawn explosions for destroyed AoE projectiles. */

[NoCoverage] BlockStatement
src/core/systems/aoeOnImpactSystem.ts:36:31
   const entities = query(world.ecs, [AoeOnImpact, Position]);
   const { position, aoeOnImpact, owner, team } = world.stores;
 
-  for (const eid of entities) {
-    if (eid === undefined) continue;
-
-    snapshots.push({
-      eid,
-      x: position.x[eid] ?? 0,
-      y: position.y[eid] ?? 0,
-      radius: aoeOnImpact.radius[eid] ?? 0,
-      damage: aoeOnImpact.damage[eid] ?? 0,
-      ownerEid: hasComponent(world.ecs, eid, Owner) ? (owner.eid[eid] ?? 0) : -1,
-      teamId: hasComponent(world.ecs, eid, Team) ? (team.id[eid] ?? 0) : 0,
-    });
-  }
+  for (const eid of entities) {}
 }
 

[NoCoverage] ConditionalExpression
src/core/systems/aoeOnImpactSystem.ts:37:9
   const { position, aoeOnImpact, owner, team } = world.stores;
 
   for (const eid of entities) {
-    if (eid === undefined) continue;
+    if (false) continue;
 
     snapshots.push({

[NoCoverage] EqualityOperator
src/core/systems/aoeOnImpactSystem.ts:37:9
   const { position, aoeOnImpact, owner, team } = world.stores;
 
   for (const eid of entities) {
-    if (eid === undefined) continue;
+    if (eid !== undefined) continue;
 
     snapshots.push({

[NoCoverage] UnaryOperator
src/core/systems/aoeOnImpactSystem.ts:45:79
       y: position.y[eid] ?? 0,
       radius: aoeOnImpact.radius[eid] ?? 0,
       damage: aoeOnImpact.damage[eid] ?? 0,
-      ownerEid: hasComponent(world.ecs, eid, Owner) ? (owner.eid[eid] ?? 0) : -1,
+      ownerEid: hasComponent(world.ecs, eid, Owner) ? (owner.eid[eid] ?? 0) : +1,
       teamId: hasComponent(world.ecs, eid, Team) ? (team.id[eid] ?? 0) : 0,
     });

[NoCoverage] BlockStatement
src/core/systems/aoeOnImpactSystem.ts:55:33
 export function aoeOnImpactPostDamage(world: GameWorld): void {
   const snapshots = getSnapshots(world);
 
-  for (const snap of snapshots) {
-    if (entityExists(world.ecs, snap.eid)) {
-      continue; // still alive, no explosion yet
-    }
-    if (snap.ownerEid >= 0 && isEntityInSafeSpace(world, snap.ownerEid)) {
-      continue;
-    }
-
-    if (snap.radius > 0) {
-      spawnAreaAttack(
-        world,
-        snap.x,
-        snap.y,
-        snap.ownerEid,
-        snap.damage,
-        snap.radius,
-        50,
-        snap.teamId,
-      );
-    }
-  }
+  for (const snap of snapshots) {}
 
   snapshots.length = 0;

[NoCoverage] ConditionalExpression
src/core/systems/aoeOnImpactSystem.ts:56:9
   const snapshots = getSnapshots(world);
 
   for (const snap of snapshots) {
-    if (entityExists(world.ecs, snap.eid)) {
+    if (false) {
       continue; // still alive, no explosion yet
     }

[NoCoverage] BlockStatement
src/core/systems/aoeOnImpactSystem.ts:56:44
   const snapshots = getSnapshots(world);
 
   for (const snap of snapshots) {
-    if (entityExists(world.ecs, snap.eid)) {
-      continue; // still alive, no explosion yet
-    }
+    if (entityExists(world.ecs, snap.eid)) {}
     if (snap.ownerEid >= 0 && isEntityInSafeSpace(world, snap.ownerEid)) {
       continue;

[NoCoverage] EqualityOperator
src/core/systems/aoeOnImpactSystem.ts:59:9
     if (entityExists(world.ecs, snap.eid)) {
       continue; // still alive, no explosion yet
     }
-    if (snap.ownerEid >= 0 && isEntityInSafeSpace(world, snap.ownerEid)) {
+    if (snap.ownerEid > 0 && isEntityInSafeSpace(world, snap.ownerEid)) {
       continue;
     }

[NoCoverage] EqualityOperator
src/core/systems/aoeOnImpactSystem.ts:59:9
     if (entityExists(world.ecs, snap.eid)) {
       continue; // still alive, no explosion yet
     }
-    if (snap.ownerEid >= 0 && isEntityInSafeSpace(world, snap.ownerEid)) {
+    if (snap.ownerEid < 0 && isEntityInSafeSpace(world, snap.ownerEid)) {
       continue;
     }

[NoCoverage] BlockStatement
src/core/systems/aoeOnImpactSystem.ts:63:26
       continue;
     }
 
-    if (snap.radius > 0) {
-      spawnAreaAttack(
-        world,
-        snap.x,
-        snap.y,
-        snap.ownerEid,
-        snap.damage,
-        snap.radius,
-        50,
-        snap.teamId,
-      );
-    }
+    if (snap.radius > 0) {}
   }
 

[NoCoverage] EqualityOperator
src/core/systems/aoeOnImpactSystem.ts:63:9
       continue;
     }
 
-    if (snap.radius > 0) {
+    if (snap.radius <= 0) {
       spawnAreaAttack(
         world,
