[Killed] LogicalOperator
src/core/systems/damageSystem.ts:283:9
       continue;
     }
 
-    if (hasComponent(world.ecs, b, Player) && hasComponent(world.ecs, a, Enemy)) {
+    if (hasComponent(world.ecs, b, Player) || hasComponent(world.ecs, a, Enemy)) {
       applyPlayerEnemyHit(world, b, a, hitTimestamps);
     }
killedBy: thrown weapons boomerang returns after hitting its final outbound target (1 + pierce)
statusReason: expected 35 to be 40 // Object.is equality
