[Survived] ArrayDeclaration
src/core/systems/doorSystem.ts:28:34
   const floorMap = world.floorMap;
   if (!floorMap) return;
 
-  const doors = query(world.ecs, [DoorState]);
+  const doors = query(world.ecs, []);
   const { doorState } = world.stores;
   const lockedDoorTiles = new Set<string>();

[Killed] ConditionalExpression
src/core/systems/doorSystem.ts:38:23
   for (const eid of doors) {
     const tx = doorState.tileX[eid] ?? 0;
     const ty = doorState.tileY[eid] ?? 0;
-    const wasLocked = (doorState.isLocked[eid] ?? 0) !== 0;
+    const wasLocked = false;
     let isLocked = wasLocked;
     const lockConfig = getDoorLockConfig(world, eid);
killedBy: door lock conditions unlocks when inventory condition is satisfied
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/core/systems/doorSystem.ts:38:24
   for (const eid of doors) {
     const tx = doorState.tileX[eid] ?? 0;
     const ty = doorState.tileY[eid] ?? 0;
-    const wasLocked = (doorState.isLocked[eid] ?? 0) !== 0;
+    const wasLocked = (doorState.isLocked[eid] && 0) !== 0;
     let isLocked = wasLocked;
     const lockConfig = getDoorLockConfig(world, eid);
killedBy: door lock conditions unlocks when inventory condition is satisfied
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/systems/doorSystem.ts:42:21
     let isLocked = wasLocked;
     const lockConfig = getDoorLockConfig(world, eid);
 
-    if (lockConfig) {
-      const unlockSatisfied = evaluateDoorConditionGroup(world, lockConfig.unlock);
-      const relockSatisfied = lockConfig.relock
-        ? evaluateDoorConditionGroup(world, lockConfig.relock)
-        : false;
-
-      if (wasLocked) {
-        if (unlockSatisfied && !relockSatisfied) {
-          isLocked = false;
-          doorState.wasUnlocked[eid] = 1;
-          doorState.isOpen[eid] = 1;
-        }
-      } else if (relockSatisfied) {
-        isLocked = true;
-        doorState.isOpen[eid] = 0;
-      }
-    }
+    if (lockConfig) {}
 
     doorState.isLocked[eid] = isLocked ? 1 : 0;
killedBy: door lock conditions unlocks when inventory condition is satisfied
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/core/systems/doorSystem.ts:46:11
       const unlockSatisfied = evaluateDoorConditionGroup(world, lockConfig.unlock);
       const relockSatisfied = lockConfig.relock
         ? evaluateDoorConditionGroup(world, lockConfig.relock)
-        : false;
+        : true;
 
       if (wasLocked) {
killedBy: door lock conditions unlocks when inventory condition is satisfied
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/doorSystem.ts:48:11
         ? evaluateDoorConditionGroup(world, lockConfig.relock)
         : false;
 
-      if (wasLocked) {
+      if (false) {
         if (unlockSatisfied && !relockSatisfied) {
           isLocked = false;
killedBy: door lock conditions unlocks when inventory condition is satisfied
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/core/systems/doorSystem.ts:48:22
         ? evaluateDoorConditionGroup(world, lockConfig.relock)
         : false;
 
-      if (wasLocked) {
-        if (unlockSatisfied && !relockSatisfied) {
-          isLocked = false;
-          doorState.wasUnlocked[eid] = 1;
-          doorState.isOpen[eid] = 1;
-        }
-      } else if (relockSatisfied) {
+      if (wasLocked) {} else if (relockSatisfied) {
         isLocked = true;
         doorState.isOpen[eid] = 0;
killedBy: door lock conditions unlocks when inventory condition is satisfied
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/core/systems/doorSystem.ts:49:50
         : false;
 
       if (wasLocked) {
-        if (unlockSatisfied && !relockSatisfied) {
-          isLocked = false;
-          doorState.wasUnlocked[eid] = 1;
-          doorState.isOpen[eid] = 1;
-        }
+        if (unlockSatisfied && !relockSatisfied) {}
       } else if (relockSatisfied) {
         isLocked = true;
killedBy: door lock conditions unlocks when inventory condition is satisfied
statusReason: expected 1 to be +0 // Object.is equality

[Killed] LogicalOperator
src/core/systems/doorSystem.ts:49:13
         : false;
 
       if (wasLocked) {
-        if (unlockSatisfied && !relockSatisfied) {
+        if (unlockSatisfied || !relockSatisfied) {
           isLocked = false;
           doorState.wasUnlocked[eid] = 1;
killedBy: door lock conditions unlocks when inventory condition is satisfied
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/core/systems/doorSystem.ts:50:22
 
       if (wasLocked) {
         if (unlockSatisfied && !relockSatisfied) {
-          isLocked = false;
+          isLocked = true;
           doorState.wasUnlocked[eid] = 1;
           doorState.isOpen[eid] = 1;
killedBy: door lock conditions unlocks when inventory condition is satisfied
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/doorSystem.ts:54:18
           doorState.wasUnlocked[eid] = 1;
           doorState.isOpen[eid] = 1;
         }
-      } else if (relockSatisfied) {
+      } else if (false) {
         isLocked = true;
         doorState.isOpen[eid] = 0;
killedBy: door lock conditions relocks when optional secondary conditions are satisfied
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/systems/doorSystem.ts:54:35
           doorState.wasUnlocked[eid] = 1;
           doorState.isOpen[eid] = 1;
         }
-      } else if (relockSatisfied) {
-        isLocked = true;
-        doorState.isOpen[eid] = 0;
-      }
+      } else if (relockSatisfied) {}
     }
 
killedBy: door lock conditions relocks when optional secondary conditions are satisfied
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/core/systems/doorSystem.ts:55:20
           doorState.isOpen[eid] = 1;
         }
       } else if (relockSatisfied) {
-        isLocked = true;
+        isLocked = false;
         doorState.isOpen[eid] = 0;
       }
killedBy: door lock conditions relocks when optional secondary conditions are satisfied
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/doorSystem.ts:61:9
     }
 
     doorState.isLocked[eid] = isLocked ? 1 : 0;
-    if (isLocked) {
+    if (true) {
       doorState.isOpen[eid] = 0;
       lockedDoorTiles.add(tileKey(tx, ty));
killedBy: door lock conditions unlocks when inventory condition is satisfied
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/core/systems/doorSystem.ts:61:9
     }
 
     doorState.isLocked[eid] = isLocked ? 1 : 0;
-    if (isLocked) {
+    if (false) {
       doorState.isOpen[eid] = 0;
       lockedDoorTiles.add(tileKey(tx, ty));

[NoCoverage] BlockStatement
src/core/systems/doorSystem.ts:72:56
   for (const player of players) {
     const px = world.stores.position.x[player] ?? 0;
     const py = world.stores.position.y[player] ?? 0;
-    if (safeRoom && isPointInSafeSpace(world, px, py)) {
-      const playerTile = floorMap.pixelToTile(px, py);
-      let closeSafeDoors = true;
-      for (const door of safeRoom.doors) {
-        const manhattan = Math.abs(playerTile.x - door.x) + Math.abs(playerTile.y - door.y);
-        // Keep doorway passable while the player is still transitioning through it.
-        if (manhattan <= 1) {
-          closeSafeDoors = false;
-          break;
-        }
-      }
-      if (closeSafeDoors) {
-        for (const door of safeRoom.doors) {
-          forcedClosedDoorTiles.add(tileKey(door.x, door.y));
-          floorMap.tileMap.closeDoor(door.x, door.y);
-        }
-      }
-    }
+    if (safeRoom && isPointInSafeSpace(world, px, py)) {}
     const tile = floorMap.pixelToTile(px, py);
 

[NoCoverage] BooleanLiteral
src/core/systems/doorSystem.ts:74:28
     const py = world.stores.position.y[player] ?? 0;
     if (safeRoom && isPointInSafeSpace(world, px, py)) {
       const playerTile = floorMap.pixelToTile(px, py);
-      let closeSafeDoors = true;
+      let closeSafeDoors = false;
       for (const door of safeRoom.doors) {
         const manhattan = Math.abs(playerTile.x - door.x) + Math.abs(playerTile.y - door.y);

[NoCoverage] BlockStatement
src/core/systems/doorSystem.ts:75:42
     if (safeRoom && isPointInSafeSpace(world, px, py)) {
       const playerTile = floorMap.pixelToTile(px, py);
       let closeSafeDoors = true;
-      for (const door of safeRoom.doors) {
-        const manhattan = Math.abs(playerTile.x - door.x) + Math.abs(playerTile.y - door.y);
-        // Keep doorway passable while the player is still transitioning through it.
-        if (manhattan <= 1) {
-          closeSafeDoors = false;
-          break;
-        }
-      }
+      for (const door of safeRoom.doors) {}
       if (closeSafeDoors) {
         for (const door of safeRoom.doors) {

[NoCoverage] ArithmeticOperator
src/core/systems/doorSystem.ts:76:27
       const playerTile = floorMap.pixelToTile(px, py);
       let closeSafeDoors = true;
       for (const door of safeRoom.doors) {
-        const manhattan = Math.abs(playerTile.x - door.x) + Math.abs(playerTile.y - door.y);
+        const manhattan = Math.abs(playerTile.x - door.x) - Math.abs(playerTile.y - door.y);
         // Keep doorway passable while the player is still transitioning through it.
         if (manhattan <= 1) {

[NoCoverage] ArithmeticOperator
src/core/systems/doorSystem.ts:76:36
       const playerTile = floorMap.pixelToTile(px, py);
       let closeSafeDoors = true;
       for (const door of safeRoom.doors) {
-        const manhattan = Math.abs(playerTile.x - door.x) + Math.abs(playerTile.y - door.y);
+        const manhattan = Math.abs(playerTile.x + door.x) + Math.abs(playerTile.y - door.y);
         // Keep doorway passable while the player is still transitioning through it.
         if (manhattan <= 1) {

[NoCoverage] BlockStatement
src/core/systems/doorSystem.ts:78:29
       for (const door of safeRoom.doors) {
         const manhattan = Math.abs(playerTile.x - door.x) + Math.abs(playerTile.y - door.y);
         // Keep doorway passable while the player is still transitioning through it.
-        if (manhattan <= 1) {
-          closeSafeDoors = false;
-          break;
-        }
+        if (manhattan <= 1) {}
       }
       if (closeSafeDoors) {

[NoCoverage] ConditionalExpression
src/core/systems/doorSystem.ts:78:13
       for (const door of safeRoom.doors) {
         const manhattan = Math.abs(playerTile.x - door.x) + Math.abs(playerTile.y - door.y);
         // Keep doorway passable while the player is still transitioning through it.
-        if (manhattan <= 1) {
+        if (true) {
           closeSafeDoors = false;
           break;

[NoCoverage] BooleanLiteral
src/core/systems/doorSystem.ts:79:28
         const manhattan = Math.abs(playerTile.x - door.x) + Math.abs(playerTile.y - door.y);
         // Keep doorway passable while the player is still transitioning through it.
         if (manhattan <= 1) {
-          closeSafeDoors = false;
+          closeSafeDoors = true;
           break;
         }

[NoCoverage] BlockStatement
src/core/systems/doorSystem.ts:83:27
           break;
         }
       }
-      if (closeSafeDoors) {
-        for (const door of safeRoom.doors) {
-          forcedClosedDoorTiles.add(tileKey(door.x, door.y));
-          floorMap.tileMap.closeDoor(door.x, door.y);
-        }
-      }
+      if (closeSafeDoors) {}
     }
     const tile = floorMap.pixelToTile(px, py);

[NoCoverage] ConditionalExpression
src/core/systems/doorSystem.ts:83:11
           break;
         }
       }
-      if (closeSafeDoors) {
+      if (true) {
         for (const door of safeRoom.doors) {
           forcedClosedDoorTiles.add(tileKey(door.x, door.y));

[NoCoverage] BlockStatement
src/core/systems/doorSystem.ts:84:44
         }
       }
       if (closeSafeDoors) {
-        for (const door of safeRoom.doors) {
-          forcedClosedDoorTiles.add(tileKey(door.x, door.y));
-          floorMap.tileMap.closeDoor(door.x, door.y);
-        }
+        for (const door of safeRoom.doors) {}
       }
     }

[Killed] EqualityOperator
src/core/systems/doorSystem.ts:92:44
     }
     const tile = floorMap.pixelToTile(px, py);
 
-    for (let dy = -AUTO_OPEN_RADIUS_TILES; dy <= AUTO_OPEN_RADIUS_TILES; dy += 1) {
+    for (let dy = -AUTO_OPEN_RADIUS_TILES; dy > AUTO_OPEN_RADIUS_TILES; dy += 1) {
       for (let dx = -AUTO_OPEN_RADIUS_TILES; dx <= AUTO_OPEN_RADIUS_TILES; dx += 1) {
         const tx = tile.x + dx;
killedBy: Door System should auto-open a nearby closed door for the player
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/doorSystem.ts:92:83
     }
     const tile = floorMap.pixelToTile(px, py);
 
-    for (let dy = -AUTO_OPEN_RADIUS_TILES; dy <= AUTO_OPEN_RADIUS_TILES; dy += 1) {
-      for (let dx = -AUTO_OPEN_RADIUS_TILES; dx <= AUTO_OPEN_RADIUS_TILES; dx += 1) {
-        const tx = tile.x + dx;
-        const ty = tile.y + dy;
-        if (!floorMap.tileMap.inBounds(tx, ty) || !floorMap.tileMap.isDoor(tx, ty)) {
-          continue;
-        }
-        if (lockedDoorTiles.has(tileKey(tx, ty))) {
-          continue;
-        }
-        if (forcedClosedDoorTiles.has(tileKey(tx, ty))) {
-          continue;
-        }
-        if (!floorMap.tileMap.isPassable(tx, ty)) {
-          floorMap.tileMap.openDoor(tx, ty);
-        }
-      }
-    }
+    for (let dy = -AUTO_OPEN_RADIUS_TILES; dy <= AUTO_OPEN_RADIUS_TILES; dy += 1) {}
   }
 
killedBy: Door System should auto-open a nearby closed door for the player
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/systems/doorSystem.ts:93:46
     const tile = floorMap.pixelToTile(px, py);
 
     for (let dy = -AUTO_OPEN_RADIUS_TILES; dy <= AUTO_OPEN_RADIUS_TILES; dy += 1) {
-      for (let dx = -AUTO_OPEN_RADIUS_TILES; dx <= AUTO_OPEN_RADIUS_TILES; dx += 1) {
+      for (let dx = -AUTO_OPEN_RADIUS_TILES; dx > AUTO_OPEN_RADIUS_TILES; dx += 1) {
         const tx = tile.x + dx;
         const ty = tile.y + dy;
killedBy: Door System should auto-open a nearby closed door for the player
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/doorSystem.ts:93:85
     const tile = floorMap.pixelToTile(px, py);
 
     for (let dy = -AUTO_OPEN_RADIUS_TILES; dy <= AUTO_OPEN_RADIUS_TILES; dy += 1) {
-      for (let dx = -AUTO_OPEN_RADIUS_TILES; dx <= AUTO_OPEN_RADIUS_TILES; dx += 1) {
-        const tx = tile.x + dx;
-        const ty = tile.y + dy;
-        if (!floorMap.tileMap.inBounds(tx, ty) || !floorMap.tileMap.isDoor(tx, ty)) {
-          continue;
-        }
-        if (lockedDoorTiles.has(tileKey(tx, ty))) {
-          continue;
-        }
-        if (forcedClosedDoorTiles.has(tileKey(tx, ty))) {
-          continue;
-        }
-        if (!floorMap.tileMap.isPassable(tx, ty)) {
-          floorMap.tileMap.openDoor(tx, ty);
-        }
-      }
+      for (let dx = -AUTO_OPEN_RADIUS_TILES; dx <= AUTO_OPEN_RADIUS_TILES; dx += 1) {}
     }
   }
killedBy: Door System should auto-open a nearby closed door for the player
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/core/systems/doorSystem.ts:94:20
 
     for (let dy = -AUTO_OPEN_RADIUS_TILES; dy <= AUTO_OPEN_RADIUS_TILES; dy += 1) {
       for (let dx = -AUTO_OPEN_RADIUS_TILES; dx <= AUTO_OPEN_RADIUS_TILES; dx += 1) {
-        const tx = tile.x + dx;
+        const tx = tile.x - dx;
         const ty = tile.y + dy;
         if (!floorMap.tileMap.inBounds(tx, ty) || !floorMap.tileMap.isDoor(tx, ty)) {

[Survived] ArithmeticOperator
src/core/systems/doorSystem.ts:95:20
     for (let dy = -AUTO_OPEN_RADIUS_TILES; dy <= AUTO_OPEN_RADIUS_TILES; dy += 1) {
       for (let dx = -AUTO_OPEN_RADIUS_TILES; dx <= AUTO_OPEN_RADIUS_TILES; dx += 1) {
         const tx = tile.x + dx;
-        const ty = tile.y + dy;
+        const ty = tile.y - dy;
         if (!floorMap.tileMap.inBounds(tx, ty) || !floorMap.tileMap.isDoor(tx, ty)) {
           continue;

[Killed] BooleanLiteral
src/core/systems/doorSystem.ts:96:51
       for (let dx = -AUTO_OPEN_RADIUS_TILES; dx <= AUTO_OPEN_RADIUS_TILES; dx += 1) {
         const tx = tile.x + dx;
         const ty = tile.y + dy;
-        if (!floorMap.tileMap.inBounds(tx, ty) || !floorMap.tileMap.isDoor(tx, ty)) {
+        if (!floorMap.tileMap.inBounds(tx, ty) || floorMap.tileMap.isDoor(tx, ty)) {
           continue;
         }
killedBy: Door System should auto-open a nearby closed door for the player
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/systems/doorSystem.ts:96:13
       for (let dx = -AUTO_OPEN_RADIUS_TILES; dx <= AUTO_OPEN_RADIUS_TILES; dx += 1) {
         const tx = tile.x + dx;
         const ty = tile.y + dy;
-        if (!floorMap.tileMap.inBounds(tx, ty) || !floorMap.tileMap.isDoor(tx, ty)) {
+        if (floorMap.tileMap.inBounds(tx, ty) || !floorMap.tileMap.isDoor(tx, ty)) {
           continue;
         }
killedBy: Door System should auto-open a nearby closed door for the player
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/core/systems/doorSystem.ts:99:51
         if (!floorMap.tileMap.inBounds(tx, ty) || !floorMap.tileMap.isDoor(tx, ty)) {
           continue;
         }
-        if (lockedDoorTiles.has(tileKey(tx, ty))) {
-          continue;
-        }
+        if (lockedDoorTiles.has(tileKey(tx, ty))) {}
         if (forcedClosedDoorTiles.has(tileKey(tx, ty))) {
           continue;

[Survived] ConditionalExpression
src/core/systems/doorSystem.ts:99:13
         if (!floorMap.tileMap.inBounds(tx, ty) || !floorMap.tileMap.isDoor(tx, ty)) {
           continue;
         }
-        if (lockedDoorTiles.has(tileKey(tx, ty))) {
+        if (false) {
           continue;
         }

[NoCoverage] BlockStatement
src/core/systems/doorSystem.ts:102:57
         if (lockedDoorTiles.has(tileKey(tx, ty))) {
           continue;
         }
-        if (forcedClosedDoorTiles.has(tileKey(tx, ty))) {
-          continue;
-        }
+        if (forcedClosedDoorTiles.has(tileKey(tx, ty))) {}
         if (!floorMap.tileMap.isPassable(tx, ty)) {
           floorMap.tileMap.openDoor(tx, ty);

[Survived] ConditionalExpression
src/core/systems/doorSystem.ts:102:13
         if (lockedDoorTiles.has(tileKey(tx, ty))) {
           continue;
         }
-        if (forcedClosedDoorTiles.has(tileKey(tx, ty))) {
+        if (false) {
           continue;
         }

[Killed] BlockStatement
src/core/systems/doorSystem.ts:105:51
         if (forcedClosedDoorTiles.has(tileKey(tx, ty))) {
           continue;
         }
-        if (!floorMap.tileMap.isPassable(tx, ty)) {
-          floorMap.tileMap.openDoor(tx, ty);
-        }
+        if (!floorMap.tileMap.isPassable(tx, ty)) {}
       }
     }
killedBy: Door System should auto-open a nearby closed door for the player
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/systems/doorSystem.ts:105:13
         if (forcedClosedDoorTiles.has(tileKey(tx, ty))) {
           continue;
         }
-        if (!floorMap.tileMap.isPassable(tx, ty)) {
+        if (floorMap.tileMap.isPassable(tx, ty)) {
           floorMap.tileMap.openDoor(tx, ty);
         }
killedBy: Door System should auto-open a nearby closed door for the player
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/doorSystem.ts:112:28
     }
   }
 
-  for (const eid of doors) {
-    const tx = doorState.tileX[eid] ?? 0;
-    const ty = doorState.tileY[eid] ?? 0;
-    const isForcedClosed = forcedClosedDoorTiles.has(tileKey(tx, ty));
-    const isLocked = (doorState.isLocked[eid] ?? 0) !== 0;
-    const isOpen = (doorState.isOpen[eid] ?? 0) !== 0;
-
-    if (isForcedClosed || isLocked) {
-      if (isForcedClosed) {
-        doorState.isOpen[eid] = 0;
-      }
-      floorMap.tileMap.closeDoor(tx, ty);
-    } else if (isOpen) {
-      floorMap.tileMap.openDoor(tx, ty);
-    } else {
-      floorMap.tileMap.closeDoor(tx, ty);
-    }
-  }
+  for (const eid of doors) {}
 }
 
killedBy: enemyAISystem door state changes trigger re-pathing without trapping navigators in rooms
statusReason: expected 190 to be greater than 256

[Killed] EqualityOperator
src/core/systems/doorSystem.ts:116:22
     const tx = doorState.tileX[eid] ?? 0;
     const ty = doorState.tileY[eid] ?? 0;
     const isForcedClosed = forcedClosedDoorTiles.has(tileKey(tx, ty));
-    const isLocked = (doorState.isLocked[eid] ?? 0) !== 0;
+    const isLocked = (doorState.isLocked[eid] ?? 0) === 0;
     const isOpen = (doorState.isOpen[eid] ?? 0) !== 0;
 
killedBy: Door System should open a closed door when isOpen = 1
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/systems/doorSystem.ts:116:22
     const tx = doorState.tileX[eid] ?? 0;
     const ty = doorState.tileY[eid] ?? 0;
     const isForcedClosed = forcedClosedDoorTiles.has(tileKey(tx, ty));
-    const isLocked = (doorState.isLocked[eid] ?? 0) !== 0;
+    const isLocked = true;
     const isOpen = (doorState.isOpen[eid] ?? 0) !== 0;
 
killedBy: Door System should open a closed door when isOpen = 1
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/systems/doorSystem.ts:117:20
     const ty = doorState.tileY[eid] ?? 0;
     const isForcedClosed = forcedClosedDoorTiles.has(tileKey(tx, ty));
     const isLocked = (doorState.isLocked[eid] ?? 0) !== 0;
-    const isOpen = (doorState.isOpen[eid] ?? 0) !== 0;
+    const isOpen = false;
 
     if (isForcedClosed || isLocked) {
killedBy: enemyAISystem door state changes trigger re-pathing without trapping navigators in rooms
statusReason: expected 190 to be greater than 256

[Killed] EqualityOperator
src/core/systems/doorSystem.ts:117:20
     const ty = doorState.tileY[eid] ?? 0;
     const isForcedClosed = forcedClosedDoorTiles.has(tileKey(tx, ty));
     const isLocked = (doorState.isLocked[eid] ?? 0) !== 0;
-    const isOpen = (doorState.isOpen[eid] ?? 0) !== 0;
+    const isOpen = (doorState.isOpen[eid] ?? 0) === 0;
 
     if (isForcedClosed || isLocked) {
killedBy: enemyAISystem door state changes trigger re-pathing without trapping navigators in rooms
statusReason: expected 192 to be less than 192

[Killed] BlockStatement
src/core/systems/doorSystem.ts:119:37
     const isLocked = (doorState.isLocked[eid] ?? 0) !== 0;
     const isOpen = (doorState.isOpen[eid] ?? 0) !== 0;
 
-    if (isForcedClosed || isLocked) {
-      if (isForcedClosed) {
-        doorState.isOpen[eid] = 0;
-      }
-      floorMap.tileMap.closeDoor(tx, ty);
-    } else if (isOpen) {
+    if (isForcedClosed || isLocked) {} else if (isOpen) {
       floorMap.tileMap.openDoor(tx, ty);
     } else {
killedBy: door lock conditions relocks when optional secondary conditions are satisfied
statusReason: expected true to be false // Object.is equality

[Survived] LogicalOperator
src/core/systems/doorSystem.ts:119:9
     const isLocked = (doorState.isLocked[eid] ?? 0) !== 0;
     const isOpen = (doorState.isOpen[eid] ?? 0) !== 0;
 
-    if (isForcedClosed || isLocked) {
+    if (isForcedClosed && isLocked) {
       if (isForcedClosed) {
         doorState.isOpen[eid] = 0;

[NoCoverage] BlockStatement
src/core/systems/doorSystem.ts:120:27
     const isOpen = (doorState.isOpen[eid] ?? 0) !== 0;
 
     if (isForcedClosed || isLocked) {
-      if (isForcedClosed) {
-        doorState.isOpen[eid] = 0;
-      }
+      if (isForcedClosed) {}
       floorMap.tileMap.closeDoor(tx, ty);
     } else if (isOpen) {

[Survived] ConditionalExpression
src/core/systems/doorSystem.ts:120:11
     const isOpen = (doorState.isOpen[eid] ?? 0) !== 0;
 
     if (isForcedClosed || isLocked) {
-      if (isForcedClosed) {
+      if (false) {
         doorState.isOpen[eid] = 0;
       }

[Killed] BlockStatement
src/core/systems/doorSystem.ts:124:24
         doorState.isOpen[eid] = 0;
       }
       floorMap.tileMap.closeDoor(tx, ty);
-    } else if (isOpen) {
-      floorMap.tileMap.openDoor(tx, ty);
-    } else {
+    } else if (isOpen) {} else {
       floorMap.tileMap.closeDoor(tx, ty);
     }
killedBy: enemyAISystem door state changes trigger re-pathing without trapping navigators in rooms
statusReason: expected 190 to be greater than 256

[Killed] BlockStatement
src/core/systems/doorSystem.ts:126:12
       floorMap.tileMap.closeDoor(tx, ty);
     } else if (isOpen) {
       floorMap.tileMap.openDoor(tx, ty);
-    } else {
-      floorMap.tileMap.closeDoor(tx, ty);
-    }
+    } else {}
   }
 }
killedBy: Door System should close an open door when isOpen = 0
statusReason: expected true to be false // Object.is equality
