[Killed] EqualityOperator
src/core/systems/equipmentSystem.ts:318:34
   // Slot availability (only if validation passed for slot checks)
   const state = getOrCreateState(world, entity);
   for (const slotId of itemDef.slots) {
-    if (isValidSlotId(slotId) && state.equipped[slotId] !== null) {
+    if (isValidSlotId(slotId) && state.equipped[slotId] === null) {
       reasons.push({ type: 'occupiedSlot', slotId });
     }
killedBy: Equipment System equips a single-slot item
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/systems/equipmentSystem.ts:326:21
   // Requirements
   reasons.push(...evaluateRequirements(world, entity, itemDef));
 
-  return { allowed: reasons.length === 0, reasons };
+  return { allowed: true, reasons };
 }
 
killedBy: Equipment System fails to equip when slot is occupied
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/systems/equipmentSystem.ts:326:21
   // Requirements
   reasons.push(...evaluateRequirements(world, entity, itemDef));
 
-  return { allowed: reasons.length === 0, reasons };
+  return { allowed: false, reasons };
 }
 
killedBy: Equipment System equips a single-slot item
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/systems/equipmentSystem.ts:337:7
   options?: EquipOptions,
 ): EquipResult {
   // State check (safe room only, unless forced)
-  if (!options?.force && world.state !== 'safe_room') {
+  if (options?.force && world.state !== 'safe_room') {
     return {
       ok: false,
killedBy: Equipment System denies equip outside safe room without force
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/core/systems/equipmentSystem.ts:337:7
   options?: EquipOptions,
 ): EquipResult {
   // State check (safe room only, unless forced)
-  if (!options?.force && world.state !== 'safe_room') {
+  if (!options?.force || world.state !== 'safe_room') {
     return {
       ok: false,
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/core/systems/equipmentSystem.ts:340:48
   if (!options?.force && world.state !== 'safe_room') {
     return {
       ok: false,
-      reasons: [{ type: 'invalidDef', message: 'Equipment changes only allowed in safe rooms' }],
+      reasons: [{ type: 'invalidDef', message: "" }],
     };
   }

[Survived] ArrayDeclaration
src/core/systems/equipmentSystem.ts:340:16
   if (!options?.force && world.state !== 'safe_room') {
     return {
       ok: false,
-      reasons: [{ type: 'invalidDef', message: 'Equipment changes only allowed in safe rooms' }],
+      reasons: [],
     };
   }

[Killed] ConditionalExpression
src/core/systems/equipmentSystem.ts:345:7
   }
 
   const result = canEquip(world, entity, itemDef);
-  if (!result.allowed) {
+  if (false) {
     return { ok: false, reasons: result.reasons };
   }
killedBy: Equipment System fails to equip when slot is occupied
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/systems/equipmentSystem.ts:345:7
   }
 
   const result = canEquip(world, entity, itemDef);
-  if (!result.allowed) {
+  if (result.allowed) {
     return { ok: false, reasons: result.reasons };
   }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/equipmentSystem.ts:353:39
   const instanceId = getNextInstanceId(world);
   const instance: EquipmentInstance = { instanceId, def: itemDef };
 
-  for (const slotId of itemDef.slots) {
-    state.equipped[slotId] = instanceId;
-  }
+  for (const slotId of itemDef.slots) {}
   state.instances.set(instanceId, instance);
 
killedBy: Equipment System equips a single-slot item
statusReason: expected null not to be null

[Survived] LogicalOperator
src/core/systems/equipmentSystem.ts:369:7
   slotId: EquipmentSlotId,
   options?: EquipOptions,
 ): UnequipResult {
-  if (!options?.force && world.state !== 'safe_room') {
+  if (!options?.force || world.state !== 'safe_room') {
     return { ok: false, reason: 'Equipment changes only allowed in safe rooms' };
   }

[NoCoverage] BlockStatement
src/core/systems/equipmentSystem.ts:369:55
   slotId: EquipmentSlotId,
   options?: EquipOptions,
 ): UnequipResult {
-  if (!options?.force && world.state !== 'safe_room') {
-    return { ok: false, reason: 'Equipment changes only allowed in safe rooms' };
-  }
+  if (!options?.force && world.state !== 'safe_room') {}
 
   if (!isValidSlotId(slotId)) {

[NoCoverage] StringLiteral
src/core/systems/equipmentSystem.ts:370:33
   options?: EquipOptions,
 ): UnequipResult {
   if (!options?.force && world.state !== 'safe_room') {
-    return { ok: false, reason: 'Equipment changes only allowed in safe rooms' };
+    return { ok: false, reason: "" };
   }
 

[Killed] BlockStatement
src/core/systems/equipmentSystem.ts:373:31
     return { ok: false, reason: 'Equipment changes only allowed in safe rooms' };
   }
 
-  if (!isValidSlotId(slotId)) {
-    return { ok: false, reason: `Unknown slot: ${slotId}` };
-  }
+  if (!isValidSlotId(slotId)) {}
 
   const state = getEquipmentMap(world).get(entity);
killedBy: Equipment System rejects unequip with unknown slot id
statusReason: expected 'Slot is empty' to contain 'Unknown slot'

[Killed] ConditionalExpression
src/core/systems/equipmentSystem.ts:373:7
     return { ok: false, reason: 'Equipment changes only allowed in safe rooms' };
   }
 
-  if (!isValidSlotId(slotId)) {
+  if (false) {
     return { ok: false, reason: `Unknown slot: ${slotId}` };
   }
killedBy: Equipment System rejects unequip with unknown slot id
statusReason: expected 'Slot is empty' to contain 'Unknown slot'

[NoCoverage] StringLiteral
src/core/systems/equipmentSystem.ts:384:46
   if (instId === null) return { ok: false, reason: 'Slot is empty' };
 
   const instance = state.instances.get(instId);
-  if (!instance) return { ok: false, reason: 'Instance not found' };
+  if (!instance) return { ok: false, reason: "" };
 
   // Free all slots this instance occupies

[Killed] BlockStatement
src/core/systems/equipmentSystem.ts:387:50
   if (!instance) return { ok: false, reason: 'Instance not found' };
 
   // Free all slots this instance occupies
-  for (const sid of Object.keys(state.equipped)) {
-    if (state.equipped[sid] === instId) {
-      state.equipped[sid] = null;
-    }
-  }
+  for (const sid of Object.keys(state.equipped)) {}
   state.instances.delete(instId);
 
killedBy: Equipment System unequips multi-slot item from any occupied slot
statusReason: expected 1 to be null

[Killed] BlockStatement
src/core/systems/equipmentSystem.ts:388:41
 
   // Free all slots this instance occupies
   for (const sid of Object.keys(state.equipped)) {
-    if (state.equipped[sid] === instId) {
-      state.equipped[sid] = null;
-    }
+    if (state.equipped[sid] === instId) {}
   }
   state.instances.delete(instId);
killedBy: Equipment System unequips multi-slot item from any occupied slot
statusReason: expected 1 to be null

[Killed] ConditionalExpression
src/core/systems/equipmentSystem.ts:388:9
 
   // Free all slots this instance occupies
   for (const sid of Object.keys(state.equipped)) {
-    if (state.equipped[sid] === instId) {
+    if (true) {
       state.equipped[sid] = null;
     }
killedBy: Equipment System recalculates stats after unequip
statusReason: expected +0 to be 3 // Object.is equality

[Killed] BlockStatement
src/core/systems/equipmentSystem.ts:401:38
 /** Get effective stats for an entity. */
 export function getEffectiveStats(world: GameWorld, entity: number): Record<StatId, number> {
   const result = {} as Record<StatId, number>;
-  for (const statId of ALL_STAT_IDS) {
-    result[statId] = world.stores.effectiveStats[statId][entity] ?? 0;
-  }
+  for (const statId of ALL_STAT_IDS) {}
   return result;
 }
killedBy: Equipment System equips a single-slot item
statusReason: expected undefined to be 5 // Object.is equality

[Killed] BlockStatement
src/core/systems/equipmentSystem.ts:413:77
 }
 
 /** Clean up equipment state when entity is destroyed. */
-export function clearEquipmentState(world: GameWorld, entity: number): void {
-  getEquipmentMap(world).delete(entity);
-  getEntityTagMap(world).delete(entity);
-  if (hasComponent(world.ecs, entity, Equipment)) {
-    removeComponent(world.ecs, entity, Equipment);
-  }
-  if (hasComponent(world.ecs, entity, BaseStats)) {
-    removeComponent(world.ecs, entity, BaseStats);
-  }
-  if (hasComponent(world.ecs, entity, EffectiveStats)) {
-    removeComponent(world.ecs, entity, EffectiveStats);
-  }
-}
+export function clearEquipmentState(world: GameWorld, entity: number): void {}
 
killedBy: Equipment System clears equipment state on entity cleanup
statusReason: expected { equipped: { head: 1, …(15) }, …(2) } to be undefined

[Survived] BlockStatement
src/core/systems/equipmentSystem.ts:416:51
 export function clearEquipmentState(world: GameWorld, entity: number): void {
   getEquipmentMap(world).delete(entity);
   getEntityTagMap(world).delete(entity);
-  if (hasComponent(world.ecs, entity, Equipment)) {
-    removeComponent(world.ecs, entity, Equipment);
-  }
+  if (hasComponent(world.ecs, entity, Equipment)) {}
   if (hasComponent(world.ecs, entity, BaseStats)) {
     removeComponent(world.ecs, entity, BaseStats);

[Survived] ConditionalExpression
src/core/systems/equipmentSystem.ts:416:7
 export function clearEquipmentState(world: GameWorld, entity: number): void {
   getEquipmentMap(world).delete(entity);
   getEntityTagMap(world).delete(entity);
-  if (hasComponent(world.ecs, entity, Equipment)) {
+  if (true) {
     removeComponent(world.ecs, entity, Equipment);
   }

[Survived] ConditionalExpression
src/core/systems/equipmentSystem.ts:419:7
   if (hasComponent(world.ecs, entity, Equipment)) {
     removeComponent(world.ecs, entity, Equipment);
   }
-  if (hasComponent(world.ecs, entity, BaseStats)) {
+  if (false) {
     removeComponent(world.ecs, entity, BaseStats);
   }

[Survived] ConditionalExpression
src/core/systems/equipmentSystem.ts:419:7
   if (hasComponent(world.ecs, entity, Equipment)) {
     removeComponent(world.ecs, entity, Equipment);
   }
-  if (hasComponent(world.ecs, entity, BaseStats)) {
+  if (true) {
     removeComponent(world.ecs, entity, BaseStats);
   }

[Survived] ConditionalExpression
src/core/systems/equipmentSystem.ts:422:7
   if (hasComponent(world.ecs, entity, BaseStats)) {
     removeComponent(world.ecs, entity, BaseStats);
   }
-  if (hasComponent(world.ecs, entity, EffectiveStats)) {
+  if (false) {
     removeComponent(world.ecs, entity, EffectiveStats);
   }

[Survived] ConditionalExpression
src/core/systems/equipmentSystem.ts:422:7
   if (hasComponent(world.ecs, entity, BaseStats)) {
     removeComponent(world.ecs, entity, BaseStats);
   }
-  if (hasComponent(world.ecs, entity, EffectiveStats)) {
+  if (true) {
     removeComponent(world.ecs, entity, EffectiveStats);
   }
