[Survived] BlockStatement
src/core/systems/projectileCleanupSystem.ts:25:17
   maxY: number;
 } {
   const floorMap = world.floorMap;
-  if (floorMap) {
-    return {
-      minX: 0,
-      maxX: floorMap.widthPx,
-      minY: 0,
-      maxY: floorMap.heightPx,
-    };
-  }
+  if (floorMap) {}
   return PLAY_BOUNDS;
 }

[Killed] ArithmeticOperator
src/core/systems/projectileCleanupSystem.ts:60:11
   const floorMap = world.floorMap;
   const playBounds = getPlayBounds(world);
   const cullBounds = {
-    minX: playBounds.minX - CULL_MARGIN,
+    minX: playBounds.minX + CULL_MARGIN,
     maxX: playBounds.maxX + CULL_MARGIN,
     minY: playBounds.minY - CULL_MARGIN,
killedBy: projectileCleanupSystem keeps non-bouncing projectiles using existing cleanup behavior
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/projectileCleanupSystem.ts:61:11
   const playBounds = getPlayBounds(world);
   const cullBounds = {
     minX: playBounds.minX - CULL_MARGIN,
-    maxX: playBounds.maxX + CULL_MARGIN,
+    maxX: playBounds.maxX - CULL_MARGIN,
     minY: playBounds.minY - CULL_MARGIN,
     maxY: playBounds.maxY + CULL_MARGIN,
killedBy: projectileCleanupSystem keeps projectiles within the cull margin
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/core/systems/projectileCleanupSystem.ts:62:11
   const cullBounds = {
     minX: playBounds.minX - CULL_MARGIN,
     maxX: playBounds.maxX + CULL_MARGIN,
-    minY: playBounds.minY - CULL_MARGIN,
+    minY: playBounds.minY + CULL_MARGIN,
     maxY: playBounds.maxY + CULL_MARGIN,
   };

[Killed] ArithmeticOperator
src/core/systems/projectileCleanupSystem.ts:63:11
     minX: playBounds.minX - CULL_MARGIN,
     maxX: playBounds.maxX + CULL_MARGIN,
     minY: playBounds.minY - CULL_MARGIN,
-    maxY: playBounds.maxY + CULL_MARGIN,
+    maxY: playBounds.maxY - CULL_MARGIN,
   };
 
killedBy: projectileCleanupSystem keeps projectiles with zero or no max range
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/systems/projectileCleanupSystem.ts:67:9
   };
 
   for (const eid of Array.from(entities)) {
-    if (eid === undefined) {
+    if (eid !== undefined) {
       continue;
     }
killedBy: projectileCleanupSystem removes projectiles that leave game bounds
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
src/core/systems/projectileCleanupSystem.ts:67:9
   };
 
   for (const eid of Array.from(entities)) {
-    if (eid === undefined) {
+    if (false) {
       continue;
     }

[Killed] LogicalOperator
src/core/systems/projectileCleanupSystem.ts:74:7
     const x = position.x[eid] ?? 0;
     const y = position.y[eid] ?? 0;
     const isBeyondPlayBounds =
-      x < playBounds.minX || x > playBounds.maxX || y < playBounds.minY || y > playBounds.maxY;
+      (x < playBounds.minX || x > playBounds.maxX || y < playBounds.minY) && y > playBounds.maxY;
 
     if (
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/projectileCleanupSystem.ts:74:7
     const x = position.x[eid] ?? 0;
     const y = position.y[eid] ?? 0;
     const isBeyondPlayBounds =
-      x < playBounds.minX || x > playBounds.maxX || y < playBounds.minY || y > playBounds.maxY;
+      false;
 
     if (
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected 2 to be 1 // Object.is equality

[Killed] LogicalOperator
src/core/systems/projectileCleanupSystem.ts:77:7
       x < playBounds.minX || x > playBounds.maxX || y < playBounds.minY || y > playBounds.maxY;
 
     if (
-      isBeyondPlayBounds &&
-      hasComponent(world.ecs, eid, Bouncing) &&
-      hasComponent(world.ecs, eid, Velocity)
+      isBeyondPlayBounds && hasComponent(world.ecs, eid, Bouncing) || hasComponent(world.ecs, eid, Velocity)
     ) {
       const remaining = world.stores.bouncing.remainingBounces[eid] ?? 0;
killedBy: projectileCleanupSystem removes projectiles that leave game bounds
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/systems/projectileCleanupSystem.ts:77:7
       x < playBounds.minX || x > playBounds.maxX || y < playBounds.minY || y > playBounds.maxY;
 
     if (
-      isBeyondPlayBounds &&
-      hasComponent(world.ecs, eid, Bouncing) &&
+      isBeyondPlayBounds || hasComponent(world.ecs, eid, Bouncing) &&
       hasComponent(world.ecs, eid, Velocity)
     ) {
killedBy: projectileCleanupSystem keeps projectiles within the cull margin
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/projectileCleanupSystem.ts:80:7
       isBeyondPlayBounds &&
       hasComponent(world.ecs, eid, Bouncing) &&
       hasComponent(world.ecs, eid, Velocity)
-    ) {
-      const remaining = world.stores.bouncing.remainingBounces[eid] ?? 0;
-      if (remaining > 0) {
-        let bounced = false;
-        if (x < playBounds.minX || x > playBounds.maxX) {
-          world.stores.velocity.x[eid] = -(world.stores.velocity.x[eid] ?? 0);
-          position.x[eid] = Math.max(playBounds.minX, Math.min(playBounds.maxX, x));
-          bounced = true;
-        }
-        if (y < playBounds.minY || y > playBounds.maxY) {
-          world.stores.velocity.y[eid] = -(world.stores.velocity.y[eid] ?? 0);
-          position.y[eid] = Math.max(playBounds.minY, Math.min(playBounds.maxY, y));
-          bounced = true;
-        }
-        if (bounced) {
-          // Corner impacts invert both axes but still count as one wall-bounce event.
-          world.stores.bouncing.remainingBounces[eid] = remaining - 1;
-          continue;
-        }
-      } else {
-        clearEntityStores(world, eid);
-        removeEntity(world.ecs, eid);
-        continue;
-      }
-    }
+    ) {}
 
     // Wall-hit: if the next-frame position is impassable the projectile would
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/systems/projectileCleanupSystem.ts:82:26
       hasComponent(world.ecs, eid, Velocity)
     ) {
       const remaining = world.stores.bouncing.remainingBounces[eid] ?? 0;
-      if (remaining > 0) {
-        let bounced = false;
-        if (x < playBounds.minX || x > playBounds.maxX) {
-          world.stores.velocity.x[eid] = -(world.stores.velocity.x[eid] ?? 0);
-          position.x[eid] = Math.max(playBounds.minX, Math.min(playBounds.maxX, x));
-          bounced = true;
-        }
-        if (y < playBounds.minY || y > playBounds.maxY) {
-          world.stores.velocity.y[eid] = -(world.stores.velocity.y[eid] ?? 0);
-          position.y[eid] = Math.max(playBounds.minY, Math.min(playBounds.maxY, y));
-          bounced = true;
-        }
-        if (bounced) {
-          // Corner impacts invert both axes but still count as one wall-bounce event.
-          world.stores.bouncing.remainingBounces[eid] = remaining - 1;
-          continue;
-        }
-      } else {
+      if (remaining > 0) {} else {
         clearEntityStores(world, eid);
         removeEntity(world.ecs, eid);
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/projectileCleanupSystem.ts:82:11
       hasComponent(world.ecs, eid, Velocity)
     ) {
       const remaining = world.stores.bouncing.remainingBounces[eid] ?? 0;
-      if (remaining > 0) {
+      if (false) {
         let bounced = false;
         if (x < playBounds.minX || x > playBounds.maxX) {
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/core/systems/projectileCleanupSystem.ts:83:23
     ) {
       const remaining = world.stores.bouncing.remainingBounces[eid] ?? 0;
       if (remaining > 0) {
-        let bounced = false;
+        let bounced = true;
         if (x < playBounds.minX || x > playBounds.maxX) {
           world.stores.velocity.x[eid] = -(world.stores.velocity.x[eid] ?? 0);

[Killed] BlockStatement
src/core/systems/projectileCleanupSystem.ts:84:57
       const remaining = world.stores.bouncing.remainingBounces[eid] ?? 0;
       if (remaining > 0) {
         let bounced = false;
-        if (x < playBounds.minX || x > playBounds.maxX) {
-          world.stores.velocity.x[eid] = -(world.stores.velocity.x[eid] ?? 0);
-          position.x[eid] = Math.max(playBounds.minX, Math.min(playBounds.maxX, x));
-          bounced = true;
-        }
+        if (x < playBounds.minX || x > playBounds.maxX) {}
         if (y < playBounds.minY || y > playBounds.maxY) {
           world.stores.velocity.y[eid] = -(world.stores.velocity.y[eid] ?? 0);
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/core/systems/projectileCleanupSystem.ts:84:13
       const remaining = world.stores.bouncing.remainingBounces[eid] ?? 0;
       if (remaining > 0) {
         let bounced = false;
-        if (x < playBounds.minX || x > playBounds.maxX) {
+        if (x >= playBounds.minX || x > playBounds.maxX) {
           world.stores.velocity.x[eid] = -(world.stores.velocity.x[eid] ?? 0);
           position.x[eid] = Math.max(playBounds.minX, Math.min(playBounds.maxX, x));
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected 2 to be 1 // Object.is equality

[Killed] UnaryOperator
src/core/systems/projectileCleanupSystem.ts:85:42
       if (remaining > 0) {
         let bounced = false;
         if (x < playBounds.minX || x > playBounds.maxX) {
-          world.stores.velocity.x[eid] = -(world.stores.velocity.x[eid] ?? 0);
+          world.stores.velocity.x[eid] = +(world.stores.velocity.x[eid] ?? 0);
           position.x[eid] = Math.max(playBounds.minX, Math.min(playBounds.maxX, x));
           bounced = true;
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected -4 to be 4 // Object.is equality

[Killed] MethodExpression
src/core/systems/projectileCleanupSystem.ts:86:29
         let bounced = false;
         if (x < playBounds.minX || x > playBounds.maxX) {
           world.stores.velocity.x[eid] = -(world.stores.velocity.x[eid] ?? 0);
-          position.x[eid] = Math.max(playBounds.minX, Math.min(playBounds.maxX, x));
+          position.x[eid] = Math.min(playBounds.minX, Math.min(playBounds.maxX, x));
           bounced = true;
         }
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected -5 to be +0 // Object.is equality

[Killed] MethodExpression
src/core/systems/projectileCleanupSystem.ts:86:55
         let bounced = false;
         if (x < playBounds.minX || x > playBounds.maxX) {
           world.stores.velocity.x[eid] = -(world.stores.velocity.x[eid] ?? 0);
-          position.x[eid] = Math.max(playBounds.minX, Math.min(playBounds.maxX, x));
+          position.x[eid] = Math.max(playBounds.minX, Math.max(playBounds.maxX, x));
           bounced = true;
         }
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected 1280 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/core/systems/projectileCleanupSystem.ts:87:21
         if (x < playBounds.minX || x > playBounds.maxX) {
           world.stores.velocity.x[eid] = -(world.stores.velocity.x[eid] ?? 0);
           position.x[eid] = Math.max(playBounds.minX, Math.min(playBounds.maxX, x));
-          bounced = true;
+          bounced = false;
         }
         if (y < playBounds.minY || y > playBounds.maxY) {
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected 2 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/core/systems/projectileCleanupSystem.ts:89:13
           position.x[eid] = Math.max(playBounds.minX, Math.min(playBounds.maxX, x));
           bounced = true;
         }
-        if (y < playBounds.minY || y > playBounds.maxY) {
+        if (false) {
           world.stores.velocity.y[eid] = -(world.stores.velocity.y[eid] ?? 0);
           position.y[eid] = Math.max(playBounds.minY, Math.min(playBounds.maxY, y));

[Survived] ConditionalExpression
src/core/systems/projectileCleanupSystem.ts:89:13
           position.x[eid] = Math.max(playBounds.minX, Math.min(playBounds.maxX, x));
           bounced = true;
         }
-        if (y < playBounds.minY || y > playBounds.maxY) {
+        if (false || y > playBounds.maxY) {
           world.stores.velocity.y[eid] = -(world.stores.velocity.y[eid] ?? 0);
           position.y[eid] = Math.max(playBounds.minY, Math.min(playBounds.maxY, y));

[NoCoverage] UnaryOperator
src/core/systems/projectileCleanupSystem.ts:90:42
           bounced = true;
         }
         if (y < playBounds.minY || y > playBounds.maxY) {
-          world.stores.velocity.y[eid] = -(world.stores.velocity.y[eid] ?? 0);
+          world.stores.velocity.y[eid] = +(world.stores.velocity.y[eid] ?? 0);
           position.y[eid] = Math.max(playBounds.minY, Math.min(playBounds.maxY, y));
           bounced = true;

[NoCoverage] MethodExpression
src/core/systems/projectileCleanupSystem.ts:91:29
         }
         if (y < playBounds.minY || y > playBounds.maxY) {
           world.stores.velocity.y[eid] = -(world.stores.velocity.y[eid] ?? 0);
-          position.y[eid] = Math.max(playBounds.minY, Math.min(playBounds.maxY, y));
+          position.y[eid] = Math.min(playBounds.minY, Math.min(playBounds.maxY, y));
           bounced = true;
         }

[NoCoverage] MethodExpression
src/core/systems/projectileCleanupSystem.ts:91:55
         }
         if (y < playBounds.minY || y > playBounds.maxY) {
           world.stores.velocity.y[eid] = -(world.stores.velocity.y[eid] ?? 0);
-          position.y[eid] = Math.max(playBounds.minY, Math.min(playBounds.maxY, y));
+          position.y[eid] = Math.max(playBounds.minY, Math.max(playBounds.maxY, y));
           bounced = true;
         }

[NoCoverage] BooleanLiteral
src/core/systems/projectileCleanupSystem.ts:92:21
         if (y < playBounds.minY || y > playBounds.maxY) {
           world.stores.velocity.y[eid] = -(world.stores.velocity.y[eid] ?? 0);
           position.y[eid] = Math.max(playBounds.minY, Math.min(playBounds.maxY, y));
-          bounced = true;
+          bounced = false;
         }
         if (bounced) {

[Killed] BlockStatement
src/core/systems/projectileCleanupSystem.ts:94:22
           position.y[eid] = Math.max(playBounds.minY, Math.min(playBounds.maxY, y));
           bounced = true;
         }
-        if (bounced) {
-          // Corner impacts invert both axes but still count as one wall-bounce event.
-          world.stores.bouncing.remainingBounces[eid] = remaining - 1;
-          continue;
-        }
+        if (bounced) {}
       } else {
         clearEntityStores(world, eid);
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/projectileCleanupSystem.ts:94:13
           position.y[eid] = Math.max(playBounds.minY, Math.min(playBounds.maxY, y));
           bounced = true;
         }
-        if (bounced) {
+        if (false) {
           // Corner impacts invert both axes but still count as one wall-bounce event.
           world.stores.bouncing.remainingBounces[eid] = remaining - 1;
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/projectileCleanupSystem.ts:96:57
         }
         if (bounced) {
           // Corner impacts invert both axes but still count as one wall-bounce event.
-          world.stores.bouncing.remainingBounces[eid] = remaining - 1;
+          world.stores.bouncing.remainingBounces[eid] = remaining + 1;
           continue;
         }
killedBy: projectileCleanupSystem bounces bouncing projectiles off arena bounds and decrements remaining bounces
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/systems/projectileCleanupSystem.ts:99:14
           world.stores.bouncing.remainingBounces[eid] = remaining - 1;
           continue;
         }
-      } else {
-        clearEntityStores(world, eid);
-        removeEntity(world.ecs, eid);
-        continue;
-      }
+      } else {}
     }
 
killedBy: projectileCleanupSystem removes bouncing projectiles that leave play bounds with no bounces left
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/core/systems/projectileCleanupSystem.ts:110:19
     // be stuck by the movement system — despawn it now instead of leaving it
     // frozen at the wall edge.  Projectiles don't slide; if the straight-line
     // destination is blocked, they despawn immediately.
-    if (floorMap) {
-      const vx = velocity.x[eid] ?? 0;
-      const vy = velocity.y[eid] ?? 0;
-      const nextX = x + vx;
-      const nextY = y + vy;
-      if (!floorMap.isPassableAt(nextX, nextY)) {
-        clearEntityStores(world, eid);
-        removeEntity(world.ecs, eid);
-        continue;
-      }
-    }
+    if (floorMap) {}
 
     // Max range check for non-returning projectiles
killedBy: projectileCleanupSystem removes projectiles that hit impassable map tiles (stationary in wall)
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/projectileCleanupSystem.ts:113:21
     if (floorMap) {
       const vx = velocity.x[eid] ?? 0;
       const vy = velocity.y[eid] ?? 0;
-      const nextX = x + vx;
+      const nextX = x - vx;
       const nextY = y + vy;
       if (!floorMap.isPassableAt(nextX, nextY)) {
killedBy: projectileCleanupSystem removes projectiles whose next position is fully blocked by a wall
statusReason: expected true to be false // Object.is equality

[Survived] ArithmeticOperator
src/core/systems/projectileCleanupSystem.ts:114:21
       const vx = velocity.x[eid] ?? 0;
       const vy = velocity.y[eid] ?? 0;
       const nextX = x + vx;
-      const nextY = y + vy;
+      const nextY = y - vy;
       if (!floorMap.isPassableAt(nextX, nextY)) {
         clearEntityStores(world, eid);

[Killed] BlockStatement
src/core/systems/projectileCleanupSystem.ts:115:49
       const vy = velocity.y[eid] ?? 0;
       const nextX = x + vx;
       const nextY = y + vy;
-      if (!floorMap.isPassableAt(nextX, nextY)) {
-        clearEntityStores(world, eid);
-        removeEntity(world.ecs, eid);
-        continue;
-      }
+      if (!floorMap.isPassableAt(nextX, nextY)) {}
     }
 
killedBy: projectileCleanupSystem removes projectiles that hit impassable map tiles (stationary in wall)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/systems/projectileCleanupSystem.ts:115:11
       const vy = velocity.y[eid] ?? 0;
       const nextX = x + vx;
       const nextY = y + vy;
-      if (!floorMap.isPassableAt(nextX, nextY)) {
+      if (false) {
         clearEntityStores(world, eid);
         removeEntity(world.ecs, eid);
killedBy: projectileCleanupSystem removes projectiles that hit impassable map tiles (stationary in wall)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/systems/projectileCleanupSystem.ts:124:9
 
     // Max range check for non-returning projectiles
     const isReturning = hasComponent(world.ecs, eid, Returning);
-    if (!isReturning) {
+    if (false) {
       const maxRange = projectile.maxRange[eid] ?? 0;
       if (maxRange > 0) {
killedBy: projectileCleanupSystem removes non-returning projectiles when they exceed max range
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/systems/projectileCleanupSystem.ts:124:9
 
     // Max range check for non-returning projectiles
     const isReturning = hasComponent(world.ecs, eid, Returning);
-    if (!isReturning) {
+    if (isReturning) {
       const maxRange = projectile.maxRange[eid] ?? 0;
       if (maxRange > 0) {
killedBy: projectileCleanupSystem removes non-returning projectiles when they exceed max range
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/systems/projectileCleanupSystem.ts:126:11
     const isReturning = hasComponent(world.ecs, eid, Returning);
     if (!isReturning) {
       const maxRange = projectile.maxRange[eid] ?? 0;
-      if (maxRange > 0) {
+      if (false) {
         const originX = projectile.originX[eid] ?? 0;
         const originY = projectile.originY[eid] ?? 0;
killedBy: projectileCleanupSystem removes non-returning projectiles when they exceed max range
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/systems/projectileCleanupSystem.ts:126:11
     const isReturning = hasComponent(world.ecs, eid, Returning);
     if (!isReturning) {
       const maxRange = projectile.maxRange[eid] ?? 0;
-      if (maxRange > 0) {
+      if (maxRange <= 0) {
         const originX = projectile.originX[eid] ?? 0;
         const originY = projectile.originY[eid] ?? 0;
killedBy: projectileCleanupSystem removes non-returning projectiles when they exceed max range
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/projectileCleanupSystem.ts:129:20
       if (maxRange > 0) {
         const originX = projectile.originX[eid] ?? 0;
         const originY = projectile.originY[eid] ?? 0;
-        const dx = x - originX;
+        const dx = x + originX;
         const dy = y - originY;
         const distSq = dx * dx + dy * dy;
killedBy: projectileCleanupSystem removes non-returning projectiles when they exceed max range
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/projectileCleanupSystem.ts:130:20
         const originX = projectile.originX[eid] ?? 0;
         const originY = projectile.originY[eid] ?? 0;
         const dx = x - originX;
-        const dy = y - originY;
+        const dy = y + originY;
         const distSq = dx * dx + dy * dy;
         if (distSq > maxRange * maxRange) {
killedBy: projectileCleanupSystem removes non-returning projectiles when they exceed max range
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/projectileCleanupSystem.ts:131:24
         const originY = projectile.originY[eid] ?? 0;
         const dx = x - originX;
         const dy = y - originY;
-        const distSq = dx * dx + dy * dy;
+        const distSq = dx / dx + dy * dy;
         if (distSq > maxRange * maxRange) {
           clearEntityStores(world, eid);
killedBy: projectileCleanupSystem removes non-returning projectiles when they exceed max range
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/projectileCleanupSystem.ts:131:24
         const originY = projectile.originY[eid] ?? 0;
         const dx = x - originX;
         const dy = y - originY;
-        const distSq = dx * dx + dy * dy;
+        const distSq = dx * dx - dy * dy;
         if (distSq > maxRange * maxRange) {
           clearEntityStores(world, eid);
killedBy: projectileCleanupSystem removes non-returning projectiles that exceed diagonal max range
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/projectileCleanupSystem.ts:132:22
         const dx = x - originX;
         const dy = y - originY;
         const distSq = dx * dx + dy * dy;
-        if (distSq > maxRange * maxRange) {
+        if (distSq > maxRange / maxRange) {
           clearEntityStores(world, eid);
           removeEntity(world.ecs, eid);
killedBy: projectileCleanupSystem removes non-returning projectiles when they exceed max range
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/projectileCleanupSystem.ts:132:43
         const dx = x - originX;
         const dy = y - originY;
         const distSq = dx * dx + dy * dy;
-        if (distSq > maxRange * maxRange) {
-          clearEntityStores(world, eid);
-          removeEntity(world.ecs, eid);
-          continue;
-        }
+        if (distSq > maxRange * maxRange) {}
       }
     }
killedBy: projectileCleanupSystem removes non-returning projectiles when they exceed max range
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/core/systems/projectileCleanupSystem.ts:140:9
       }
     }
 
-    if (x < cullBounds.minX || x > cullBounds.maxX || y < cullBounds.minY || y > cullBounds.maxY) {
+    if ((x < cullBounds.minX || x > cullBounds.maxX || y < cullBounds.minY) && y > cullBounds.maxY) {
       clearEntityStores(world, eid);
       removeEntity(world.ecs, eid);
killedBy: projectileCleanupSystem removes projectiles that leave game bounds
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/systems/projectileCleanupSystem.ts:140:32
       }
     }
 
-    if (x < cullBounds.minX || x > cullBounds.maxX || y < cullBounds.minY || y > cullBounds.maxY) {
+    if (x < cullBounds.minX || x <= cullBounds.maxX || y < cullBounds.minY || y > cullBounds.maxY) {
       clearEntityStores(world, eid);
       removeEntity(world.ecs, eid);
killedBy: projectileCleanupSystem removes projectiles that leave game bounds
statusReason: expected true to be false // Object.is equality
