[Killed] BlockStatement
src/game/scenarios/floor1LoadoutScenario.ts:29:81
 ] as const;
 
 function resolveFloor1LoadoutChoice(choiceId: string | undefined): Floor1LoadoutChoiceId {
-  if (choiceId === 'sword' || choiceId === 'pistol' || choiceId === 'fireball') {
-    return choiceId;
-  }
+  if (choiceId === 'sword' || choiceId === 'pistol' || choiceId === 'fireball') {}
   return DEFAULT_FLOOR1_LOADOUT_CHOICE;
 }
killedBy: floor1LoadoutScenario applies selected loadout choice by equipping active weapon
statusReason: expected 'sword' to be 'fireball' // Object.is equality

[Killed] ConditionalExpression
src/game/scenarios/floor1LoadoutScenario.ts:29:56
 ] as const;
 
 function resolveFloor1LoadoutChoice(choiceId: string | undefined): Floor1LoadoutChoiceId {
-  if (choiceId === 'sword' || choiceId === 'pistol' || choiceId === 'fireball') {
+  if (choiceId === 'sword' || choiceId === 'pistol' || false) {
     return choiceId;
   }
killedBy: floor1LoadoutScenario applies selected loadout choice by equipping active weapon
statusReason: expected 'sword' to be 'fireball' // Object.is equality

[Killed] LogicalOperator
src/game/scenarios/floor1LoadoutScenario.ts:40:21
   choiceId: string | undefined,
 ): Floor1LoadoutChoiceId {
   const resolvedChoice = resolveFloor1LoadoutChoice(choiceId);
-  const weaponDef = getWeaponDef(resolvedChoice) ?? getWeaponDef(DEFAULT_FLOOR1_LOADOUT_CHOICE);
+  const weaponDef = getWeaponDef(resolvedChoice) && getWeaponDef(DEFAULT_FLOOR1_LOADOUT_CHOICE);
   if (!weaponDef) {
     throw new Error(`Missing weapon definition for floor 1 loadout: ${resolvedChoice}`);
killedBy: floor1LoadoutScenario applies selected loadout choice by equipping active weapon
statusReason: expected 'sword' to be 'fireball' // Object.is equality

[Survived] StringLiteral
src/game/scenarios/floor1LoadoutScenario.ts:55:11
   return {
     title: 'Choose your opening loadout',
     subtitle: 'Floor 1 starts as soon as you lock this in.',
-    body: 'Each starter weapon defines your early pacing. Pick one now and adapt on the fly.',
+    body: "",
     options: FLOOR1_LOADOUT_OPTIONS,
     allowCancel: true,

[Killed] BooleanLiteral
src/game/scenarios/floor1LoadoutScenario.ts:57:18
     subtitle: 'Floor 1 starts as soon as you lock this in.',
     body: 'Each starter weapon defines your early pacing. Pick one now and adapt on the fly.',
     options: FLOOR1_LOADOUT_OPTIONS,
-    allowCancel: true,
+    allowCancel: false,
     initialSelectedId: DEFAULT_FLOOR1_LOADOUT_CHOICE,
     defaultOptionId: DEFAULT_FLOOR1_LOADOUT_CHOICE,
killedBy: floor1LoadoutScenario builds an extensible picker scenario with selectable options
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/game/scenarios/floor1LoadoutScenario.ts:60:37
     allowCancel: true,
     initialSelectedId: DEFAULT_FLOOR1_LOADOUT_CHOICE,
     defaultOptionId: DEFAULT_FLOOR1_LOADOUT_CHOICE,
-    onConfirm: (world, optionId) => {
-      applyFloor1LoadoutChoice(world, optionId);
-    },
+    onConfirm: (world, optionId) => {},
     onCancel: (world) => {
       applyFloor1LoadoutChoice(world, DEFAULT_FLOOR1_LOADOUT_CHOICE);

[Killed] BlockStatement
src/game/scenarios/floor1LoadoutScenario.ts:63:26
     onConfirm: (world, optionId) => {
       applyFloor1LoadoutChoice(world, optionId);
     },
-    onCancel: (world) => {
-      applyFloor1LoadoutChoice(world, DEFAULT_FLOOR1_LOADOUT_CHOICE);
-    },
+    onCancel: (world) => {},
   };
 }
killedBy: floor1LoadoutScenario uses default loadout when scenario is cancelled
statusReason: expected undefined to be 'sword' // Object.is equality
