[Killed] EqualityOperator
src/core/systems/fovSystem.ts:22:7
   if (!floorMap) return;
 
   const players = query(world.ecs, [Player, Position]);
-  if (players.length === 0) return;
+  if (players.length !== 0) return;
 
   const playerEid = players[0]!;
killedBy: FOV System should mark tiles visible around the player
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/core/systems/fovSystem.ts:22:7
   if (!floorMap) return;
 
   const players = query(world.ecs, [Player, Position]);
-  if (players.length === 0) return;
+  if (false) return;
 
   const playerEid = players[0]!;

[Killed] BlockStatement
src/core/systems/fovSystem.ts:42:65
     tile.x,
     tile.y,
     DEFAULT_FOV_RADIUS,
-    (_x: number, _y: number, _r: number, visibility: number) => {
-      if (visibility > 0) {
-        floorMap.setVisible(_x, _y);
-      }
-    },
+    (_x: number, _y: number, _r: number, visibility: number) => {},
   );
 }
killedBy: FOV System should mark tiles visible around the player
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/fovSystem.ts:43:27
     tile.y,
     DEFAULT_FOV_RADIUS,
     (_x: number, _y: number, _r: number, visibility: number) => {
-      if (visibility > 0) {
-        floorMap.setVisible(_x, _y);
-      }
+      if (visibility > 0) {}
     },
   );
killedBy: FOV System should mark tiles visible around the player
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/systems/fovSystem.ts:43:11
     tile.y,
     DEFAULT_FOV_RADIUS,
     (_x: number, _y: number, _r: number, visibility: number) => {
-      if (visibility > 0) {
+      if (visibility <= 0) {
         floorMap.setVisible(_x, _y);
       }
killedBy: FOV System should mark tiles visible around the player
statusReason: expected false to be true // Object.is equality
