[Killed] BooleanLiteral
src/core/systems/itemPickupSystem.ts:20:45
 
 export function itemPickupSystem(world: GameWorld, collisions: CollisionResult): void {
   for (const pair of collisions.pairs) {
-    if (!entityExists(world.ecs, pair.a) || !entityExists(world.ecs, pair.b)) {
+    if (!entityExists(world.ecs, pair.a) || entityExists(world.ecs, pair.b)) {
       continue;
     }
killedBy: itemPickupSystem picks up a dropped item on collision
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/core/systems/itemPickupSystem.ts:20:9
 
 export function itemPickupSystem(world: GameWorld, collisions: CollisionResult): void {
   for (const pair of collisions.pairs) {
-    if (!entityExists(world.ecs, pair.a) || !entityExists(world.ecs, pair.b)) {
+    if (entityExists(world.ecs, pair.a) || !entityExists(world.ecs, pair.b)) {
       continue;
     }
killedBy: itemPickupSystem picks up a dropped item on collision
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/systems/itemPickupSystem.ts:27:50
     let playerEid: number | undefined;
     let otherEid: number | undefined;
 
-    if (hasComponent(world.ecs, pair.a, Player)) {
-      playerEid = pair.a;
-      otherEid = pair.b;
-    } else if (hasComponent(world.ecs, pair.b, Player)) {
+    if (hasComponent(world.ecs, pair.a, Player)) {} else if (hasComponent(world.ecs, pair.b, Player)) {
       playerEid = pair.b;
       otherEid = pair.a;
killedBy: itemPickupSystem picks up a dropped item on collision
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/itemPickupSystem.ts:27:9
     let playerEid: number | undefined;
     let otherEid: number | undefined;
 
-    if (hasComponent(world.ecs, pair.a, Player)) {
+    if (false) {
       playerEid = pair.a;
       otherEid = pair.b;
killedBy: itemPickupSystem picks up a dropped item on collision
statusReason: expected +0 to be 1 // Object.is equality

[NoCoverage] BlockStatement
src/core/systems/itemPickupSystem.ts:30:57
     if (hasComponent(world.ecs, pair.a, Player)) {
       playerEid = pair.a;
       otherEid = pair.b;
-    } else if (hasComponent(world.ecs, pair.b, Player)) {
-      playerEid = pair.b;
-      otherEid = pair.a;
-    }
+    } else if (hasComponent(world.ecs, pair.b, Player)) {}
 
     if (playerEid === undefined || otherEid === undefined) continue;

[NoCoverage] ConditionalExpression
src/core/systems/itemPickupSystem.ts:30:16
     if (hasComponent(world.ecs, pair.a, Player)) {
       playerEid = pair.a;
       otherEid = pair.b;
-    } else if (hasComponent(world.ecs, pair.b, Player)) {
+    } else if (false) {
       playerEid = pair.b;
       otherEid = pair.a;

[Killed] BlockStatement
src/core/systems/itemPickupSystem.ts:38:50
     if (playerEid === undefined || otherEid === undefined) continue;
 
     // Gold pickup
-    if (hasComponent(world.ecs, otherEid, Gold)) {
-      const goldValue = world.stores.gold.value[otherEid] ?? 0;
-      world.playerGold += goldValue;
-      removeEntity(world.ecs, otherEid);
-      continue;
-    }
+    if (hasComponent(world.ecs, otherEid, Gold)) {}
 
     // XP gem pickup
killedBy: itemPickupSystem picks up gold and adds to playerGold
statusReason: expected true to be false // Object.is equality

[Killed] AssignmentOperator
src/core/systems/itemPickupSystem.ts:40:7
     // Gold pickup
     if (hasComponent(world.ecs, otherEid, Gold)) {
       const goldValue = world.stores.gold.value[otherEid] ?? 0;
-      world.playerGold += goldValue;
+      world.playerGold -= goldValue;
       removeEntity(world.ecs, otherEid);
       continue;
killedBy: itemPickupSystem picks up gold and adds to playerGold
statusReason: expected -10 to be 10 // Object.is equality

[Killed] BlockStatement
src/core/systems/itemPickupSystem.ts:46:51
     }
 
     // XP gem pickup
-    if (hasComponent(world.ecs, otherEid, XpGem)) {
-      const gemValue = world.stores.xpGem.value[otherEid] ?? 0;
-      const currentScore = world.stores.broadcastScore.current[playerEid] ?? 0;
-      world.stores.broadcastScore.current[playerEid] = currentScore + gemValue;
-      world.playerLevel.xp += gemValue;
-      removeEntity(world.ecs, otherEid);
-      continue;
-    }
+    if (hasComponent(world.ecs, otherEid, XpGem)) {}
 
     // Dropped item pickup
killedBy: itemPickupSystem picks up XP gems and adds to score + playerLevel
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/itemPickupSystem.ts:49:56
     if (hasComponent(world.ecs, otherEid, XpGem)) {
       const gemValue = world.stores.xpGem.value[otherEid] ?? 0;
       const currentScore = world.stores.broadcastScore.current[playerEid] ?? 0;
-      world.stores.broadcastScore.current[playerEid] = currentScore + gemValue;
+      world.stores.broadcastScore.current[playerEid] = currentScore - gemValue;
       world.playerLevel.xp += gemValue;
       removeEntity(world.ecs, otherEid);
killedBy: itemPickupSystem picks up XP gems and adds to score + playerLevel
statusReason: expected -7 to be 7 // Object.is equality

[Killed] AssignmentOperator
src/core/systems/itemPickupSystem.ts:50:7
       const gemValue = world.stores.xpGem.value[otherEid] ?? 0;
       const currentScore = world.stores.broadcastScore.current[playerEid] ?? 0;
       world.stores.broadcastScore.current[playerEid] = currentScore + gemValue;
-      world.playerLevel.xp += gemValue;
+      world.playerLevel.xp -= gemValue;
       removeEntity(world.ecs, otherEid);
       continue;
killedBy: itemPickupSystem picks up XP gems and adds to score + playerLevel
statusReason: expected -7 to be 7 // Object.is equality

[Survived] LogicalOperator
src/core/systems/itemPickupSystem.ts:57:7
 
     // Dropped item pickup
     if (
-      hasComponent(world.ecs, otherEid, DroppedItem) &&
-      hasComponent(world.ecs, playerEid, Inventory)
+      hasComponent(world.ecs, otherEid, DroppedItem) || hasComponent(world.ecs, playerEid, Inventory)
     ) {
       const bag = world.inventories.get(playerEid);

[Survived] ConditionalExpression
src/core/systems/itemPickupSystem.ts:57:7
 
     // Dropped item pickup
     if (
-      hasComponent(world.ecs, otherEid, DroppedItem) &&
-      hasComponent(world.ecs, playerEid, Inventory)
+      true
     ) {
       const bag = world.inventories.get(playerEid);

[Killed] BlockStatement
src/core/systems/itemPickupSystem.ts:59:7
     if (
       hasComponent(world.ecs, otherEid, DroppedItem) &&
       hasComponent(world.ecs, playerEid, Inventory)
-    ) {
-      const bag = world.inventories.get(playerEid);
-      if (!bag) continue;
-
-      const itemIndex = world.stores.droppedItem.itemIndex[otherEid] ?? 0;
-      const def = getItemByIndex(itemIndex);
-      if (def) {
-        addItem(bag, def.id, 1);
-      }
-      removeEntity(world.ecs, otherEid);
-    }
+    ) {}
   }
 }
killedBy: itemPickupSystem picks up a dropped item on collision
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/systems/itemPickupSystem.ts:65:16
 
       const itemIndex = world.stores.droppedItem.itemIndex[otherEid] ?? 0;
       const def = getItemByIndex(itemIndex);
-      if (def) {
-        addItem(bag, def.id, 1);
-      }
+      if (def) {}
       removeEntity(world.ecs, otherEid);
     }
killedBy: itemPickupSystem picks up a dropped item on collision
statusReason: expected +0 to be 1 // Object.is equality
