[Killed] BlockStatement
src/core/systems/deathTimerSystem.ts:17:58
 import type { GameWorld } from '../world.js';
 import { GAME } from '../../shared/constants.js';
 
-export function deathTimerSystem(world: GameWorld): void {
-  const entities = query(world.ecs, [DeathTimer]);
-  const { deathTimer } = world.stores;
-
-  for (const eid of Array.from(entities)) {
-    if (eid === undefined) continue;
-
-    const remaining = (deathTimer.remainingMs[eid] ?? 0) - GAME.DELTA_MS;
-    deathTimer.remainingMs[eid] = remaining;
-
-    if (remaining <= 0) {
-      clearEntityStores(world, eid);
-      removeEntity(world.ecs, eid);
-    }
-  }
-}
+export function deathTimerSystem(world: GameWorld): void {}
 
killedBy: deathTimerSystem removes entity when timer expires
statusReason: expected [ 1 ] to not include 1

[Killed] BlockStatement
src/core/systems/deathTimerSystem.ts:21:43
   const entities = query(world.ecs, [DeathTimer]);
   const { deathTimer } = world.stores;
 
-  for (const eid of Array.from(entities)) {
-    if (eid === undefined) continue;
-
-    const remaining = (deathTimer.remainingMs[eid] ?? 0) - GAME.DELTA_MS;
-    deathTimer.remainingMs[eid] = remaining;
-
-    if (remaining <= 0) {
-      clearEntityStores(world, eid);
-      removeEntity(world.ecs, eid);
-    }
-  }
+  for (const eid of Array.from(entities)) {}
 }
 
killedBy: deathTimerSystem removes entity when timer expires
statusReason: expected [ 1 ] to not include 1

[Killed] EqualityOperator
src/core/systems/deathTimerSystem.ts:22:9
   const { deathTimer } = world.stores;
 
   for (const eid of Array.from(entities)) {
-    if (eid === undefined) continue;
+    if (eid !== undefined) continue;
 
     const remaining = (deathTimer.remainingMs[eid] ?? 0) - GAME.DELTA_MS;
killedBy: healthSystem removes entities with health at or below zero (after death timer expires)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/systems/deathTimerSystem.ts:22:9
   const { deathTimer } = world.stores;
 
   for (const eid of Array.from(entities)) {
-    if (eid === undefined) continue;
+    if (true) continue;
 
     const remaining = (deathTimer.remainingMs[eid] ?? 0) - GAME.DELTA_MS;
killedBy: deathTimerSystem removes entity when timer expires
statusReason: expected [ 1 ] to not include 1

[Killed] ArithmeticOperator
src/core/systems/deathTimerSystem.ts:24:23
   for (const eid of Array.from(entities)) {
     if (eid === undefined) continue;
 
-    const remaining = (deathTimer.remainingMs[eid] ?? 0) - GAME.DELTA_MS;
+    const remaining = (deathTimer.remainingMs[eid] ?? 0) + GAME.DELTA_MS;
     deathTimer.remainingMs[eid] = remaining;
 
killedBy: healthSystem removes entities with health at or below zero (after death timer expires)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/systems/deathTimerSystem.ts:27:9
     const remaining = (deathTimer.remainingMs[eid] ?? 0) - GAME.DELTA_MS;
     deathTimer.remainingMs[eid] = remaining;
 
-    if (remaining <= 0) {
+    if (false) {
       clearEntityStores(world, eid);
       removeEntity(world.ecs, eid);
killedBy: deathTimerSystem removes entity when timer expires
statusReason: expected [ 1 ] to not include 1

[Killed] ConditionalExpression
src/core/systems/deathTimerSystem.ts:27:9
     const remaining = (deathTimer.remainingMs[eid] ?? 0) - GAME.DELTA_MS;
     deathTimer.remainingMs[eid] = remaining;
 
-    if (remaining <= 0) {
+    if (true) {
       clearEntityStores(world, eid);
       removeEntity(world.ecs, eid);
killedBy: deathTimerSystem removes entity when timer expires
statusReason: expected [] to include 1
