[Killed] BlockStatement
src/core/systems/knockbackSystem.ts:16:31
   const entities = query(world.ecs, [Knockback, Position]);
   const { position, knockback } = world.stores;
 
-  for (const eid of entities) {
-    if (eid === undefined) continue;
-
-    const remaining = knockback.remaining[eid] ?? 0;
-    const speed = knockback.speed[eid] ?? 0;
-
-    if (remaining <= 0 || speed <= 0) {
-      removeComponent(world.ecs, eid, Knockback);
-      continue;
-    }
-
-    const step = Math.min(speed, remaining);
-    const dirX = knockback.dirX[eid] ?? 0;
-    const dirY = knockback.dirY[eid] ?? 0;
-
-    position.x[eid] = (position.x[eid] ?? 0) + dirX * step;
-    position.y[eid] = (position.y[eid] ?? 0) + dirY * step;
-
-    knockback.remaining[eid] = remaining - step;
-
-    if (remaining - step <= 0) {
-      removeComponent(world.ecs, eid, Knockback);
-    }
-  }
+  for (const eid of entities) {}
 }
 
killedBy: melee weapons hammer knockback smoothly displaces enemy away from player
statusReason: expected 148 to be greater than 148

[Killed] ConditionalExpression
src/core/systems/knockbackSystem.ts:17:9
   const { position, knockback } = world.stores;
 
   for (const eid of entities) {
-    if (eid === undefined) continue;
+    if (true) continue;
 
     const remaining = knockback.remaining[eid] ?? 0;
killedBy: melee weapons hammer knockback smoothly displaces enemy away from player
statusReason: expected 148 to be greater than 148

[Killed] EqualityOperator
src/core/systems/knockbackSystem.ts:22:9
     const remaining = knockback.remaining[eid] ?? 0;
     const speed = knockback.speed[eid] ?? 0;
 
-    if (remaining <= 0 || speed <= 0) {
+    if (remaining > 0 || speed <= 0) {
       removeComponent(world.ecs, eid, Knockback);
       continue;
killedBy: melee weapons hammer knockback smoothly displaces enemy away from player
statusReason: expected 148 to be greater than 148

[Killed] ConditionalExpression
src/core/systems/knockbackSystem.ts:22:9
     const remaining = knockback.remaining[eid] ?? 0;
     const speed = knockback.speed[eid] ?? 0;
 
-    if (remaining <= 0 || speed <= 0) {
+    if (true) {
       removeComponent(world.ecs, eid, Knockback);
       continue;
killedBy: melee weapons hammer knockback smoothly displaces enemy away from player
statusReason: expected 148 to be greater than 148

[Survived] MethodExpression
src/core/systems/knockbackSystem.ts:27:18
       continue;
     }
 
-    const step = Math.min(speed, remaining);
+    const step = Math.max(speed, remaining);
     const dirX = knockback.dirX[eid] ?? 0;
     const dirY = knockback.dirY[eid] ?? 0;

[Killed] ArithmeticOperator
src/core/systems/knockbackSystem.ts:31:23
     const dirX = knockback.dirX[eid] ?? 0;
     const dirY = knockback.dirY[eid] ?? 0;
 
-    position.x[eid] = (position.x[eid] ?? 0) + dirX * step;
+    position.x[eid] = (position.x[eid] ?? 0) - dirX * step;
     position.y[eid] = (position.y[eid] ?? 0) + dirY * step;
 
killedBy: melee weapons hammer knockback smoothly displaces enemy away from player
statusReason: expected 144.8000030517578 to be greater than 148

[Killed] ArithmeticOperator
src/core/systems/knockbackSystem.ts:31:48
     const dirX = knockback.dirX[eid] ?? 0;
     const dirY = knockback.dirY[eid] ?? 0;
 
-    position.x[eid] = (position.x[eid] ?? 0) + dirX * step;
+    position.x[eid] = (position.x[eid] ?? 0) + dirX / step;
     position.y[eid] = (position.y[eid] ?? 0) + dirY * step;
 
killedBy: melee weapons hammer knockback smoothly displaces enemy away from player
statusReason: expected 3.125 to be close to 32, received difference is 28.875, but expected 0.5

[Survived] ArithmeticOperator
src/core/systems/knockbackSystem.ts:32:48
     const dirY = knockback.dirY[eid] ?? 0;
 
     position.x[eid] = (position.x[eid] ?? 0) + dirX * step;
-    position.y[eid] = (position.y[eid] ?? 0) + dirY * step;
+    position.y[eid] = (position.y[eid] ?? 0) + dirY / step;
 
     knockback.remaining[eid] = remaining - step;

[Survived] ArithmeticOperator
src/core/systems/knockbackSystem.ts:32:23
     const dirY = knockback.dirY[eid] ?? 0;
 
     position.x[eid] = (position.x[eid] ?? 0) + dirX * step;
-    position.y[eid] = (position.y[eid] ?? 0) + dirY * step;
+    position.y[eid] = (position.y[eid] ?? 0) - dirY * step;
 
     knockback.remaining[eid] = remaining - step;

[Killed] ArithmeticOperator
src/core/systems/knockbackSystem.ts:34:32
     position.x[eid] = (position.x[eid] ?? 0) + dirX * step;
     position.y[eid] = (position.y[eid] ?? 0) + dirY * step;
 
-    knockback.remaining[eid] = remaining - step;
+    knockback.remaining[eid] = remaining + step;
 
     if (remaining - step <= 0) {
killedBy: melee weapons hammer knockback smoothly displaces enemy away from player
statusReason: expected 67.19993591308594 to be close to 32, received difference is 35.19993591308594, but expected 0.5

[Killed] ConditionalExpression
src/core/systems/knockbackSystem.ts:36:9
 
     knockback.remaining[eid] = remaining - step;
 
-    if (remaining - step <= 0) {
+    if (true) {
       removeComponent(world.ecs, eid, Knockback);
     }
killedBy: melee weapons hammer knockback smoothly displaces enemy away from player
statusReason: expected 3.1999969482421875 to be close to 32, received difference is 28.800003051757812, but expected 0.5

[Killed] EqualityOperator
src/core/systems/knockbackSystem.ts:36:9
 
     knockback.remaining[eid] = remaining - step;
 
-    if (remaining - step <= 0) {
+    if (remaining - step > 0) {
       removeComponent(world.ecs, eid, Knockback);
     }
killedBy: melee weapons hammer knockback smoothly displaces enemy away from player
statusReason: expected 3.1999969482421875 to be close to 32, received difference is 28.800003051757812, but expected 0.5
