[Survived] StringLiteral
src/core/systems/dropSystem.ts:24:29
 import { createLogger } from '../../shared/logger.js';
 import { ftToPx } from '../../shared/units.js';
 
-const logger = createLogger('core:drop-system');
+const logger = createLogger("");
 
 /** Base knockback distance for death (1 foot). Scales with overkill. */

[Survived] EqualityOperator
src/core/systems/dropSystem.ts:56:17
 } {
   return {
     typeTable: LOOT_TABLES.BASIC_MELEE,
-    floorTable: world.floor === 1 ? LOOT_TABLES.FLOOR_1 : undefined,
+    floorTable: world.floor !== 1 ? LOOT_TABLES.FLOOR_1 : undefined,
   };
 }

[Survived] ConditionalExpression
src/core/systems/dropSystem.ts:56:17
 } {
   return {
     typeTable: LOOT_TABLES.BASIC_MELEE,
-    floorTable: world.floor === 1 ? LOOT_TABLES.FLOOR_1 : undefined,
+    floorTable: false ? LOOT_TABLES.FLOOR_1 : undefined,
   };
 }

[Survived] ConditionalExpression
src/core/systems/dropSystem.ts:69:20
 function getProcessedDeaths(world: GameWorld): Set<number> {
   let tracking = processedDeaths.get(world);
   const currentFrame = world.frameCount;
-  if (!tracking || tracking.frame !== currentFrame) {
+  if (!tracking || false) {
     tracking = { frame: currentFrame, eids: new Set() };
     processedDeaths.set(world, tracking);

[Survived] ConditionalExpression
src/core/systems/dropSystem.ts:69:7
 function getProcessedDeaths(world: GameWorld): Set<number> {
   let tracking = processedDeaths.get(world);
   const currentFrame = world.frameCount;
-  if (!tracking || tracking.frame !== currentFrame) {
+  if (true) {
     tracking = { frame: currentFrame, eids: new Set() };
     processedDeaths.set(world, tracking);

[Survived] StringLiteral
src/core/systems/dropSystem.ts:77:16
 }
 
 function spawnDrops(world: GameWorld, x: number, y: number, drops: LootDrop[]): void {
-  logger.debug('Spawning drops', {
+  logger.debug("", {
     dropCount: drops.length,
     x,

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:86:21
 
   for (const drop of drops) {
     // Scatter drops slightly around the death position
-    const offsetX = (world.rng.next() - 0.5) * 20;
+    const offsetX = (world.rng.next() - 0.5) / 20;
     const offsetY = (world.rng.next() - 0.5) * 20;
     const dx = x + offsetX;

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:86:22
 
   for (const drop of drops) {
     // Scatter drops slightly around the death position
-    const offsetX = (world.rng.next() - 0.5) * 20;
+    const offsetX = (world.rng.next() + 0.5) * 20;
     const offsetY = (world.rng.next() - 0.5) * 20;
     const dx = x + offsetX;

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:87:22
   for (const drop of drops) {
     // Scatter drops slightly around the death position
     const offsetX = (world.rng.next() - 0.5) * 20;
-    const offsetY = (world.rng.next() - 0.5) * 20;
+    const offsetY = (world.rng.next() + 0.5) * 20;
     const dx = x + offsetX;
     const dy = y + offsetY;

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:87:21
   for (const drop of drops) {
     // Scatter drops slightly around the death position
     const offsetX = (world.rng.next() - 0.5) * 20;
-    const offsetY = (world.rng.next() - 0.5) * 20;
+    const offsetY = (world.rng.next() - 0.5) / 20;
     const dx = x + offsetX;
     const dy = y + offsetY;

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:88:16
     // Scatter drops slightly around the death position
     const offsetX = (world.rng.next() - 0.5) * 20;
     const offsetY = (world.rng.next() - 0.5) * 20;
-    const dx = x + offsetX;
+    const dx = x - offsetX;
     const dy = y + offsetY;
 

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:89:16
     const offsetX = (world.rng.next() - 0.5) * 20;
     const offsetY = (world.rng.next() - 0.5) * 20;
     const dx = x + offsetX;
-    const dy = y + offsetY;
+    const dy = y - offsetY;
 
     switch (drop.type) {

[Survived] ConditionalExpression
src/core/systems/dropSystem.ts:92:7
     const dy = y + offsetY;
 
     switch (drop.type) {
-      case 'gold':
-        for (let i = 0; i < drop.quantity; i++) {
-          const gx = dx + (world.rng.next() - 0.5) * 8;
-          const gy = dy + (world.rng.next() - 0.5) * 8;
-          spawnGold(world, gx, gy, drop.value);
-        }
-        break;
+      case 'gold':
       case 'xp':
         for (let i = 0; i < drop.quantity; i++) {

[Survived] EqualityOperator
src/core/systems/dropSystem.ts:93:25
 
     switch (drop.type) {
       case 'gold':
-        for (let i = 0; i < drop.quantity; i++) {
+        for (let i = 0; i >= drop.quantity; i++) {
           const gx = dx + (world.rng.next() - 0.5) * 8;
           const gy = dy + (world.rng.next() - 0.5) * 8;

[Survived] ConditionalExpression
src/core/systems/dropSystem.ts:93:25
 
     switch (drop.type) {
       case 'gold':
-        for (let i = 0; i < drop.quantity; i++) {
+        for (let i = 0; false; i++) {
           const gx = dx + (world.rng.next() - 0.5) * 8;
           const gy = dy + (world.rng.next() - 0.5) * 8;

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:94:28
     switch (drop.type) {
       case 'gold':
         for (let i = 0; i < drop.quantity; i++) {
-          const gx = dx + (world.rng.next() - 0.5) * 8;
+          const gx = dx + (world.rng.next() + 0.5) * 8;
           const gy = dy + (world.rng.next() - 0.5) * 8;
           spawnGold(world, gx, gy, drop.value);

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:94:27
     switch (drop.type) {
       case 'gold':
         for (let i = 0; i < drop.quantity; i++) {
-          const gx = dx + (world.rng.next() - 0.5) * 8;
+          const gx = dx + (world.rng.next() - 0.5) / 8;
           const gy = dy + (world.rng.next() - 0.5) * 8;
           spawnGold(world, gx, gy, drop.value);

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:95:22
       case 'gold':
         for (let i = 0; i < drop.quantity; i++) {
           const gx = dx + (world.rng.next() - 0.5) * 8;
-          const gy = dy + (world.rng.next() - 0.5) * 8;
+          const gy = dy - (world.rng.next() - 0.5) * 8;
           spawnGold(world, gx, gy, drop.value);
         }

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:95:27
       case 'gold':
         for (let i = 0; i < drop.quantity; i++) {
           const gx = dx + (world.rng.next() - 0.5) * 8;
-          const gy = dy + (world.rng.next() - 0.5) * 8;
+          const gy = dy + (world.rng.next() - 0.5) / 8;
           spawnGold(world, gx, gy, drop.value);
         }

[Killed] ConditionalExpression
src/core/systems/dropSystem.ts:99:7
           spawnGold(world, gx, gy, drop.value);
         }
         break;
-      case 'xp':
-        for (let i = 0; i < drop.quantity; i++) {
-          const ex = dx + (world.rng.next() - 0.5) * 8;
-          const ey = dy + (world.rng.next() - 0.5) * 8;
-          spawnXpGem(world, ex, ey, drop.value);
-        }
-        break;
+      case 'xp':
       case 'item':
         if (drop.itemId) {
killedBy: dropSystem spawns loot when an enemy dies
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/core/systems/dropSystem.ts:100:49
         }
         break;
       case 'xp':
-        for (let i = 0; i < drop.quantity; i++) {
-          const ex = dx + (world.rng.next() - 0.5) * 8;
-          const ey = dy + (world.rng.next() - 0.5) * 8;
-          spawnXpGem(world, ex, ey, drop.value);
-        }
+        for (let i = 0; i < drop.quantity; i++) {}
         break;
       case 'item':
killedBy: dropSystem spawns loot when an enemy dies
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/core/systems/dropSystem.ts:100:25
         }
         break;
       case 'xp':
-        for (let i = 0; i < drop.quantity; i++) {
+        for (let i = 0; i >= drop.quantity; i++) {
           const ex = dx + (world.rng.next() - 0.5) * 8;
           const ey = dy + (world.rng.next() - 0.5) * 8;
killedBy: dropSystem spawns loot when an enemy dies
statusReason: expected 0 to be greater than or equal to 1

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:101:27
         break;
       case 'xp':
         for (let i = 0; i < drop.quantity; i++) {
-          const ex = dx + (world.rng.next() - 0.5) * 8;
+          const ex = dx + (world.rng.next() - 0.5) / 8;
           const ey = dy + (world.rng.next() - 0.5) * 8;
           spawnXpGem(world, ex, ey, drop.value);

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:101:28
         break;
       case 'xp':
         for (let i = 0; i < drop.quantity; i++) {
-          const ex = dx + (world.rng.next() - 0.5) * 8;
+          const ex = dx + (world.rng.next() + 0.5) * 8;
           const ey = dy + (world.rng.next() - 0.5) * 8;
           spawnXpGem(world, ex, ey, drop.value);

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:102:27
       case 'xp':
         for (let i = 0; i < drop.quantity; i++) {
           const ex = dx + (world.rng.next() - 0.5) * 8;
-          const ey = dy + (world.rng.next() - 0.5) * 8;
+          const ey = dy + (world.rng.next() - 0.5) / 8;
           spawnXpGem(world, ex, ey, drop.value);
         }

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:102:28
       case 'xp':
         for (let i = 0; i < drop.quantity; i++) {
           const ex = dx + (world.rng.next() - 0.5) * 8;
-          const ey = dy + (world.rng.next() - 0.5) * 8;
+          const ey = dy + (world.rng.next() + 0.5) * 8;
           spawnXpGem(world, ex, ey, drop.value);
         }

[Survived] ConditionalExpression
src/core/systems/dropSystem.ts:106:7
           spawnXpGem(world, ex, ey, drop.value);
         }
         break;
-      case 'item':
-        if (drop.itemId) {
-          const itemIndex = getItemIndex(drop.itemId);
-          if (itemIndex >= 0) {
-            for (let i = 0; i < drop.quantity; i++) {
-              spawnDroppedItem(world, dx, dy, itemIndex);
-            }
-          }
-        }
-        break;
+      case 'item':
     }
   }

[Survived] BlockStatement
src/core/systems/dropSystem.ts:107:26
         }
         break;
       case 'item':
-        if (drop.itemId) {
-          const itemIndex = getItemIndex(drop.itemId);
-          if (itemIndex >= 0) {
-            for (let i = 0; i < drop.quantity; i++) {
-              spawnDroppedItem(world, dx, dy, itemIndex);
-            }
-          }
-        }
+        if (drop.itemId) {}
         break;
     }

[Survived] ConditionalExpression
src/core/systems/dropSystem.ts:109:15
       case 'item':
         if (drop.itemId) {
           const itemIndex = getItemIndex(drop.itemId);
-          if (itemIndex >= 0) {
+          if (true) {
             for (let i = 0; i < drop.quantity; i++) {
               spawnDroppedItem(world, dx, dy, itemIndex);

[Survived] EqualityOperator
src/core/systems/dropSystem.ts:109:15
       case 'item':
         if (drop.itemId) {
           const itemIndex = getItemIndex(drop.itemId);
-          if (itemIndex >= 0) {
+          if (itemIndex < 0) {
             for (let i = 0; i < drop.quantity; i++) {
               spawnDroppedItem(world, dx, dy, itemIndex);

[NoCoverage] UpdateOperator
src/core/systems/dropSystem.ts:110:48
         if (drop.itemId) {
           const itemIndex = getItemIndex(drop.itemId);
           if (itemIndex >= 0) {
-            for (let i = 0; i < drop.quantity; i++) {
+            for (let i = 0; i < drop.quantity; i--) {
               spawnDroppedItem(world, dx, dy, itemIndex);
             }

[NoCoverage] EqualityOperator
src/core/systems/dropSystem.ts:110:29
         if (drop.itemId) {
           const itemIndex = getItemIndex(drop.itemId);
           if (itemIndex >= 0) {
-            for (let i = 0; i < drop.quantity; i++) {
+            for (let i = 0; i >= drop.quantity; i++) {
               spawnDroppedItem(world, dx, dy, itemIndex);
             }

[Killed] BooleanLiteral
src/core/systems/dropSystem.ts:124:42
   const entities = query(world.ecs, [Enemy, Health]);
   const { health, position } = world.stores;
   const processed = getProcessedDeaths(world);
-  const spawnLoot = options.spawnLoot ?? true;
+  const spawnLoot = options.spawnLoot ?? false;
   const deathLingerMs = options.deathLingerMs ?? DEATH_LINGER_MS;
 
killedBy: dropSystem spawns loot when an enemy dies
statusReason: expected 0 to be greater than or equal to 1

[Killed] LogicalOperator
src/core/systems/dropSystem.ts:124:21
   const entities = query(world.ecs, [Enemy, Health]);
   const { health, position } = world.stores;
   const processed = getProcessedDeaths(world);
-  const spawnLoot = options.spawnLoot ?? true;
+  const spawnLoot = options.spawnLoot && true;
   const deathLingerMs = options.deathLingerMs ?? DEATH_LINGER_MS;
 
killedBy: dropSystem spawns loot when an enemy dies
statusReason: expected 0 to be greater than or equal to 1

[Killed] LogicalOperator
src/core/systems/dropSystem.ts:125:25
   const { health, position } = world.stores;
   const processed = getProcessedDeaths(world);
   const spawnLoot = options.spawnLoot ?? true;
-  const deathLingerMs = options.deathLingerMs ?? DEATH_LINGER_MS;
+  const deathLingerMs = options.deathLingerMs && DEATH_LINGER_MS;
 
   for (const eid of Array.from(entities)) {
killedBy: dropSystem can suppress loot while preserving death linger timing
statusReason: expected 300 to be 900 // Object.is equality

[Survived] ConditionalExpression
src/core/systems/dropSystem.ts:128:9
   const deathLingerMs = options.deathLingerMs ?? DEATH_LINGER_MS;
 
   for (const eid of Array.from(entities)) {
-    if (eid === undefined) continue;
+    if (false) continue;
 
     const currentHealth = health.current[eid] ?? 0;

[Killed] EqualityOperator
src/core/systems/dropSystem.ts:131:9
     if (eid === undefined) continue;
 
     const currentHealth = health.current[eid] ?? 0;
-    if (currentHealth > 0) continue;
+    if (currentHealth <= 0) continue;
     if (processed.has(eid)) {
       logger.warn('Skipping duplicate death processing for enemy in same frame', {
killedBy: dropSystem spawns loot when an enemy dies
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/core/systems/dropSystem.ts:131:9
     if (eid === undefined) continue;
 
     const currentHealth = health.current[eid] ?? 0;
-    if (currentHealth > 0) continue;
+    if (false) continue;
     if (processed.has(eid)) {
       logger.warn('Skipping duplicate death processing for enemy in same frame', {
killedBy: dropSystem does not spawn drops for living enemies
statusReason: expected 1 to be +0 // Object.is equality

[Survived] BlockStatement
src/core/systems/dropSystem.ts:132:29
 
     const currentHealth = health.current[eid] ?? 0;
     if (currentHealth > 0) continue;
-    if (processed.has(eid)) {
-      logger.warn('Skipping duplicate death processing for enemy in same frame', {
-        eid,
-        frameCount: world.frameCount,
-      });
-      continue;
-    }
+    if (processed.has(eid)) {}
     // Skip entities already in death linger (processed on a prior frame)
     if (hasComponent(world.ecs, eid, DeathTimer)) continue;

[Survived] ConditionalExpression
src/core/systems/dropSystem.ts:132:9
 
     const currentHealth = health.current[eid] ?? 0;
     if (currentHealth > 0) continue;
-    if (processed.has(eid)) {
+    if (false) {
       logger.warn('Skipping duplicate death processing for enemy in same frame', {
         eid,

[Survived] ObjectLiteral
src/core/systems/dropSystem.ts:133:82
     const currentHealth = health.current[eid] ?? 0;
     if (currentHealth > 0) continue;
     if (processed.has(eid)) {
-      logger.warn('Skipping duplicate death processing for enemy in same frame', {
-        eid,
-        frameCount: world.frameCount,
-      });
+      logger.warn('Skipping duplicate death processing for enemy in same frame', {});
       continue;
     }

[Survived] ConditionalExpression
src/core/systems/dropSystem.ts:140:9
       continue;
     }
     // Skip entities already in death linger (processed on a prior frame)
-    if (hasComponent(world.ecs, eid, DeathTimer)) continue;
+    if (false) continue;
 
     processed.add(eid);

[Killed] ArithmeticOperator
src/core/systems/dropSystem.ts:155:18
     // Find the killing blow direction from the most recent hit event on this entity
     let killDirX = 0;
     let killDirY = 0;
-    for (let i = world.combatEvents.length - 1; i >= 0; i--) {
+    for (let i = world.combatEvents.length + 1; i >= 0; i--) {
       const evt = world.combatEvents[i]!;
       if (
killedBy: healthSystem removes entities with health at or below zero (after death timer expires)
statusReason: Cannot read properties of undefined (reading 'targetEid')

[Killed] EqualityOperator
src/core/systems/dropSystem.ts:155:49
     // Find the killing blow direction from the most recent hit event on this entity
     let killDirX = 0;
     let killDirY = 0;
-    for (let i = world.combatEvents.length - 1; i >= 0; i--) {
+    for (let i = world.combatEvents.length - 1; i < 0; i--) {
       const evt = world.combatEvents[i]!;
       if (
killedBy: healthSystem removes entities with health at or below zero (after death timer expires)
statusReason: Cannot read properties of undefined (reading 'targetEid')

[NoCoverage] EqualityOperator
src/core/systems/dropSystem.ts:158:9
     for (let i = world.combatEvents.length - 1; i >= 0; i--) {
       const evt = world.combatEvents[i]!;
       if (
-        evt.targetEid === eid &&
+        evt.targetEid !== eid &&
         evt.type === 'hit' &&
         evt.sourceX !== undefined &&

[NoCoverage] ConditionalExpression
src/core/systems/dropSystem.ts:158:9
     for (let i = world.combatEvents.length - 1; i >= 0; i--) {
       const evt = world.combatEvents[i]!;
       if (
-        evt.targetEid === eid &&
-        evt.type === 'hit' &&
+        true &&
         evt.sourceX !== undefined &&
         evt.sourceY !== undefined

[NoCoverage] EqualityOperator
src/core/systems/dropSystem.ts:159:9
       const evt = world.combatEvents[i]!;
       if (
         evt.targetEid === eid &&
-        evt.type === 'hit' &&
+        evt.type !== 'hit' &&
         evt.sourceX !== undefined &&
         evt.sourceY !== undefined

[NoCoverage] ConditionalExpression
src/core/systems/dropSystem.ts:159:9
       const evt = world.combatEvents[i]!;
       if (
         evt.targetEid === eid &&
-        evt.type === 'hit' &&
+        true &&
         evt.sourceX !== undefined &&
         evt.sourceY !== undefined

[NoCoverage] BlockStatement
src/core/systems/dropSystem.ts:162:9
         evt.type === 'hit' &&
         evt.sourceX !== undefined &&
         evt.sourceY !== undefined
-      ) {
-        const dx = x - evt.sourceX;
-        const dy = y - evt.sourceY;
-        const dist = Math.hypot(dx, dy);
-        if (dist > 0.01) {
-          killDirX = dx / dist;
-          killDirY = dy / dist;
-        }
-        break;
-      }
+      ) {}
     }
 

[NoCoverage] ArithmeticOperator
src/core/systems/dropSystem.ts:163:20
         evt.sourceX !== undefined &&
         evt.sourceY !== undefined
       ) {
-        const dx = x - evt.sourceX;
+        const dx = x + evt.sourceX;
         const dy = y - evt.sourceY;
         const dist = Math.hypot(dx, dy);

[NoCoverage] ArithmeticOperator
src/core/systems/dropSystem.ts:164:20
         evt.sourceY !== undefined
       ) {
         const dx = x - evt.sourceX;
-        const dy = y - evt.sourceY;
+        const dy = y + evt.sourceY;
         const dist = Math.hypot(dx, dy);
         if (dist > 0.01) {

[NoCoverage] BlockStatement
src/core/systems/dropSystem.ts:166:26
         const dx = x - evt.sourceX;
         const dy = y - evt.sourceY;
         const dist = Math.hypot(dx, dy);
-        if (dist > 0.01) {
-          killDirX = dx / dist;
-          killDirY = dy / dist;
-        }
+        if (dist > 0.01) {}
         break;
       }

[NoCoverage] EqualityOperator
src/core/systems/dropSystem.ts:166:13
         const dx = x - evt.sourceX;
         const dy = y - evt.sourceY;
         const dist = Math.hypot(dx, dy);
-        if (dist > 0.01) {
+        if (dist >= 0.01) {
           killDirX = dx / dist;
           killDirY = dy / dist;

[NoCoverage] ArithmeticOperator
src/core/systems/dropSystem.ts:167:22
         const dy = y - evt.sourceY;
         const dist = Math.hypot(dx, dy);
         if (dist > 0.01) {
-          killDirX = dx / dist;
+          killDirX = dx * dist;
           killDirY = dy / dist;
         }

[NoCoverage] ArithmeticOperator
src/core/systems/dropSystem.ts:168:22
         const dist = Math.hypot(dx, dy);
         if (dist > 0.01) {
           killDirX = dx / dist;
-          killDirY = dy / dist;
+          killDirY = dy * dist;
         }
         break;

[Survived] MethodExpression
src/core/systems/dropSystem.ts:175:27
     }
 
     // Apply death knockback (small impulse in the killing blow direction)
-    const knockbackDist = Math.min(DEATH_KNOCKBACK_MAX, DEATH_KNOCKBACK_BASE + overkill * 2);
+    const knockbackDist = Math.max(DEATH_KNOCKBACK_MAX, DEATH_KNOCKBACK_BASE + overkill * 2);
     if (knockbackDist > 0 && Math.abs(killDirX) + Math.abs(killDirY) > 0.01) {
       if (hasComponent(world.ecs, eid, Knockback)) {

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:175:80
     }
 
     // Apply death knockback (small impulse in the killing blow direction)
-    const knockbackDist = Math.min(DEATH_KNOCKBACK_MAX, DEATH_KNOCKBACK_BASE + overkill * 2);
+    const knockbackDist = Math.min(DEATH_KNOCKBACK_MAX, DEATH_KNOCKBACK_BASE + overkill / 2);
     if (knockbackDist > 0 && Math.abs(killDirX) + Math.abs(killDirY) > 0.01) {
       if (hasComponent(world.ecs, eid, Knockback)) {

[Survived] EqualityOperator
src/core/systems/dropSystem.ts:176:9
 
     // Apply death knockback (small impulse in the killing blow direction)
     const knockbackDist = Math.min(DEATH_KNOCKBACK_MAX, DEATH_KNOCKBACK_BASE + overkill * 2);
-    if (knockbackDist > 0 && Math.abs(killDirX) + Math.abs(killDirY) > 0.01) {
+    if (knockbackDist <= 0 && Math.abs(killDirX) + Math.abs(killDirY) > 0.01) {
       if (hasComponent(world.ecs, eid, Knockback)) {
         setComponent(world.ecs, eid, Knockback, {

[Survived] ArithmeticOperator
src/core/systems/dropSystem.ts:176:30
 
     // Apply death knockback (small impulse in the killing blow direction)
     const knockbackDist = Math.min(DEATH_KNOCKBACK_MAX, DEATH_KNOCKBACK_BASE + overkill * 2);
-    if (knockbackDist > 0 && Math.abs(killDirX) + Math.abs(killDirY) > 0.01) {
+    if (knockbackDist > 0 && Math.abs(killDirX) - Math.abs(killDirY) > 0.01) {
       if (hasComponent(world.ecs, eid, Knockback)) {
         setComponent(world.ecs, eid, Knockback, {

[NoCoverage] ConditionalExpression
src/core/systems/dropSystem.ts:177:11
     // Apply death knockback (small impulse in the killing blow direction)
     const knockbackDist = Math.min(DEATH_KNOCKBACK_MAX, DEATH_KNOCKBACK_BASE + overkill * 2);
     if (knockbackDist > 0 && Math.abs(killDirX) + Math.abs(killDirY) > 0.01) {
-      if (hasComponent(world.ecs, eid, Knockback)) {
+      if (false) {
         setComponent(world.ecs, eid, Knockback, {
           dirX: killDirX,

[NoCoverage] BlockStatement
src/core/systems/dropSystem.ts:177:52
     // Apply death knockback (small impulse in the killing blow direction)
     const knockbackDist = Math.min(DEATH_KNOCKBACK_MAX, DEATH_KNOCKBACK_BASE + overkill * 2);
     if (knockbackDist > 0 && Math.abs(killDirX) + Math.abs(killDirY) > 0.01) {
-      if (hasComponent(world.ecs, eid, Knockback)) {
-        setComponent(world.ecs, eid, Knockback, {
-          dirX: killDirX,
-          dirY: killDirY,
-          remaining: knockbackDist,
-          speed: DEATH_KNOCKBACK_SPEED,
-        });
-      } else {
+      if (hasComponent(world.ecs, eid, Knockback)) {} else {
         addComponent(
           world.ecs,

[NoCoverage] BlockStatement
src/core/systems/dropSystem.ts:184:14
           remaining: knockbackDist,
           speed: DEATH_KNOCKBACK_SPEED,
         });
-      } else {
-        addComponent(
-          world.ecs,
-          eid,
-          set(Knockback, {
-            dirX: killDirX,
-            dirY: killDirY,
-            remaining: knockbackDist,
-            speed: DEATH_KNOCKBACK_SPEED,
-          }),
-        );
-      }
+      } else {}
     }
 

[Killed] BlockStatement
src/core/systems/dropSystem.ts:198:20
       }
     }
 
-    if (spawnLoot) {
-      // Resolve and roll loot tables
-      const tables = getEnemyLootTables(world, eid);
-      const entries = resolveLootTables(
-        tables.entityTable,
-        tables.typeTable,
-        tables.areaTable,
-        tables.floorTable,
-      );
-      const drops = rollLootTable(entries, world.rng);
-      spawnDrops(world, x, y, drops);
-      logger.info('Processed enemy death drops', {
-        eid,
-        x,
-        y,
-        dropCount: drops.length,
-        floor: world.floor,
-      });
-    }
+    if (spawnLoot) {}
 
     // Emit death combat event for gore VFX (with direction info)
killedBy: healthSystem drops loot at enemy death position via dropSystem
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/core/systems/dropSystem.ts:198:9
       }
     }
 
-    if (spawnLoot) {
+    if (true) {
       // Resolve and roll loot tables
       const tables = getEnemyLootTables(world, eid);
killedBy: dropSystem can suppress loot while preserving death linger timing
statusReason: expected 1 to be +0 // Object.is equality

[Survived] StringLiteral
src/core/systems/dropSystem.ts:209:19
       );
       const drops = rollLootTable(entries, world.rng);
       spawnDrops(world, x, y, drops);
-      logger.info('Processed enemy death drops', {
+      logger.info("", {
         eid,
         x,

[Survived] ConditionalExpression
src/core/systems/dropSystem.ts:230:16
       overkill,
       knockbackDirX: killDirX,
       knockbackDirY: killDirY,
-      sourceX: killDirX !== 0 || killDirY !== 0 ? x - killDirX * 20 : undefined,
+      sourceX: true ? x - killDirX * 20 : undefined,
       sourceY: killDirX !== 0 || killDirY !== 0 ? y - killDirY * 20 : undefined,
     });

[NoCoverage] ArithmeticOperator
src/core/systems/dropSystem.ts:230:55
       overkill,
       knockbackDirX: killDirX,
       knockbackDirY: killDirY,
-      sourceX: killDirX !== 0 || killDirY !== 0 ? x - killDirX * 20 : undefined,
+      sourceX: killDirX !== 0 || killDirY !== 0 ? x - killDirX / 20 : undefined,
       sourceY: killDirX !== 0 || killDirY !== 0 ? y - killDirY * 20 : undefined,
     });

[Survived] ConditionalExpression
src/core/systems/dropSystem.ts:231:34
       knockbackDirX: killDirX,
       knockbackDirY: killDirY,
       sourceX: killDirX !== 0 || killDirY !== 0 ? x - killDirX * 20 : undefined,
-      sourceY: killDirX !== 0 || killDirY !== 0 ? y - killDirY * 20 : undefined,
+      sourceY: killDirX !== 0 || false ? y - killDirY * 20 : undefined,
     });
 

[NoCoverage] ArithmeticOperator
src/core/systems/dropSystem.ts:231:55
       knockbackDirX: killDirX,
       knockbackDirY: killDirY,
       sourceX: killDirX !== 0 || killDirY !== 0 ? x - killDirX * 20 : undefined,
-      sourceY: killDirX !== 0 || killDirY !== 0 ? y - killDirY * 20 : undefined,
+      sourceY: killDirX !== 0 || killDirY !== 0 ? y - killDirY / 20 : undefined,
     });
 
