[Survived] StringLiteral
src/game/abilities/registry.ts:7:18
   {
     id: 'battle-focus',
     name: 'Battle Focus',
-    description: 'Land enough hits to convert momentum into damage.',
+    description: "",
     category: 'combat',
     kind: 'active',

[Survived] StringLiteral
src/game/abilities/registry.ts:15:9
     effects: [{ type: 'stat_multiply', stat: 'damage', value: 0.15 }],
   },
   {
-    id: 'arcane-bolt',
+    id: "",
     name: 'Arcane Bolt',
     description: 'A memorized spell that amplifies your next attack cadence.',

[Survived] StringLiteral
src/game/abilities/registry.ts:17:18
   {
     id: 'arcane-bolt',
     name: 'Arcane Bolt',
-    description: 'A memorized spell that amplifies your next attack cadence.',
+    description: "",
     category: 'combat',
     kind: 'spell',

[Survived] ArrayDeclaration
src/game/abilities/registry.ts:22:14
     kind: 'spell',
     cooldownFrames: 45,
     trigger: { kind: 'manual' },
-    effects: [{ type: 'stat_multiply', stat: 'attackSpeed', value: 0.2 }],
+    effects: [],
   },
   {

[Killed] BlockStatement
src/game/abilities/registry.ts:44:44
 const parsed = parseAbilityCatalog(ABILITY_DEFINITIONS_RAW);
 const ABILITY_DEFINITIONS = Object.freeze(parsed.map((def) => Object.freeze({ ...def })));
 const registry = new Map<string, AbilityDefinition>();
-for (const ability of ABILITY_DEFINITIONS) {
-  registry.set(ability.id, ability);
-}
+for (const ability of ABILITY_DEFINITIONS) {}
 
 export function getAbilityDefinition(id: string): AbilityDefinition | undefined {
killedBy: abilitySystem enforces max 10 active abilities equipped
statusReason: expected [Function] to throw error matching /slot cap/i but got 'Unknown ability id: arcane-bolt'
