[Survived] StringLiteral
src/game/enemySpawnerSystem.ts:9:29
 import { createLogger } from '../shared/logger.js';
 import { ftToPx } from '../shared/units.js';
 
-const logger = createLogger('game:enemy-spawner');
+const logger = createLogger("");
 
 const ENEMY_RADIUS = ftToPx(1); // half of the default 16×16 enemy sprite

[Killed] ConditionalExpression
src/game/enemySpawnerSystem.ts:38:7
 function getSpawnerState(world: GameWorld): SpawnerState {
   let state = spawnerStates.get(world);
 
-  if (state === undefined) {
+  if (true) {
     state = { lastSpawnMs: Number.NEGATIVE_INFINITY };
     spawnerStates.set(world, state);
killedBy: enemySpawnerSystem enforces spawn interval timing
statusReason: expected [ 2, 3, 4 ] to have a length of 2 but got 3

[Survived] ArrayDeclaration
src/game/enemySpawnerSystem.ts:51:36
 }
 
 function getPlayerEntity(world: GameWorld): number | undefined {
-  const players = query(world.ecs, [Player, Position]);
+  const players = query(world.ecs, []);
   return players[0];
 }

[Killed] BlockStatement
src/game/enemySpawnerSystem.ts:61:9
   targetX: number,
   targetY: number,
   enemySpeed: number,
-): void {
-  const enemyX = world.stores.position.x[enemy] ?? 0;
-  const enemyY = world.stores.position.y[enemy] ?? 0;
-  const deltaX = targetX - enemyX;
-  const deltaY = targetY - enemyY;
-  const distance = Math.hypot(deltaX, deltaY);
-
-  if (distance <= 0.0001) {
-    setComponent(world.ecs, enemy, Velocity, { x: 0, y: 0 });
-    return;
-  }
-
-  setComponent(world.ecs, enemy, Velocity, {
-    x: (deltaX / distance) * enemySpeed,
-    y: (deltaY / distance) * enemySpeed,
-  });
-}
+): void {}
 
 function getRandomEdgePosition(world: GameWorld): { x: number; y: number } {
killedBy: enemySpawnerSystem gives spawned enemies velocity toward the player
statusReason: expected +0 to be close to -1.0802962239797471, received difference is 1.0802962239797471, but expected 0.0000049999999999999996

[Killed] ArithmeticOperator
src/game/enemySpawnerSystem.ts:64:18
 ): void {
   const enemyX = world.stores.position.x[enemy] ?? 0;
   const enemyY = world.stores.position.y[enemy] ?? 0;
-  const deltaX = targetX - enemyX;
+  const deltaX = targetX + enemyX;
   const deltaY = targetY - enemyY;
   const distance = Math.hypot(deltaX, deltaY);
killedBy: enemySpawnerSystem gives spawned enemies velocity toward the player
statusReason: expected 1.4281789064407349 to be close to -1.0802962239797471, received difference is 2.508475130420482, but expected 0.0000049999999999999996

[Killed] ArithmeticOperator
src/game/enemySpawnerSystem.ts:65:18
   const enemyX = world.stores.position.x[enemy] ?? 0;
   const enemyY = world.stores.position.y[enemy] ?? 0;
   const deltaX = targetX - enemyX;
-  const deltaY = targetY - enemyY;
+  const deltaY = targetY + enemyY;
   const distance = Math.hypot(deltaX, deltaY);
 
killedBy: enemySpawnerSystem gives spawned enemies velocity toward the player
statusReason: expected -1.041380763053894 to be close to -1.0802962239797471, received difference is 0.038915460925853074, but expected 0.0000049999999999999996

[Killed] BlockStatement
src/game/enemySpawnerSystem.ts:68:27
   const deltaY = targetY - enemyY;
   const distance = Math.hypot(deltaX, deltaY);
 
-  if (distance <= 0.0001) {
-    setComponent(world.ecs, enemy, Velocity, { x: 0, y: 0 });
-    return;
-  }
+  if (distance <= 0.0001) {}
 
   setComponent(world.ecs, enemy, Velocity, {
killedBy: enemySpawnerSystem sets velocity to zero when an enemy is exactly on top of the player
statusReason: expected NaN to be close to +0, received difference is NaN, but expected 0.005

[Killed] EqualityOperator
src/game/enemySpawnerSystem.ts:68:7
   const deltaY = targetY - enemyY;
   const distance = Math.hypot(deltaX, deltaY);
 
-  if (distance <= 0.0001) {
+  if (distance > 0.0001) {
     setComponent(world.ecs, enemy, Velocity, { x: 0, y: 0 });
     return;
killedBy: enemySpawnerSystem gives spawned enemies velocity toward the player
statusReason: expected +0 to be close to -1.0802962239797471, received difference is 1.0802962239797471, but expected 0.0000049999999999999996

[Killed] ObjectLiteral
src/game/enemySpawnerSystem.ts:73:44
     return;
   }
 
-  setComponent(world.ecs, enemy, Velocity, {
-    x: (deltaX / distance) * enemySpeed,
-    y: (deltaY / distance) * enemySpeed,
-  });
+  setComponent(world.ecs, enemy, Velocity, {});
 }
 
killedBy: enemySpawnerSystem gives spawned enemies velocity toward the player
statusReason: expected +0 to be close to -1.0802962239797471, received difference is 1.0802962239797471, but expected 0.0000049999999999999996

[Killed] ArithmeticOperator
src/game/enemySpawnerSystem.ts:74:8
   }
 
   setComponent(world.ecs, enemy, Velocity, {
-    x: (deltaX / distance) * enemySpeed,
+    x: deltaX / distance / enemySpeed,
     y: (deltaY / distance) * enemySpeed,
   });
killedBy: enemySpawnerSystem gives spawned enemies velocity toward the player
statusReason: expected -0.4801316559314728 to be close to -1.0802962239797471, received difference is 0.6001645680482743, but expected 0.0000049999999999999996

[Killed] ArithmeticOperator
src/game/enemySpawnerSystem.ts:74:9
   }
 
   setComponent(world.ecs, enemy, Velocity, {
-    x: (deltaX / distance) * enemySpeed,
+    x: (deltaX * distance) * enemySpeed,
     y: (deltaY / distance) * enemySpeed,
   });
killedBy: enemySpawnerSystem gives spawned enemies velocity toward the player
statusReason: expected -20827.62109375 to be close to -1.0802962239797471, received difference is 20826.54079752602, but expected 0.0000049999999999999996

[Killed] ArithmeticOperator
src/game/enemySpawnerSystem.ts:75:8
 
   setComponent(world.ecs, enemy, Velocity, {
     x: (deltaX / distance) * enemySpeed,
-    y: (deltaY / distance) * enemySpeed,
+    y: deltaY / distance / enemySpeed,
   });
 }
killedBy: enemySpawnerSystem gives spawned enemies velocity toward the player
statusReason: expected 0.462512731552124 to be close to 1.0406536736374403, received difference is 0.5781409420853163, but expected 0.0000049999999999999996

[Killed] ArithmeticOperator
src/game/enemySpawnerSystem.ts:75:9
 
   setComponent(world.ecs, enemy, Velocity, {
     x: (deltaX / distance) * enemySpeed,
-    y: (deltaY / distance) * enemySpeed,
+    y: (deltaY * distance) * enemySpeed,
   });
 }
killedBy: enemySpawnerSystem gives spawned enemies velocity toward the player
statusReason: expected 20063.330078125 to be close to 1.0406536736374403, received difference is 20062.289424451363, but expected 0.0000049999999999999996

[Survived] ConditionalExpression
src/game/enemySpawnerSystem.ts:84:5
   const edge = world.rng.nextInt(0, 3);
 
   switch (edge) {
-    case 0:
-      return { x: world.rng.next() * width, y: 0 };
+    case 0:
     case 1:
       return { x: width, y: world.rng.next() * height };

[Survived] ArithmeticOperator
src/game/enemySpawnerSystem.ts:85:19
 
   switch (edge) {
     case 0:
-      return { x: world.rng.next() * width, y: 0 };
+      return { x: world.rng.next() / width, y: 0 };
     case 1:
       return { x: width, y: world.rng.next() * height };

[Survived] ConditionalExpression
src/game/enemySpawnerSystem.ts:86:5
   switch (edge) {
     case 0:
       return { x: world.rng.next() * width, y: 0 };
-    case 1:
-      return { x: width, y: world.rng.next() * height };
+    case 1:
     case 2:
       return { x: world.rng.next() * width, y: height };

[Survived] ArithmeticOperator
src/game/enemySpawnerSystem.ts:87:29
     case 0:
       return { x: world.rng.next() * width, y: 0 };
     case 1:
-      return { x: width, y: world.rng.next() * height };
+      return { x: width, y: world.rng.next() / height };
     case 2:
       return { x: world.rng.next() * width, y: height };

[Survived] ConditionalExpression
src/game/enemySpawnerSystem.ts:88:5
       return { x: world.rng.next() * width, y: 0 };
     case 1:
       return { x: width, y: world.rng.next() * height };
-    case 2:
-      return { x: world.rng.next() * width, y: height };
+    case 2:
     default:
       return { x: 0, y: world.rng.next() * height };

[Survived] ArithmeticOperator
src/game/enemySpawnerSystem.ts:89:19
     case 1:
       return { x: width, y: world.rng.next() * height };
     case 2:
-      return { x: world.rng.next() * width, y: height };
+      return { x: world.rng.next() / width, y: height };
     default:
       return { x: 0, y: world.rng.next() * height };

[Survived] ArithmeticOperator
src/game/enemySpawnerSystem.ts:91:25
     case 2:
       return { x: world.rng.next() * width, y: height };
     default:
-      return { x: 0, y: world.rng.next() * height };
+      return { x: 0, y: world.rng.next() / height };
   }
 }

[Survived] ArithmeticOperator
src/game/enemySpawnerSystem.ts:106:23
   velocity: GameWorld['stores']['velocity'],
   enemySpeed: number,
 ): void {
-  const minDistance = ENEMY_RADIUS * 2 * (1 - MAX_OVERLAP_FRACTION);
+  const minDistance = ENEMY_RADIUS * 2 / (1 - MAX_OVERLAP_FRACTION);
 
   for (let i = 0; i < simpleEnemies.length; i += 1) {

[Survived] ArithmeticOperator
src/game/enemySpawnerSystem.ts:106:23
   velocity: GameWorld['stores']['velocity'],
   enemySpeed: number,
 ): void {
-  const minDistance = ENEMY_RADIUS * 2 * (1 - MAX_OVERLAP_FRACTION);
+  const minDistance = ENEMY_RADIUS / 2 * (1 - MAX_OVERLAP_FRACTION);
 
   for (let i = 0; i < simpleEnemies.length; i += 1) {

[Timeout] EqualityOperator
src/game/enemySpawnerSystem.ts:108:19
 ): void {
   const minDistance = ENEMY_RADIUS * 2 * (1 - MAX_OVERLAP_FRACTION);
 
-  for (let i = 0; i < simpleEnemies.length; i += 1) {
+  for (let i = 0; i >= simpleEnemies.length; i += 1) {
     const a = simpleEnemies[i]!;
     const ax = position.x[a] ?? 0;

[Survived] ConditionalExpression
src/game/enemySpawnerSystem.ts:108:19
 ): void {
   const minDistance = ENEMY_RADIUS * 2 * (1 - MAX_OVERLAP_FRACTION);
 
-  for (let i = 0; i < simpleEnemies.length; i += 1) {
+  for (let i = 0; false; i += 1) {
     const a = simpleEnemies[i]!;
     const ax = position.x[a] ?? 0;

[Timeout] EqualityOperator
src/game/enemySpawnerSystem.ts:113:25
     const ax = position.x[a] ?? 0;
     const ay = position.y[a] ?? 0;
 
-    for (let j = i + 1; j < simpleEnemies.length; j += 1) {
+    for (let j = i + 1; j >= simpleEnemies.length; j += 1) {
       const b = simpleEnemies[j]!;
       const bx = position.x[b] ?? 0;

[Timeout] AssignmentOperator
src/game/enemySpawnerSystem.ts:113:51
     const ax = position.x[a] ?? 0;
     const ay = position.y[a] ?? 0;
 
-    for (let j = i + 1; j < simpleEnemies.length; j += 1) {
+    for (let j = i + 1; j < simpleEnemies.length; j -= 1) {
       const b = simpleEnemies[j]!;
       const bx = position.x[b] ?? 0;

[Survived] ArithmeticOperator
src/game/enemySpawnerSystem.ts:118:18
       const bx = position.x[b] ?? 0;
       const by = position.y[b] ?? 0;
 
-      const dx = ax - bx;
+      const dx = ax + bx;
       const dy = ay - by;
       const dist = Math.hypot(dx, dy);

[Survived] ArithmeticOperator
src/game/enemySpawnerSystem.ts:119:18
       const by = position.y[b] ?? 0;
 
       const dx = ax - bx;
-      const dy = ay - by;
+      const dy = ay + by;
       const dist = Math.hypot(dx, dy);
 

[Survived] BlockStatement
src/game/enemySpawnerSystem.ts:122:32
       const dy = ay - by;
       const dist = Math.hypot(dx, dy);
 
-      if (dist >= minDistance) {
-        continue;
-      }
+      if (dist >= minDistance) {}
 
       let nx: number;

[Survived] ConditionalExpression
src/game/enemySpawnerSystem.ts:122:11
       const dy = ay - by;
       const dist = Math.hypot(dx, dy);
 
-      if (dist >= minDistance) {
+      if (false) {
         continue;
       }

[NoCoverage] EqualityOperator
src/game/enemySpawnerSystem.ts:130:11
       let ny: number;
       let penetration: number;
 
-      if (dist <= EPSILON) {
+      if (dist > EPSILON) {
         nx = a % 2 === 0 ? 1 : -1;
         ny = b % 2 === 0 ? 1 : -1;

[NoCoverage] ConditionalExpression
src/game/enemySpawnerSystem.ts:130:11
       let ny: number;
       let penetration: number;
 
-      if (dist <= EPSILON) {
+      if (false) {
         nx = a % 2 === 0 ? 1 : -1;
         ny = b % 2 === 0 ? 1 : -1;

[NoCoverage] ConditionalExpression
src/game/enemySpawnerSystem.ts:131:14
       let penetration: number;
 
       if (dist <= EPSILON) {
-        nx = a % 2 === 0 ? 1 : -1;
+        nx = false ? 1 : -1;
         ny = b % 2 === 0 ? 1 : -1;
         const len = Math.hypot(nx, ny);

[NoCoverage] EqualityOperator
src/game/enemySpawnerSystem.ts:131:14
       let penetration: number;
 
       if (dist <= EPSILON) {
-        nx = a % 2 === 0 ? 1 : -1;
+        nx = a % 2 !== 0 ? 1 : -1;
         ny = b % 2 === 0 ? 1 : -1;
         const len = Math.hypot(nx, ny);

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:132:14
 
       if (dist <= EPSILON) {
         nx = a % 2 === 0 ? 1 : -1;
-        ny = b % 2 === 0 ? 1 : -1;
+        ny = b * 2 === 0 ? 1 : -1;
         const len = Math.hypot(nx, ny);
         nx /= len;

[NoCoverage] UnaryOperator
src/game/enemySpawnerSystem.ts:132:32
 
       if (dist <= EPSILON) {
         nx = a % 2 === 0 ? 1 : -1;
-        ny = b % 2 === 0 ? 1 : -1;
+        ny = b % 2 === 0 ? 1 : +1;
         const len = Math.hypot(nx, ny);
         nx /= len;

[NoCoverage] AssignmentOperator
src/game/enemySpawnerSystem.ts:134:9
         nx = a % 2 === 0 ? 1 : -1;
         ny = b % 2 === 0 ? 1 : -1;
         const len = Math.hypot(nx, ny);
-        nx /= len;
+        nx *= len;
         ny /= len;
         penetration = 1;

[NoCoverage] AssignmentOperator
src/game/enemySpawnerSystem.ts:135:9
         ny = b % 2 === 0 ? 1 : -1;
         const len = Math.hypot(nx, ny);
         nx /= len;
-        ny /= len;
+        ny *= len;
         penetration = 1;
       } else {

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:138:24
         ny /= len;
         penetration = 1;
       } else {
-        penetration = (minDistance - dist) / minDistance;
+        penetration = (minDistance + dist) / minDistance;
         nx = dx / dist;
         ny = dy / dist;

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:138:23
         ny /= len;
         penetration = 1;
       } else {
-        penetration = (minDistance - dist) / minDistance;
+        penetration = (minDistance - dist) * minDistance;
         nx = dx / dist;
         ny = dy / dist;

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:139:14
         penetration = 1;
       } else {
         penetration = (minDistance - dist) / minDistance;
-        nx = dx / dist;
+        nx = dx * dist;
         ny = dy / dist;
       }

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:140:14
       } else {
         penetration = (minDistance - dist) / minDistance;
         nx = dx / dist;
-        ny = dy / dist;
+        ny = dy * dist;
       }
 

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:143:21
         ny = dy / dist;
       }
 
-      const force = penetration * SEPARATION_FORCE;
+      const force = penetration / SEPARATION_FORCE;
       velocity.x[a] = (velocity.x[a] ?? 0) + nx * force;
       velocity.y[a] = (velocity.y[a] ?? 0) + ny * force;

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:144:46
       }
 
       const force = penetration * SEPARATION_FORCE;
-      velocity.x[a] = (velocity.x[a] ?? 0) + nx * force;
+      velocity.x[a] = (velocity.x[a] ?? 0) + nx / force;
       velocity.y[a] = (velocity.y[a] ?? 0) + ny * force;
       velocity.x[b] = (velocity.x[b] ?? 0) - nx * force;

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:144:23
       }
 
       const force = penetration * SEPARATION_FORCE;
-      velocity.x[a] = (velocity.x[a] ?? 0) + nx * force;
+      velocity.x[a] = (velocity.x[a] ?? 0) - nx * force;
       velocity.y[a] = (velocity.y[a] ?? 0) + ny * force;
       velocity.x[b] = (velocity.x[b] ?? 0) - nx * force;

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:145:23
 
       const force = penetration * SEPARATION_FORCE;
       velocity.x[a] = (velocity.x[a] ?? 0) + nx * force;
-      velocity.y[a] = (velocity.y[a] ?? 0) + ny * force;
+      velocity.y[a] = (velocity.y[a] ?? 0) - ny * force;
       velocity.x[b] = (velocity.x[b] ?? 0) - nx * force;
       velocity.y[b] = (velocity.y[b] ?? 0) - ny * force;

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:145:46
 
       const force = penetration * SEPARATION_FORCE;
       velocity.x[a] = (velocity.x[a] ?? 0) + nx * force;
-      velocity.y[a] = (velocity.y[a] ?? 0) + ny * force;
+      velocity.y[a] = (velocity.y[a] ?? 0) + ny / force;
       velocity.x[b] = (velocity.x[b] ?? 0) - nx * force;
       velocity.y[b] = (velocity.y[b] ?? 0) - ny * force;

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:146:23
       const force = penetration * SEPARATION_FORCE;
       velocity.x[a] = (velocity.x[a] ?? 0) + nx * force;
       velocity.y[a] = (velocity.y[a] ?? 0) + ny * force;
-      velocity.x[b] = (velocity.x[b] ?? 0) - nx * force;
+      velocity.x[b] = (velocity.x[b] ?? 0) + nx * force;
       velocity.y[b] = (velocity.y[b] ?? 0) - ny * force;
     }

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:146:46
       const force = penetration * SEPARATION_FORCE;
       velocity.x[a] = (velocity.x[a] ?? 0) + nx * force;
       velocity.y[a] = (velocity.y[a] ?? 0) + ny * force;
-      velocity.x[b] = (velocity.x[b] ?? 0) - nx * force;
+      velocity.x[b] = (velocity.x[b] ?? 0) - nx / force;
       velocity.y[b] = (velocity.y[b] ?? 0) - ny * force;
     }

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:147:46
       velocity.x[a] = (velocity.x[a] ?? 0) + nx * force;
       velocity.y[a] = (velocity.y[a] ?? 0) + ny * force;
       velocity.x[b] = (velocity.x[b] ?? 0) - nx * force;
-      velocity.y[b] = (velocity.y[b] ?? 0) - ny * force;
+      velocity.y[b] = (velocity.y[b] ?? 0) - ny / force;
     }
   }

[NoCoverage] ArithmeticOperator
src/game/enemySpawnerSystem.ts:147:23
       velocity.x[a] = (velocity.x[a] ?? 0) + nx * force;
       velocity.y[a] = (velocity.y[a] ?? 0) + ny * force;
       velocity.x[b] = (velocity.x[b] ?? 0) - nx * force;
-      velocity.y[b] = (velocity.y[b] ?? 0) - ny * force;
+      velocity.y[b] = (velocity.y[b] ?? 0) + ny * force;
     }
   }

[Survived] BlockStatement
src/game/enemySpawnerSystem.ts:152:36
   }
 
   // Clamp each enemy's velocity to its configured speed
-  for (const eid of simpleEnemies) {
-    const vx = velocity.x[eid] ?? 0;
-    const vy = velocity.y[eid] ?? 0;
-    const mag = Math.hypot(vx, vy);
-
-    if (mag > enemySpeed && mag > EPSILON) {
-      const scale = enemySpeed / mag;
-      velocity.x[eid] = vx * scale;
-      velocity.y[eid] = vy * scale;
-    }
-  }
+  for (const eid of simpleEnemies) {}
 }
 

[Killed] ConditionalExpression
src/game/enemySpawnerSystem.ts:157:9
     const vy = velocity.y[eid] ?? 0;
     const mag = Math.hypot(vx, vy);
 
-    if (mag > enemySpeed && mag > EPSILON) {
+    if (true) {
       const scale = enemySpeed / mag;
       velocity.x[eid] = vx * scale;
killedBy: enemySpawnerSystem sets velocity to zero when an enemy is exactly on top of the player
statusReason: expected NaN to be close to +0, received difference is NaN, but expected 0.005

[Survived] LogicalOperator
src/game/enemySpawnerSystem.ts:157:9
     const vy = velocity.y[eid] ?? 0;
     const mag = Math.hypot(vx, vy);
 
-    if (mag > enemySpeed && mag > EPSILON) {
+    if (mag > enemySpeed || mag > EPSILON) {
       const scale = enemySpeed / mag;
       velocity.x[eid] = vx * scale;

[Survived] ArithmeticOperator
src/game/enemySpawnerSystem.ts:158:21
     const mag = Math.hypot(vx, vy);
 
     if (mag > enemySpeed && mag > EPSILON) {
-      const scale = enemySpeed / mag;
+      const scale = enemySpeed * mag;
       velocity.x[eid] = vx * scale;
       velocity.y[eid] = vy * scale;

[Survived] ArithmeticOperator
src/game/enemySpawnerSystem.ts:159:25
 
     if (mag > enemySpeed && mag > EPSILON) {
       const scale = enemySpeed / mag;
-      velocity.x[eid] = vx * scale;
+      velocity.x[eid] = vx / scale;
       velocity.y[eid] = vy * scale;
     }

[Survived] ArithmeticOperator
src/game/enemySpawnerSystem.ts:160:25
     if (mag > enemySpeed && mag > EPSILON) {
       const scale = enemySpeed / mag;
       velocity.x[eid] = vx * scale;
-      velocity.y[eid] = vy * scale;
+      velocity.y[eid] = vy / scale;
     }
   }

[Survived] BlockStatement
src/game/enemySpawnerSystem.ts:165:86
   }
 }
 
-export function configureEnemySpawner(world: GameWorld, bounds: SpawnerBounds): void {
-  spawnerBounds.set(world, {
-    width: Math.max(1, bounds.width),
-    height: Math.max(1, bounds.height),
-  });
-  logger.info('Configured enemy spawner bounds', {
-    width: Math.max(1, bounds.width),
-    height: Math.max(1, bounds.height),
-  });
-}
+export function configureEnemySpawner(world: GameWorld, bounds: SpawnerBounds): void {}
 
 export function enemySpawnerSystem(world: GameWorld, config: SpawnerConfig): void {

[Survived] MethodExpression
src/game/enemySpawnerSystem.ts:167:12
 
 export function configureEnemySpawner(world: GameWorld, bounds: SpawnerBounds): void {
   spawnerBounds.set(world, {
-    width: Math.max(1, bounds.width),
+    width: Math.min(1, bounds.width),
     height: Math.max(1, bounds.height),
   });

[Survived] MethodExpression
src/game/enemySpawnerSystem.ts:168:13
 export function configureEnemySpawner(world: GameWorld, bounds: SpawnerBounds): void {
   spawnerBounds.set(world, {
     width: Math.max(1, bounds.width),
-    height: Math.max(1, bounds.height),
+    height: Math.min(1, bounds.height),
   });
   logger.info('Configured enemy spawner bounds', {

[Survived] ObjectLiteral
src/game/enemySpawnerSystem.ts:170:50
     width: Math.max(1, bounds.width),
     height: Math.max(1, bounds.height),
   });
-  logger.info('Configured enemy spawner bounds', {
-    width: Math.max(1, bounds.width),
-    height: Math.max(1, bounds.height),
-  });
+  logger.info('Configured enemy spawner bounds', {});
 }
 

[Survived] MethodExpression
src/game/enemySpawnerSystem.ts:171:12
     height: Math.max(1, bounds.height),
   });
   logger.info('Configured enemy spawner bounds', {
-    width: Math.max(1, bounds.width),
+    width: Math.min(1, bounds.width),
     height: Math.max(1, bounds.height),
   });

[Survived] BlockStatement
src/game/enemySpawnerSystem.ts:189:32
   const enemies = query(world.ecs, [Enemy, Position, Velocity]);
   const simpleEnemies: number[] = [];
 
-  for (const enemy of enemies) {
-    if (enemy === undefined) {
-      continue;
-    }
-
-    // Skip enemies with AI behavior — they're steered by enemyAISystem
-    if (hasComponent(world.ecs, enemy, EnemyBehavior)) {
-      continue;
-    }
-
-    setVelocityTowardPlayer(world, enemy, playerX, playerY, config.enemySpeed);
-    simpleEnemies.push(enemy);
-  }
+  for (const enemy of enemies) {}
 
   // Apply separation to prevent simple enemies from stacking on each other

[Survived] ConditionalExpression
src/game/enemySpawnerSystem.ts:190:9
   const simpleEnemies: number[] = [];
 
   for (const enemy of enemies) {
-    if (enemy === undefined) {
+    if (false) {
       continue;
     }

[Survived] ConditionalExpression
src/game/enemySpawnerSystem.ts:190:9
   const simpleEnemies: number[] = [];
 
   for (const enemy of enemies) {
-    if (enemy === undefined) {
+    if (true) {
       continue;
     }

[Killed] BlockStatement
src/game/enemySpawnerSystem.ts:195:56
     }
 
     // Skip enemies with AI behavior — they're steered by enemyAISystem
-    if (hasComponent(world.ecs, enemy, EnemyBehavior)) {
-      continue;
-    }
+    if (hasComponent(world.ecs, enemy, EnemyBehavior)) {}
 
     setVelocityTowardPlayer(world, enemy, playerX, playerY, config.enemySpeed);
killedBy: enemySpawnerSystem skips steering enemies that use EnemyBehavior
statusReason: expected 0.906183123588562 to be close to 0.25, received difference is 0.656183123588562, but expected 0.005

[Killed] ConditionalExpression
src/game/enemySpawnerSystem.ts:195:9
     }
 
     // Skip enemies with AI behavior — they're steered by enemyAISystem
-    if (hasComponent(world.ecs, enemy, EnemyBehavior)) {
+    if (false) {
       continue;
     }
killedBy: enemySpawnerSystem skips steering enemies that use EnemyBehavior
statusReason: expected 0.906183123588562 to be close to 0.25, received difference is 0.656183123588562, but expected 0.005

[Killed] ConditionalExpression
src/game/enemySpawnerSystem.ts:206:7
   // Apply separation to prevent simple enemies from stacking on each other
   applySeparation(simpleEnemies, world.stores.position, world.stores.velocity, config.enemySpeed);
 
-  if (enemies.length >= config.maxEnemies) {
+  if (true) {
     return;
   }
killedBy: enemySpawnerSystem spawns enemies up to the configured max count
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/game/enemySpawnerSystem.ts:206:7
   // Apply separation to prevent simple enemies from stacking on each other
   applySeparation(simpleEnemies, world.stores.position, world.stores.velocity, config.enemySpeed);
 
-  if (enemies.length >= config.maxEnemies) {
+  if (enemies.length < config.maxEnemies) {
     return;
   }
killedBy: enemySpawnerSystem spawns enemies up to the configured max count
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/game/enemySpawnerSystem.ts:212:69
 
   const state = getSpawnerState(world);
 
-  if (world.elapsedMs - state.lastSpawnMs < config.spawnIntervalMs) {
-    return;
-  }
+  if (world.elapsedMs - state.lastSpawnMs < config.spawnIntervalMs) {}
 
   const spawnPoint = getRandomEdgePosition(world);
killedBy: enemySpawnerSystem enforces spawn interval timing
statusReason: expected [ 2, 3, 4 ] to have a length of 2 but got 3

[Killed] EqualityOperator
src/game/enemySpawnerSystem.ts:212:7
 
   const state = getSpawnerState(world);
 
-  if (world.elapsedMs - state.lastSpawnMs < config.spawnIntervalMs) {
+  if (world.elapsedMs - state.lastSpawnMs <= config.spawnIntervalMs) {
     return;
   }
killedBy: enemySpawnerSystem spawns enemies up to the configured max count
statusReason: expected 1 to be 2 // Object.is equality

[Survived] StringLiteral
src/game/enemySpawnerSystem.ts:220:16
   const enemy = spawnEnemy(world, spawnPoint.x, spawnPoint.y, config.enemyHp);
   setVelocityTowardPlayer(world, enemy, playerX, playerY, config.enemySpeed);
   state.lastSpawnMs = world.elapsedMs;
-  logger.debug('Spawned enemy', {
+  logger.debug("", {
     enemy,
     x: spawnPoint.x,
