[Survived] MethodExpression
src/game/skills/registry.ts:34:9
 
 const skillSchema: z.ZodType<SkillDefinition> = z
   .object({
-    id: z
-      .string()
-      .trim()
+    id: z.string()
       .regex(/^[a-z0-9-]+$/),
     name: z.string().trim().min(1),

[Survived] MethodExpression
src/game/skills/registry.ts:38:11
       .string()
       .trim()
       .regex(/^[a-z0-9-]+$/),
-    name: z.string().trim().min(1),
+    name: z.string().min(1),
     description: z.string().trim().min(1),
     category: z.enum(['combat', 'defense', 'utility']),

[Survived] MethodExpression
src/game/skills/registry.ts:38:11
       .string()
       .trim()
       .regex(/^[a-z0-9-]+$/),
-    name: z.string().trim().min(1),
+    name: z.string().trim().max(1),
     description: z.string().trim().min(1),
     category: z.enum(['combat', 'defense', 'utility']),

[Survived] MethodExpression
src/game/skills/registry.ts:39:18
       .trim()
       .regex(/^[a-z0-9-]+$/),
     name: z.string().trim().min(1),
-    description: z.string().trim().min(1),
+    description: z.string().trim().max(1),
     category: z.enum(['combat', 'defense', 'utility']),
     usageMetric: z.enum(['hits_landed', 'damage_dealt', 'distance_dodged_near_threat']),

[Survived] MethodExpression
src/game/skills/registry.ts:39:18
       .trim()
       .regex(/^[a-z0-9-]+$/),
     name: z.string().trim().min(1),
-    description: z.string().trim().min(1),
+    description: z.string().min(1),
     category: z.enum(['combat', 'defense', 'utility']),
     usageMetric: z.enum(['hits_landed', 'damage_dealt', 'distance_dodged_near_threat']),

[Survived] ArrayDeclaration
src/game/skills/registry.ts:41:25
     name: z.string().trim().min(1),
     description: z.string().trim().min(1),
     category: z.enum(['combat', 'defense', 'utility']),
-    usageMetric: z.enum(['hits_landed', 'damage_dealt', 'distance_dodged_near_threat']),
+    usageMetric: z.enum([]),
     usageThresholds: z.array(z.number().int().positive()),
     perLevelBonus: perLevelBonusSchema,

[Survived] MethodExpression
src/game/skills/registry.ts:49:19
         z
           .object({
             level: skillMilestoneLevelSchema,
-            name: z.string().trim().min(1),
+            name: z.string().min(1),
             description: z.string().trim().min(1),
             effect: milestoneEffectSchema,

[Survived] MethodExpression
src/game/skills/registry.ts:49:19
         z
           .object({
             level: skillMilestoneLevelSchema,
-            name: z.string().trim().min(1),
+            name: z.string().trim().max(1),
             description: z.string().trim().min(1),
             effect: milestoneEffectSchema,

[Survived] MethodExpression
src/game/skills/registry.ts:56:17
           .strict(),
       )
       .length(4),
-    flavorText: z.string().trim().min(1).optional(),
+    flavorText: z.string().trim().max(1).optional(),
   })
   .strict()

[Survived] MethodExpression
src/game/skills/registry.ts:56:17
           .strict(),
       )
       .length(4),
-    flavorText: z.string().trim().min(1).optional(),
+    flavorText: z.string().min(1).optional(),
   })
   .strict()

[Survived] ConditionalExpression
src/game/skills/registry.ts:60:9
   })
   .strict()
   .superRefine((value, ctx) => {
-    if (value.usageThresholds.length !== SKILL_HARD_CAP) {
+    if (true) {
       ctx.addIssue({
         code: z.ZodIssueCode.custom,

[Survived] ConditionalExpression
src/game/skills/registry.ts:60:9
   })
   .strict()
   .superRefine((value, ctx) => {
-    if (value.usageThresholds.length !== SKILL_HARD_CAP) {
+    if (false) {
       ctx.addIssue({
         code: z.ZodIssueCode.custom,

[Timeout] UpdateOperator
src/game/skills/registry.ts:68:55
       });
     }
 
-    for (let i = 1; i < value.usageThresholds.length; i++) {
+    for (let i = 1; i < value.usageThresholds.length; i--) {
       if (value.usageThresholds[i]! <= value.usageThresholds[i - 1]!) {
         ctx.addIssue({

[Survived] BlockStatement
src/game/skills/registry.ts:68:60
       });
     }
 
-    for (let i = 1; i < value.usageThresholds.length; i++) {
-      if (value.usageThresholds[i]! <= value.usageThresholds[i - 1]!) {
-        ctx.addIssue({
-          code: z.ZodIssueCode.custom,
-          message: 'usageThresholds must be strictly increasing',
-          path: ['usageThresholds', i],
-        });
-      }
-    }
+    for (let i = 1; i < value.usageThresholds.length; i++) {}
 
     const levels = value.milestones.map((m) => m.level).sort((a, b) => a - b);

[Survived] ConditionalExpression
src/game/skills/registry.ts:69:11
     }
 
     for (let i = 1; i < value.usageThresholds.length; i++) {
-      if (value.usageThresholds[i]! <= value.usageThresholds[i - 1]!) {
+      if (true) {
         ctx.addIssue({
           code: z.ZodIssueCode.custom,

[Survived] ConditionalExpression
src/game/skills/registry.ts:69:11
     }
 
     for (let i = 1; i < value.usageThresholds.length; i++) {
-      if (value.usageThresholds[i]! <= value.usageThresholds[i - 1]!) {
+      if (false) {
         ctx.addIssue({
           code: z.ZodIssueCode.custom,

[Survived] ArithmeticOperator
src/game/skills/registry.ts:78:72
       }
     }
 
-    const levels = value.milestones.map((m) => m.level).sort((a, b) => a - b);
+    const levels = value.milestones.map((m) => m.level).sort((a, b) => a + b);
     const expected = [5, 10, 15, 20];
     for (let i = 0; i < expected.length; i++) {

[Survived] MethodExpression
src/game/skills/registry.ts:78:20
       }
     }
 
-    const levels = value.milestones.map((m) => m.level).sort((a, b) => a - b);
+    const levels = value.milestones.map(m => m.level);
     const expected = [5, 10, 15, 20];
     for (let i = 0; i < expected.length; i++) {

[Timeout] UpdateOperator
src/game/skills/registry.ts:80:42
 
     const levels = value.milestones.map((m) => m.level).sort((a, b) => a - b);
     const expected = [5, 10, 15, 20];
-    for (let i = 0; i < expected.length; i++) {
+    for (let i = 0; i < expected.length; i--) {
       if (levels[i] !== expected[i]) {
         ctx.addIssue({

[Survived] EqualityOperator
src/game/skills/registry.ts:80:21
 
     const levels = value.milestones.map((m) => m.level).sort((a, b) => a - b);
     const expected = [5, 10, 15, 20];
-    for (let i = 0; i < expected.length; i++) {
+    for (let i = 0; i >= expected.length; i++) {
       if (levels[i] !== expected[i]) {
         ctx.addIssue({

[Survived] ConditionalExpression
src/game/skills/registry.ts:81:11
     const levels = value.milestones.map((m) => m.level).sort((a, b) => a - b);
     const expected = [5, 10, 15, 20];
     for (let i = 0; i < expected.length; i++) {
-      if (levels[i] !== expected[i]) {
+      if (true) {
         ctx.addIssue({
           code: z.ZodIssueCode.custom,

[Survived] ConditionalExpression
src/game/skills/registry.ts:81:11
     const levels = value.milestones.map((m) => m.level).sort((a, b) => a - b);
     const expected = [5, 10, 15, 20];
     for (let i = 0; i < expected.length; i++) {
-      if (levels[i] !== expected[i]) {
+      if (false) {
         ctx.addIssue({
           code: z.ZodIssueCode.custom,

[Killed] BlockStatement
src/game/skills/registry.ts:92:78
     }
   });
 
-const skillCatalogSchema = z.array(skillSchema).superRefine((skills, ctx) => {
-  const ids = new Set<string>();
-  for (const skill of skills) {
-    if (ids.has(skill.id)) {
-      ctx.addIssue({
-        code: z.ZodIssueCode.custom,
-        message: `Duplicate skill id: ${skill.id}`,
-      });
-    }
-    ids.add(skill.id);
-  }
-});
+const skillCatalogSchema = z.array(skillSchema).superRefine((skills, ctx) => {});
 
 /** Real skills — all silly-skill content deferred to v2. */
killedBy: skill registry rejects duplicate skill IDs
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/game/skills/registry.ts:94:31
 
 const skillCatalogSchema = z.array(skillSchema).superRefine((skills, ctx) => {
   const ids = new Set<string>();
-  for (const skill of skills) {
-    if (ids.has(skill.id)) {
-      ctx.addIssue({
-        code: z.ZodIssueCode.custom,
-        message: `Duplicate skill id: ${skill.id}`,
-      });
-    }
-    ids.add(skill.id);
-  }
+  for (const skill of skills) {}
 });
 
killedBy: skill registry rejects duplicate skill IDs
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/game/skills/registry.ts:95:28
 const skillCatalogSchema = z.array(skillSchema).superRefine((skills, ctx) => {
   const ids = new Set<string>();
   for (const skill of skills) {
-    if (ids.has(skill.id)) {
-      ctx.addIssue({
-        code: z.ZodIssueCode.custom,
-        message: `Duplicate skill id: ${skill.id}`,
-      });
-    }
+    if (ids.has(skill.id)) {}
     ids.add(skill.id);
   }
killedBy: skill registry rejects duplicate skill IDs
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/game/skills/registry.ts:95:9
 const skillCatalogSchema = z.array(skillSchema).superRefine((skills, ctx) => {
   const ids = new Set<string>();
   for (const skill of skills) {
-    if (ids.has(skill.id)) {
+    if (false) {
       ctx.addIssue({
         code: z.ZodIssueCode.custom,
killedBy: skill registry rejects duplicate skill IDs
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
src/game/skills/registry.ts:109:11
 const SKILL_DEFINITIONS_RAW: SkillDefinition[] = [
   {
     id: 'swordsmanship',
-    name: 'Swordsmanship',
+    name: "",
     description: 'Mastery of melee and ranged precision. Every hit sharpens the edge.',
     category: 'combat',

[Survived] ArrayDeclaration
src/game/skills/registry.ts:113:22
     description: 'Mastery of melee and ranged precision. Every hit sharpens the edge.',
     category: 'combat',
     usageMetric: 'hits_landed',
-    usageThresholds: [
-      10, 25, 45, 70, 100, 135, 175, 220, 270, 325, 385, 450, 520, 595, 675, 760, 850, 945, 1045,
-      1150,
-    ],
+    usageThresholds: [],
     perLevelBonus: { damage: 1 },
     milestones: [

[Survived] StringLiteral
src/game/skills/registry.ts:127:15
       },
       {
         level: 10,
-        name: 'Double Strike',
+        name: "",
         description: '+1 extra projectile per attack',
         effect: { type: 'extra_projectile', count: 1 },

[Survived] StringLiteral
src/game/skills/registry.ts:128:22
       {
         level: 10,
         name: 'Double Strike',
-        description: '+1 extra projectile per attack',
+        description: "",
         effect: { type: 'extra_projectile', count: 1 },
       },

[Survived] StringLiteral
src/game/skills/registry.ts:134:22
       {
         level: 15,
         name: 'Bladestorm',
-        description: '+25% damage multiplier',
+        description: "",
         effect: { type: 'stat_multiply', stat: 'damage', value: 0.25 },
       },

[Survived] StringLiteral
src/game/skills/registry.ts:139:15
       },
       {
         level: 20,
-        name: 'Absolute Mastery',
+        name: "",
         description: '+50% damage multiplier',
         effect: { type: 'stat_multiply', stat: 'damage', value: 0.5 },

[Survived] StringLiteral
src/game/skills/registry.ts:144:17
         effect: { type: 'stat_multiply', stat: 'damage', value: 0.5 },
       },
     ],
-    flavorText: '"The arena demands precision. The audience demands spectacle." — The Director',
+    flavorText: "",
   },
   {

[Survived] StringLiteral
src/game/skills/registry.ts:147:9
     flavorText: '"The arena demands precision. The audience demands spectacle." — The Director',
   },
   {
-    id: 'iron-skin',
+    id: "",
     name: 'Iron Skin',
     description: 'Hardened through punishment. Each blow you survive makes you harder to kill.',

[Survived] StringLiteral
src/game/skills/registry.ts:148:11
   },
   {
     id: 'iron-skin',
-    name: 'Iron Skin',
+    name: "",
     description: 'Hardened through punishment. Each blow you survive makes you harder to kill.',
     category: 'defense',

[Survived] StringLiteral
src/game/skills/registry.ts:160:15
     milestones: [
       {
         level: 5,
-        name: 'Toughened Hide',
+        name: "",
         description: '+20 max HP',
         effect: { type: 'stat_add', stat: 'maxHp', value: 20 },

[Survived] StringLiteral
src/game/skills/registry.ts:167:22
       {
         level: 10,
         name: 'Stone Wall',
-        description: '+5 armor',
+        description: "",
         effect: { type: 'stat_add', stat: 'armor', value: 5 },
       },

[Survived] StringLiteral
src/game/skills/registry.ts:178:15
       },
       {
         level: 20,
-        name: 'Juggernaut',
+        name: "",
         description: 'Aura — damages nearby enemies for 5% of your damage per second',
         effect: { type: 'aura', radius: 6, dpsPercentOfDamage: 0.05 },

[Survived] StringLiteral
src/game/skills/registry.ts:187:9
       '"Audience engagement peaks when performers survive against all odds." — The Director',
   },
   {
-    id: 'sprint',
+    id: "",
     name: 'Sprint',
     description: 'Keep moving. The arena rewards agility.',

[Survived] ArrayDeclaration
src/game/skills/registry.ts:192:22
     description: 'Keep moving. The arena rewards agility.',
     category: 'utility',
     usageMetric: 'distance_dodged_near_threat',
-    usageThresholds: [
-      30, 80, 150, 240, 350, 480, 630, 800, 990, 1200, 1430, 1680, 1950, 2240, 2550, 2880, 3230,
-      3600, 3990, 4400,
-    ],
+    usageThresholds: [],
     perLevelBonus: { moveSpeed: 0.05, pickupRange: 2 },
     milestones: [

[Survived] ObjectLiteral
src/game/skills/registry.ts:196:20
       30, 80, 150, 240, 350, 480, 630, 800, 990, 1200, 1430, 1680, 1950, 2240, 2550, 2880, 3230,
       3600, 3990, 4400,
     ],
-    perLevelBonus: { moveSpeed: 0.05, pickupRange: 2 },
+    perLevelBonus: {},
     milestones: [
       {

[Survived] StringLiteral
src/game/skills/registry.ts:200:15
     milestones: [
       {
         level: 5,
-        name: 'Quick Feet',
+        name: "",
         description: '+0.3 move speed',
         effect: { type: 'stat_add', stat: 'moveSpeed', value: 0.3 },

[Survived] StringLiteral
src/game/skills/registry.ts:201:22
       {
         level: 5,
         name: 'Quick Feet',
-        description: '+0.3 move speed',
+        description: "",
         effect: { type: 'stat_add', stat: 'moveSpeed', value: 0.3 },
       },

[Survived] StringLiteral
src/game/skills/registry.ts:206:15
       },
       {
         level: 10,
-        name: 'Slipstream',
+        name: "",
         description: '+8 pickup range',
         effect: { type: 'stat_add', stat: 'pickupRange', value: 8 },

[Survived] StringLiteral
src/game/skills/registry.ts:212:15
       },
       {
         level: 15,
-        name: 'Ghost Step',
+        name: "",
         description: '+0.5 move speed',
         effect: { type: 'stat_add', stat: 'moveSpeed', value: 0.5 },

[Survived] StringLiteral
src/game/skills/registry.ts:218:15
       },
       {
         level: 20,
-        name: 'Blur',
+        name: "",
         description: '+0.15 attack speed multiplier from constant motion',
         effect: { type: 'stat_multiply', stat: 'attackSpeed', value: 0.15 },

[Killed] BlockStatement
src/game/skills/registry.ts:235:40
 const SKILL_DEFINITIONS = Object.freeze(parsed.map((skill) => Object.freeze({ ...skill })));
 
 const registry = new Map<string, SkillDefinition>();
-for (const skill of SKILL_DEFINITIONS) {
-  registry.set(skill.id, skill);
-}
+for (const skill of SKILL_DEFINITIONS) {}
 
 export function getSkillDefinition(id: string): SkillDefinition | undefined {
killedBy: skill registry returns skill definition by id
statusReason: expected undefined to be defined
