[Survived] ArrayDeclaration
src/core/systems/npcSystem.ts:15:33
   const players = query(world.ecs, [Player, Position]);
   const player = players[0];
 
-  const npcs = query(world.ecs, [Npc, Position]);
+  const npcs = query(world.ecs, []);
 
   if (player === undefined || npcs.length === 0) {

[Killed] EqualityOperator
src/core/systems/npcSystem.ts:17:31
 
   const npcs = query(world.ecs, [Npc, Position]);
 
-  if (player === undefined || npcs.length === 0) {
+  if (player === undefined || npcs.length !== 0) {
     // Clear proximity flags when no player is present
     for (const eid of npcs) {
killedBy: npcSystem marks nearbyPlayer true when player is within interact range
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/core/systems/npcSystem.ts:17:31
 
   const npcs = query(world.ecs, [Npc, Position]);
 
-  if (player === undefined || npcs.length === 0) {
+  if (player === undefined || false) {
     // Clear proximity flags when no player is present
     for (const eid of npcs) {

[Killed] BlockStatement
src/core/systems/npcSystem.ts:19:29
 
   if (player === undefined || npcs.length === 0) {
     // Clear proximity flags when no player is present
-    for (const eid of npcs) {
-      const instance = world.npcs.get(eid);
-      if (instance) {
-        instance.nearbyPlayer = false;
-      }
-    }
+    for (const eid of npcs) {}
     return;
   }
killedBy: npcSystem marks nearbyPlayer false when no player exists
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/core/systems/npcSystem.ts:21:21
     // Clear proximity flags when no player is present
     for (const eid of npcs) {
       const instance = world.npcs.get(eid);
-      if (instance) {
-        instance.nearbyPlayer = false;
-      }
+      if (instance) {}
     }
     return;
killedBy: npcSystem marks nearbyPlayer false when no player exists
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/systems/npcSystem.ts:22:33
     for (const eid of npcs) {
       const instance = world.npcs.get(eid);
       if (instance) {
-        instance.nearbyPlayer = false;
+        instance.nearbyPlayer = true;
       }
     }
killedBy: npcSystem marks nearbyPlayer false when no player exists
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/npcSystem.ts:30:19
 
   const px = world.stores.position.x[player] ?? 0;
   const py = world.stores.position.y[player] ?? 0;
-  const rangeSq = NPC_INTERACT_RANGE_PX * NPC_INTERACT_RANGE_PX;
+  const rangeSq = NPC_INTERACT_RANGE_PX / NPC_INTERACT_RANGE_PX;
 
   for (const eid of npcs) {
killedBy: npcSystem marks nearbyPlayer true when player is within interact range
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/npcSystem.ts:32:27
   const py = world.stores.position.y[player] ?? 0;
   const rangeSq = NPC_INTERACT_RANGE_PX * NPC_INTERACT_RANGE_PX;
 
-  for (const eid of npcs) {
-    const instance = world.npcs.get(eid);
-    if (!instance) {
-      continue;
-    }
-    const nx = world.stores.position.x[eid] ?? 0;
-    const ny = world.stores.position.y[eid] ?? 0;
-    const dx = px - nx;
-    const dy = py - ny;
-    instance.nearbyPlayer = dx * dx + dy * dy <= rangeSq;
-  }
+  for (const eid of npcs) {}
 }
 
killedBy: npcSystem marks nearbyPlayer true when player is within interact range
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/npcSystem.ts:39:16
     }
     const nx = world.stores.position.x[eid] ?? 0;
     const ny = world.stores.position.y[eid] ?? 0;
-    const dx = px - nx;
+    const dx = px + nx;
     const dy = py - ny;
     instance.nearbyPlayer = dx * dx + dy * dy <= rangeSq;
killedBy: npcSystem marks nearbyPlayer true when player is within interact range
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/npcSystem.ts:40:16
     const nx = world.stores.position.x[eid] ?? 0;
     const ny = world.stores.position.y[eid] ?? 0;
     const dx = px - nx;
-    const dy = py - ny;
+    const dy = py + ny;
     instance.nearbyPlayer = dx * dx + dy * dy <= rangeSq;
   }
killedBy: npcSystem marks nearbyPlayer true when player is within interact range
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/systems/npcSystem.ts:41:29
     const ny = world.stores.position.y[eid] ?? 0;
     const dx = px - nx;
     const dy = py - ny;
-    instance.nearbyPlayer = dx * dx + dy * dy <= rangeSq;
+    instance.nearbyPlayer = false;
   }
 }
killedBy: npcSystem marks nearbyPlayer true when player is within interact range
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/npcSystem.ts:41:29
     const ny = world.stores.position.y[eid] ?? 0;
     const dx = px - nx;
     const dy = py - ny;
-    instance.nearbyPlayer = dx * dx + dy * dy <= rangeSq;
+    instance.nearbyPlayer = dx * dx - dy * dy <= rangeSq;
   }
 }
killedBy: npcSystem marks nearbyPlayer false when player is beyond interact range
statusReason: expected true to be false // Object.is equality
