[Killed] BlockStatement
src/core/systems/playerInputSystem.ts:7:78
 import { Player, Stats, Velocity } from '../components.js';
 import type { GameWorld } from '../world.js';
 
-export function playerInputSystem(world: GameWorld, input: InputState): void {
-  const playerEntities = query(world.ecs, [Player, Velocity]);
-  const { moveX, moveY } = normalizeInputDirection(input.moveX, input.moveY);
-
-  for (const eid of playerEntities) {
-    if (eid === undefined) {
-      continue;
-    }
-
-    // Use stats.moveSpeed if the Stats component is present; otherwise fall back to constant
-    const moveSpeed = hasComponent(world.ecs, eid, Stats)
-      ? (world.stores.stats.moveSpeed[eid] ?? PLAYER_SPEED)
-      : PLAYER_SPEED;
-
-    setComponent(world.ecs, eid, Velocity, { x: moveX * moveSpeed, y: moveY * moveSpeed });
-  }
-}
+export function playerInputSystem(world: GameWorld, input: InputState): void {}
 
killedBy: playerInputSystem sets player velocity from input direction
statusReason: expected +0 to be close to 3, received difference is 3, but expected 0.005

[Killed] ArrayDeclaration
src/core/systems/playerInputSystem.ts:8:43
 import type { GameWorld } from '../world.js';
 
 export function playerInputSystem(world: GameWorld, input: InputState): void {
-  const playerEntities = query(world.ecs, [Player, Velocity]);
+  const playerEntities = query(world.ecs, []);
   const { moveX, moveY } = normalizeInputDirection(input.moveX, input.moveY);
 
killedBy: playerInputSystem affects only player entities
statusReason: expected +0 to be 4 // Object.is equality

[Killed] BlockStatement
src/core/systems/playerInputSystem.ts:11:37
   const playerEntities = query(world.ecs, [Player, Velocity]);
   const { moveX, moveY } = normalizeInputDirection(input.moveX, input.moveY);
 
-  for (const eid of playerEntities) {
-    if (eid === undefined) {
-      continue;
-    }
-
-    // Use stats.moveSpeed if the Stats component is present; otherwise fall back to constant
-    const moveSpeed = hasComponent(world.ecs, eid, Stats)
-      ? (world.stores.stats.moveSpeed[eid] ?? PLAYER_SPEED)
-      : PLAYER_SPEED;
-
-    setComponent(world.ecs, eid, Velocity, { x: moveX * moveSpeed, y: moveY * moveSpeed });
-  }
+  for (const eid of playerEntities) {}
 }
 
killedBy: playerInputSystem sets player velocity from input direction
statusReason: expected +0 to be close to 3, received difference is 3, but expected 0.005

[Killed] ConditionalExpression
src/core/systems/playerInputSystem.ts:12:9
   const { moveX, moveY } = normalizeInputDirection(input.moveX, input.moveY);
 
   for (const eid of playerEntities) {
-    if (eid === undefined) {
+    if (true) {
       continue;
     }
killedBy: playerInputSystem sets player velocity from input direction
statusReason: expected +0 to be close to 3, received difference is 3, but expected 0.005

[Killed] EqualityOperator
src/core/systems/playerInputSystem.ts:12:9
   const { moveX, moveY } = normalizeInputDirection(input.moveX, input.moveY);
 
   for (const eid of playerEntities) {
-    if (eid === undefined) {
+    if (eid !== undefined) {
       continue;
     }
killedBy: playerInputSystem sets player velocity from input direction
statusReason: expected +0 to be close to 3, received difference is 3, but expected 0.005

[Killed] ArithmeticOperator
src/core/systems/playerInputSystem.ts:21:71
       ? (world.stores.stats.moveSpeed[eid] ?? PLAYER_SPEED)
       : PLAYER_SPEED;
 
-    setComponent(world.ecs, eid, Velocity, { x: moveX * moveSpeed, y: moveY * moveSpeed });
+    setComponent(world.ecs, eid, Velocity, { x: moveX * moveSpeed, y: moveY / moveSpeed });
   }
 }
killedBy: playerInputSystem normalizes diagonal input before applying speed
statusReason: expected 0.2357022613286972 to be close to 2.1213203435596424, received difference is 1.8856180822309452, but expected 0.005

[Killed] ArithmeticOperator
src/core/systems/playerInputSystem.ts:21:49
       ? (world.stores.stats.moveSpeed[eid] ?? PLAYER_SPEED)
       : PLAYER_SPEED;
 
-    setComponent(world.ecs, eid, Velocity, { x: moveX * moveSpeed, y: moveY * moveSpeed });
+    setComponent(world.ecs, eid, Velocity, { x: moveX / moveSpeed, y: moveY * moveSpeed });
   }
 }
killedBy: playerInputSystem sets player velocity from input direction
statusReason: expected 0.3333333432674408 to be close to 3, received difference is 2.666666656732559, but expected 0.005
