[Killed] EqualityOperator
src/core/systems/movementSystem.ts:11:9
   const floorMap = world.floorMap;
 
   for (const eid of entities) {
-    if (eid === undefined) {
+    if (eid !== undefined) {
       continue;
     }
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[NoCoverage] BlockStatement
src/core/systems/movementSystem.ts:11:28
   const floorMap = world.floorMap;
 
   for (const eid of entities) {
-    if (eid === undefined) {
-      continue;
-    }
+    if (eid === undefined) {}
 
     const oldX = position.x[eid] ?? 0;

[Killed] ArithmeticOperator
src/core/systems/movementSystem.ts:17:18
 
     const oldX = position.x[eid] ?? 0;
     const oldY = position.y[eid] ?? 0;
-    const newX = oldX + (velocity.x[eid] ?? 0);
+    const newX = oldX - (velocity.x[eid] ?? 0);
     const newY = oldY + (velocity.y[eid] ?? 0);
 
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 12 to be less than 10

[Killed] ArithmeticOperator
src/core/systems/movementSystem.ts:18:18
     const oldX = position.x[eid] ?? 0;
     const oldY = position.y[eid] ?? 0;
     const newX = oldX + (velocity.x[eid] ?? 0);
-    const newY = oldY + (velocity.y[eid] ?? 0);
+    const newY = oldY - (velocity.y[eid] ?? 0);
 
     const isFlying = hasComponent(world.ecs, eid, Flying);
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 292.50738525390625 to be greater than 304

[Killed] BlockStatement
src/core/systems/movementSystem.ts:21:19
     const newY = oldY + (velocity.y[eid] ?? 0);
 
     const isFlying = hasComponent(world.ecs, eid, Flying);
-    if (floorMap) {
-      if (isFlying) {
-        const inBoundsX = newX >= 0 && newX < floorMap.widthPx;
-        const inBoundsY = newY >= 0 && newY < floorMap.heightPx;
-
-        if (inBoundsX) {
-          position.x[eid] = newX;
-        }
-        if (inBoundsY) {
-          position.y[eid] = newY;
-        }
-        continue;
-      }
-
-      // Slide-based collision: try full move, then each axis independently
-      if (floorMap.isPassableAt(newX, newY)) {
-        position.x[eid] = newX;
-        position.y[eid] = newY;
-      } else if (floorMap.isPassableAt(newX, oldY)) {
-        position.x[eid] = newX;
-      } else if (floorMap.isPassableAt(oldX, newY)) {
-        position.y[eid] = newY;
-      }
-      // else: stuck — don't move
-    } else {
+    if (floorMap) {} else {
       // No map loaded — unrestricted movement (legacy behavior)
       position.x[eid] = newX;
killedBy: enemyAISystem navigator personas route through doorways instead of getting stuck on pillars
statusReason: expected 112 to be greater than 304

[Killed] BlockStatement
src/core/systems/movementSystem.ts:22:21
 
     const isFlying = hasComponent(world.ecs, eid, Flying);
     if (floorMap) {
-      if (isFlying) {
-        const inBoundsX = newX >= 0 && newX < floorMap.widthPx;
-        const inBoundsY = newY >= 0 && newY < floorMap.heightPx;
-
-        if (inBoundsX) {
-          position.x[eid] = newX;
-        }
-        if (inBoundsY) {
-          position.y[eid] = newY;
-        }
-        continue;
-      }
+      if (isFlying) {}
 
       // Slide-based collision: try full move, then each axis independently
killedBy: enemyAISystem flying traversal can cross blocked structures where ground traversal cannot
statusReason: expected 190 to be greater than 288

[Killed] EqualityOperator
src/core/systems/movementSystem.ts:23:40
     const isFlying = hasComponent(world.ecs, eid, Flying);
     if (floorMap) {
       if (isFlying) {
-        const inBoundsX = newX >= 0 && newX < floorMap.widthPx;
+        const inBoundsX = newX >= 0 && newX >= floorMap.widthPx;
         const inBoundsY = newY >= 0 && newY < floorMap.heightPx;
 
killedBy: enemyAISystem flying traversal can cross blocked structures where ground traversal cannot
statusReason: expected 112 to be greater than 288

[Killed] ConditionalExpression
src/core/systems/movementSystem.ts:23:27
     const isFlying = hasComponent(world.ecs, eid, Flying);
     if (floorMap) {
       if (isFlying) {
-        const inBoundsX = newX >= 0 && newX < floorMap.widthPx;
+        const inBoundsX = false;
         const inBoundsY = newY >= 0 && newY < floorMap.heightPx;
 
killedBy: enemyAISystem flying traversal can cross blocked structures where ground traversal cannot
statusReason: expected 112 to be greater than 288

[Survived] ConditionalExpression
src/core/systems/movementSystem.ts:24:27
     if (floorMap) {
       if (isFlying) {
         const inBoundsX = newX >= 0 && newX < floorMap.widthPx;
-        const inBoundsY = newY >= 0 && newY < floorMap.heightPx;
+        const inBoundsY = true;
 
         if (inBoundsX) {

[Survived] ConditionalExpression
src/core/systems/movementSystem.ts:24:27
     if (floorMap) {
       if (isFlying) {
         const inBoundsX = newX >= 0 && newX < floorMap.widthPx;
-        const inBoundsY = newY >= 0 && newY < floorMap.heightPx;
+        const inBoundsY = true && newY < floorMap.heightPx;
 
         if (inBoundsX) {

[Killed] ConditionalExpression
src/core/systems/movementSystem.ts:26:13
         const inBoundsX = newX >= 0 && newX < floorMap.widthPx;
         const inBoundsY = newY >= 0 && newY < floorMap.heightPx;
 
-        if (inBoundsX) {
+        if (false) {
           position.x[eid] = newX;
         }
killedBy: enemyAISystem flying traversal can cross blocked structures where ground traversal cannot
statusReason: expected 112 to be greater than 288

[Killed] BlockStatement
src/core/systems/movementSystem.ts:26:24
         const inBoundsX = newX >= 0 && newX < floorMap.widthPx;
         const inBoundsY = newY >= 0 && newY < floorMap.heightPx;
 
-        if (inBoundsX) {
-          position.x[eid] = newX;
-        }
+        if (inBoundsX) {}
         if (inBoundsY) {
           position.y[eid] = newY;
killedBy: enemyAISystem flying traversal can cross blocked structures where ground traversal cannot
statusReason: expected 112 to be greater than 288

[Survived] BlockStatement
src/core/systems/movementSystem.ts:29:24
         if (inBoundsX) {
           position.x[eid] = newX;
         }
-        if (inBoundsY) {
-          position.y[eid] = newY;
-        }
+        if (inBoundsY) {}
         continue;
       }

[Survived] ConditionalExpression
src/core/systems/movementSystem.ts:29:13
         if (inBoundsX) {
           position.x[eid] = newX;
         }
-        if (inBoundsY) {
+        if (false) {
           position.y[eid] = newY;
         }

[Killed] ConditionalExpression
src/core/systems/movementSystem.ts:36:11
       }
 
       // Slide-based collision: try full move, then each axis independently
-      if (floorMap.isPassableAt(newX, newY)) {
+      if (false) {
         position.x[eid] = newX;
         position.y[eid] = newY;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 292 to be greater than 304

[Killed] BlockStatement
src/core/systems/movementSystem.ts:36:46
       }
 
       // Slide-based collision: try full move, then each axis independently
-      if (floorMap.isPassableAt(newX, newY)) {
-        position.x[eid] = newX;
-        position.y[eid] = newY;
-      } else if (floorMap.isPassableAt(newX, oldY)) {
+      if (floorMap.isPassableAt(newX, newY)) {} else if (floorMap.isPassableAt(newX, oldY)) {
         position.x[eid] = newX;
       } else if (floorMap.isPassableAt(oldX, newY)) {
killedBy: enemyAISystem navigator personas route through doorways instead of getting stuck on pillars
statusReason: expected 112 to be greater than 304

[NoCoverage] BlockStatement
src/core/systems/movementSystem.ts:39:53
       if (floorMap.isPassableAt(newX, newY)) {
         position.x[eid] = newX;
         position.y[eid] = newY;
-      } else if (floorMap.isPassableAt(newX, oldY)) {
-        position.x[eid] = newX;
-      } else if (floorMap.isPassableAt(oldX, newY)) {
+      } else if (floorMap.isPassableAt(newX, oldY)) {} else if (floorMap.isPassableAt(oldX, newY)) {
         position.y[eid] = newY;
       }

[Survived] ConditionalExpression
src/core/systems/movementSystem.ts:39:18
       if (floorMap.isPassableAt(newX, newY)) {
         position.x[eid] = newX;
         position.y[eid] = newY;
-      } else if (floorMap.isPassableAt(newX, oldY)) {
+      } else if (false) {
         position.x[eid] = newX;
       } else if (floorMap.isPassableAt(oldX, newY)) {

[Killed] ConditionalExpression
src/core/systems/movementSystem.ts:41:18
         position.y[eid] = newY;
       } else if (floorMap.isPassableAt(newX, oldY)) {
         position.x[eid] = newX;
-      } else if (floorMap.isPassableAt(oldX, newY)) {
+      } else if (false) {
         position.y[eid] = newY;
       }
killedBy: movementSystem wall collision allows sliding along walls
statusReason: expected 96 to be 128 // Object.is equality

[Killed] BlockStatement
src/core/systems/movementSystem.ts:41:53
         position.y[eid] = newY;
       } else if (floorMap.isPassableAt(newX, oldY)) {
         position.x[eid] = newX;
-      } else if (floorMap.isPassableAt(oldX, newY)) {
-        position.y[eid] = newY;
-      }
+      } else if (floorMap.isPassableAt(oldX, newY)) {}
       // else: stuck — don't move
     } else {
killedBy: movementSystem wall collision allows sliding along walls
statusReason: expected 96 to be 128 // Object.is equality

[Killed] BlockStatement
src/core/systems/movementSystem.ts:45:12
         position.y[eid] = newY;
       }
       // else: stuck — don't move
-    } else {
-      // No map loaded — unrestricted movement (legacy behavior)
-      position.x[eid] = newX;
-      position.y[eid] = newY;
-    }
+    } else {}
   }
 }
killedBy: movementSystem moves an entity by its velocity each frame
statusReason: expected 10 to be close to 11.5, received difference is 1.5, but expected 0.005
