[Killed] EqualityOperator
src/game/systems/levelSystem.ts:14:7
  */
 export function levelSystem(world: GameWorld): void {
   const players = query(world.ecs, [Player]);
-  if (players.length === 0) return;
+  if (players.length !== 0) return;
 
   const pl = world.playerLevel;
killedBy: levelSystem advances level when XP crosses threshold
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/game/systems/levelSystem.ts:14:7
  */
 export function levelSystem(world: GameWorld): void {
   const players = query(world.ecs, [Player]);
-  if (players.length === 0) return;
+  if (false) return;
 
   const pl = world.playerLevel;

[Survived] BooleanLiteral
src/game/systems/levelSystem.ts:18:17
 
   const pl = world.playerLevel;
   let currentLevel = pl.level;
-  let leveled = false;
+  let leveled = true;
 
   // Advance levels as far as current XP allows

[Killed] ConditionalExpression
src/game/systems/levelSystem.ts:21:10
   let leveled = false;
 
   // Advance levels as far as current XP allows
-  while (xpRequiredForLevel(currentLevel + 1) <= pl.xp) {
+  while (false) {
     currentLevel++;
     pl.unspentPoints += pl.pointsPerLevel;
killedBy: levelSystem advances level when XP crosses threshold
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/game/systems/levelSystem.ts:21:10
   let leveled = false;
 
   // Advance levels as far as current XP allows
-  while (xpRequiredForLevel(currentLevel + 1) <= pl.xp) {
+  while (xpRequiredForLevel(currentLevel + 1) < pl.xp) {
     currentLevel++;
     pl.unspentPoints += pl.pointsPerLevel;
killedBy: levelSystem advances level when XP crosses threshold
statusReason: expected +0 to be 1 // Object.is equality

[Timeout] UpdateOperator
src/game/systems/levelSystem.ts:22:5
 
   // Advance levels as far as current XP allows
   while (xpRequiredForLevel(currentLevel + 1) <= pl.xp) {
-    currentLevel++;
+    currentLevel--;
     pl.unspentPoints += pl.pointsPerLevel;
     leveled = true;

[Killed] AssignmentOperator
src/game/systems/levelSystem.ts:23:5
   // Advance levels as far as current XP allows
   while (xpRequiredForLevel(currentLevel + 1) <= pl.xp) {
     currentLevel++;
-    pl.unspentPoints += pl.pointsPerLevel;
+    pl.unspentPoints -= pl.pointsPerLevel;
     leveled = true;
   }
killedBy: levelSystem grants pointsPerLevel unspent points on level-up
statusReason: expected -3 to be 3 // Object.is equality

[Killed] BooleanLiteral
src/game/systems/levelSystem.ts:24:15
   while (xpRequiredForLevel(currentLevel + 1) <= pl.xp) {
     currentLevel++;
     pl.unspentPoints += pl.pointsPerLevel;
-    leveled = true;
+    leveled = false;
   }
 
killedBy: levelSystem advances level when XP crosses threshold
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/game/systems/levelSystem.ts:27:16
     leveled = true;
   }
 
-  if (leveled) {
-    pl.level = currentLevel;
-    world.statsDirty = true;
-    world.state = 'level_up';
-
-    // Add Stats and SkillHolder tags to player if not present
-    const player = players[0];
-    if (player !== undefined) {
-      if (!hasComponent(world.ecs, player, Stats)) {
-        addComponent(world.ecs, player, Stats);
-      }
-      if (!hasComponent(world.ecs, player, SkillHolder)) {
-        addComponent(world.ecs, player, SkillHolder);
-      }
-    }
-  }
+  if (leveled) {}
 }
 
killedBy: levelSystem advances level when XP crosses threshold
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/game/systems/levelSystem.ts:27:7
     leveled = true;
   }
 
-  if (leveled) {
+  if (true) {
     pl.level = currentLevel;
     world.statsDirty = true;

[Killed] BooleanLiteral
src/game/systems/levelSystem.ts:29:24
 
   if (leveled) {
     pl.level = currentLevel;
-    world.statsDirty = true;
+    world.statsDirty = false;
     world.state = 'level_up';
 
killedBy: levelSystem sets statsDirty on level-up
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/game/systems/levelSystem.ts:34:31
 
     // Add Stats and SkillHolder tags to player if not present
     const player = players[0];
-    if (player !== undefined) {
-      if (!hasComponent(world.ecs, player, Stats)) {
-        addComponent(world.ecs, player, Stats);
-      }
-      if (!hasComponent(world.ecs, player, SkillHolder)) {
-        addComponent(world.ecs, player, SkillHolder);
-      }
-    }
+    if (player !== undefined) {}
   }
 }
killedBy: levelSystem adds Stats tag to player on first level-up
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/game/systems/levelSystem.ts:35:11
     // Add Stats and SkillHolder tags to player if not present
     const player = players[0];
     if (player !== undefined) {
-      if (!hasComponent(world.ecs, player, Stats)) {
+      if (hasComponent(world.ecs, player, Stats)) {
         addComponent(world.ecs, player, Stats);
       }
killedBy: levelSystem adds Stats tag to player on first level-up
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/game/systems/levelSystem.ts:35:52
     // Add Stats and SkillHolder tags to player if not present
     const player = players[0];
     if (player !== undefined) {
-      if (!hasComponent(world.ecs, player, Stats)) {
-        addComponent(world.ecs, player, Stats);
-      }
+      if (!hasComponent(world.ecs, player, Stats)) {}
       if (!hasComponent(world.ecs, player, SkillHolder)) {
         addComponent(world.ecs, player, SkillHolder);
killedBy: levelSystem adds Stats tag to player on first level-up
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/game/systems/levelSystem.ts:38:11
       if (!hasComponent(world.ecs, player, Stats)) {
         addComponent(world.ecs, player, Stats);
       }
-      if (!hasComponent(world.ecs, player, SkillHolder)) {
+      if (true) {
         addComponent(world.ecs, player, SkillHolder);
       }

[Survived] BlockStatement
src/game/systems/levelSystem.ts:38:58
       if (!hasComponent(world.ecs, player, Stats)) {
         addComponent(world.ecs, player, Stats);
       }
-      if (!hasComponent(world.ecs, player, SkillHolder)) {
-        addComponent(world.ecs, player, SkillHolder);
-      }
+      if (!hasComponent(world.ecs, player, SkillHolder)) {}
     }
   }
