[Killed] ConditionalExpression
src/game/systems/progressionEffects.ts:17:5
   const { sourceType, sourceId, effect, expiresFrame } = options;
 
   switch (effect.type) {
-    case 'stat_add':
-      addStatModifier(world, {
-        sourceType,
-        sourceId,
-        stat: effect.stat,
-        op: 'add',
-        value: effect.value,
-        expiresFrame,
-      });
-      break;
+    case 'stat_add':
 
     case 'stat_multiply':
killedBy: skillSystem applies stat_add milestone modifiers for iron-skin
statusReason: expected 'multiply' to be 'add' // Object.is equality

[Survived] ConditionalExpression
src/game/systems/progressionEffects.ts:39:5
       });
       break;
 
-    case 'extra_projectile':
-      addStatModifier(world, {
-        sourceType,
-        sourceId,
-        stat: 'projectileCount',
-        op: 'add',
-        value: effect.count,
-        expiresFrame,
-      });
-      break;
+    case 'extra_projectile':
 
     case 'aura':

[Killed] ConditionalExpression
src/game/systems/progressionEffects.ts:50:5
       });
       break;
 
-    case 'aura':
-      // TODO: Aura effects carry radius/dpsPercentOfDamage but are not yet implemented.
-      // This no-op modifier registers the source so the aura system (future) can query active auras.
-      addStatModifier(world, {
-        sourceType,
-        sourceId,
-        stat: 'damage',
-        op: 'add',
-        value: 0,
-        expiresFrame,
-      });
-      break;
+    case 'aura':
   }
 }
killedBy: skillSystem applies aura milestone placeholder modifier at level 20 for iron-skin
statusReason: expected undefined to be defined
