[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:33:33
 const MAX_OVERLAP_FRACTION = 0.25;
 const SEPARATION_FORCE = 2.0;
 const ENEMY_RADIUS = 8;
-const MIN_MOB_PLAYER_DISTANCE = ENEMY_RADIUS * 2 * (1 - MAX_OVERLAP_FRACTION);
+const MIN_MOB_PLAYER_DISTANCE = ENEMY_RADIUS / 2 * (1 - MAX_OVERLAP_FRACTION);
 const STALE_PATH_FRAMES = 180;
 const DEFAULT_PATH_REFRESH_FRAMES = 10;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 301.2727966308594 to be greater than 304

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:33:53
 const MAX_OVERLAP_FRACTION = 0.25;
 const SEPARATION_FORCE = 2.0;
 const ENEMY_RADIUS = 8;
-const MIN_MOB_PLAYER_DISTANCE = ENEMY_RADIUS * 2 * (1 - MAX_OVERLAP_FRACTION);
+const MIN_MOB_PLAYER_DISTANCE = ENEMY_RADIUS * 2 * (1 + MAX_OVERLAP_FRACTION);
 const STALE_PATH_FRAMES = 180;
 const DEFAULT_PATH_REFRESH_FRAMES = 10;

[Survived] StringLiteral
src/game/enemyAISystem.ts:44:35
 const STUCK_FRAMES_THRESHOLD = 15;
 const UNSTUCK_ANGLE_COUNT = 12;
 const MAX_PAIRWISE_SEPARATION_ENEMIES = 48;
-const FIREBALL_DEF = getWeaponDef('fireball');
+const FIREBALL_DEF = getWeaponDef("");
 
 interface PathState {

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:71:7
 
 function getWanderStateMap(world: GameWorld): Map<number, WanderState> {
   let map = wanderStatesByWorld.get(world);
-  if (!map) {
+  if (true) {
     map = new Map();
     wanderStatesByWorld.set(world, map);

[Killed] BlockStatement
src/game/enemyAISystem.ts:78:81
   return map;
 }
 
-function setVelocity(world: GameWorld, eid: number, x: number, y: number): void {
-  if (Math.hypot(x, y) > EPSILON) {
-    const enemyX = world.stores.position.x[eid] ?? 0;
-    const enemyY = world.stores.position.y[eid] ?? 0;
-    const nextX = enemyX + x;
-    const nextY = enemyY + y;
-    if (isPointInSafeSpace(world, nextX, nextY)) {
-      setComponent(world.ecs, eid, Velocity, { x: 0, y: 0 });
-      return;
-    }
-  }
-  setComponent(world.ecs, eid, Velocity, { x, y });
-}
+function setVelocity(world: GameWorld, eid: number, x: number, y: number): void {}
 
 function normalize(x: number, y: number): { x: number; y: number; length: number } {
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Survived] BlockStatement
src/game/enemyAISystem.ts:79:35
 }
 
 function setVelocity(world: GameWorld, eid: number, x: number, y: number): void {
-  if (Math.hypot(x, y) > EPSILON) {
-    const enemyX = world.stores.position.x[eid] ?? 0;
-    const enemyY = world.stores.position.y[eid] ?? 0;
-    const nextX = enemyX + x;
-    const nextY = enemyY + y;
-    if (isPointInSafeSpace(world, nextX, nextY)) {
-      setComponent(world.ecs, eid, Velocity, { x: 0, y: 0 });
-      return;
-    }
-  }
+  if (Math.hypot(x, y) > EPSILON) {}
   setComponent(world.ecs, eid, Velocity, { x, y });
 }

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:79:7
 }
 
 function setVelocity(world: GameWorld, eid: number, x: number, y: number): void {
-  if (Math.hypot(x, y) > EPSILON) {
+  if (false) {
     const enemyX = world.stores.position.x[eid] ?? 0;
     const enemyY = world.stores.position.y[eid] ?? 0;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:82:19
   if (Math.hypot(x, y) > EPSILON) {
     const enemyX = world.stores.position.x[eid] ?? 0;
     const enemyY = world.stores.position.y[eid] ?? 0;
-    const nextX = enemyX + x;
+    const nextX = enemyX - x;
     const nextY = enemyY + y;
     if (isPointInSafeSpace(world, nextX, nextY)) {

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:83:19
     const enemyX = world.stores.position.x[eid] ?? 0;
     const enemyY = world.stores.position.y[eid] ?? 0;
     const nextX = enemyX + x;
-    const nextY = enemyY + y;
+    const nextY = enemyY - y;
     if (isPointInSafeSpace(world, nextX, nextY)) {
       setComponent(world.ecs, eid, Velocity, { x: 0, y: 0 });

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:84:9
     const enemyY = world.stores.position.y[eid] ?? 0;
     const nextX = enemyX + x;
     const nextY = enemyY + y;
-    if (isPointInSafeSpace(world, nextX, nextY)) {
+    if (true) {
       setComponent(world.ecs, eid, Velocity, { x: 0, y: 0 });
       return;
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:84:9
     const enemyY = world.stores.position.y[eid] ?? 0;
     const nextX = enemyX + x;
     const nextY = enemyY + y;
-    if (isPointInSafeSpace(world, nextX, nextY)) {
+    if (false) {
       setComponent(world.ecs, eid, Velocity, { x: 0, y: 0 });
       return;

[Killed] ObjectLiteral
src/game/enemyAISystem.ts:89:42
       return;
     }
   }
-  setComponent(world.ecs, eid, Velocity, { x, y });
+  setComponent(world.ecs, eid, Velocity, {});
 }
 
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Killed] EqualityOperator
src/game/enemyAISystem.ts:94:7
 
 function normalize(x: number, y: number): { x: number; y: number; length: number } {
   const length = Math.hypot(x, y);
-  if (length <= EPSILON) {
+  if (length > EPSILON) {
     return { x: 0, y: 0, length: 0 };
   }
killedBy: enemy ranged shooting ranged enemy fires a projectile when within attack range
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/game/enemyAISystem.ts:94:26
 
 function normalize(x: number, y: number): { x: number; y: number; length: number } {
   const length = Math.hypot(x, y);
-  if (length <= EPSILON) {
-    return { x: 0, y: 0, length: 0 };
-  }
+  if (length <= EPSILON) {}
 
   return { x: x / length, y: y / length, length };
killedBy: enemyAISystem does not fire projectiles at zero distance and remains stationary
statusReason: expected NaN to be close to +0, received difference is NaN, but expected 0.005

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:98:30
     return { x: 0, y: 0, length: 0 };
   }
 
-  return { x: x / length, y: y / length, length };
+  return { x: x / length, y: y * length, length };
 }
 
killedBy: enemyAISystem sets chase enemy velocity toward the player
statusReason: expected -0.07496627420186996 to be close to -1.5, received difference is 1.42503372579813, but expected 0.005

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:98:15
     return { x: 0, y: 0, length: 0 };
   }
 
-  return { x: x / length, y: y / length, length };
+  return { x: x * length, y: y / length, length };
 }
 
killedBy: enemyAISystem sets chase enemy velocity toward the player
statusReason: expected -2.4964520931243896 to be close to -1.5, received difference is 0.9964520931243896, but expected 0.005

[Killed] EqualityOperator
src/game/enemyAISystem.ts:103:10
 
 function getEnemySpeed(world: GameWorld, eid: number): number {
   const speed = world.stores.enemyBehavior.speed[eid]!;
-  return speed > 0 ? speed : DEFAULT_ENEMY_SPEED;
+  return speed <= 0 ? speed : DEFAULT_ENEMY_SPEED;
 }
 
killedBy: enemyAISystem sets chase enemy velocity toward the player
statusReason: expected -0.8999999761581421 to be close to -1.5, received difference is 0.6000000238418579, but expected 0.005

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:103:10
 
 function getEnemySpeed(world: GameWorld, eid: number): number {
   const speed = world.stores.enemyBehavior.speed[eid]!;
-  return speed > 0 ? speed : DEFAULT_ENEMY_SPEED;
+  return false ? speed : DEFAULT_ENEMY_SPEED;
 }
 
killedBy: enemyAISystem sets chase enemy velocity toward the player
statusReason: expected -0.8999999761581421 to be close to -1.5, received difference is 0.6000000238418579, but expected 0.005

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:112:5
   const py = world.stores.position.y[eid] ?? 0;
   let state = wanderMap.get(eid);
   const shouldPickNewDirection =
-    !state ||
-    world.frameCount >= state.untilFrame ||
-    !world.floorMap?.isPassableAt(px + state.dirX * 20, py + state.dirY * 20) ||
-    isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) * 20);
+    false;
 
   if (shouldPickNewDirection) {
killedBy: enemyAISystem makes chase enemies wander when the player is outside aggro range
statusReason: expected 0 to be greater than 0.1

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:112:5
   const py = world.stores.position.y[eid] ?? 0;
   let state = wanderMap.get(eid);
   const shouldPickNewDirection =
-    !state ||
-    world.frameCount >= state.untilFrame ||
-    !world.floorMap?.isPassableAt(px + state.dirX * 20, py + state.dirY * 20) ||
+    false ||
     isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) * 20);
 
killedBy: enemyAISystem makes chase enemies wander when the player is outside aggro range
statusReason: expected 0 to be greater than 0.1

[NoCoverage] ConditionalExpression
src/game/enemyAISystem.ts:113:5
   let state = wanderMap.get(eid);
   const shouldPickNewDirection =
     !state ||
-    world.frameCount >= state.untilFrame ||
+    false ||
     !world.floorMap?.isPassableAt(px + state.dirX * 20, py + state.dirY * 20) ||
     isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) * 20);

[NoCoverage] EqualityOperator
src/game/enemyAISystem.ts:113:5
   let state = wanderMap.get(eid);
   const shouldPickNewDirection =
     !state ||
-    world.frameCount >= state.untilFrame ||
+    world.frameCount > state.untilFrame ||
     !world.floorMap?.isPassableAt(px + state.dirX * 20, py + state.dirY * 20) ||
     isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) * 20);

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:114:62
   const shouldPickNewDirection =
     !state ||
     world.frameCount >= state.untilFrame ||
-    !world.floorMap?.isPassableAt(px + state.dirX * 20, py + state.dirY * 20) ||
+    !world.floorMap?.isPassableAt(px + state.dirX * 20, py + state.dirY / 20) ||
     isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) * 20);
 

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:114:40
   const shouldPickNewDirection =
     !state ||
     world.frameCount >= state.untilFrame ||
-    !world.floorMap?.isPassableAt(px + state.dirX * 20, py + state.dirY * 20) ||
+    !world.floorMap?.isPassableAt(px + state.dirX / 20, py + state.dirY * 20) ||
     isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) * 20);
 

[NoCoverage] OptionalChaining
src/game/enemyAISystem.ts:115:67
     !state ||
     world.frameCount >= state.untilFrame ||
     !world.floorMap?.isPassableAt(px + state.dirX * 20, py + state.dirY * 20) ||
-    isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) * 20);
+    isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state.dirY ?? 0) * 20);
 
   if (shouldPickNewDirection) {

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:115:66
     !state ||
     world.frameCount >= state.untilFrame ||
     !world.floorMap?.isPassableAt(px + state.dirX * 20, py + state.dirY * 20) ||
-    isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) * 20);
+    isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) / 20);
 
   if (shouldPickNewDirection) {

[Killed] BlockStatement
src/game/enemyAISystem.ts:117:31
     !world.floorMap?.isPassableAt(px + state.dirX * 20, py + state.dirY * 20) ||
     isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) * 20);
 
-  if (shouldPickNewDirection) {
-    const angle = world.rng.next() * Math.PI * 2;
-    state = {
-      dirX: Math.cos(angle),
-      dirY: Math.sin(angle),
-      untilFrame: world.frameCount + world.rng.nextInt(24, 96),
-    };
-    wanderMap.set(eid, state);
-  }
+  if (shouldPickNewDirection) {}
 
   if (!state) {
killedBy: enemyAISystem makes chase enemies wander when the player is outside aggro range
statusReason: expected 0 to be greater than 0.1

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:117:7
     !world.floorMap?.isPassableAt(px + state.dirX * 20, py + state.dirY * 20) ||
     isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) * 20);
 
-  if (shouldPickNewDirection) {
+  if (true) {
     const angle = world.rng.next() * Math.PI * 2;
     state = {

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:118:19
     isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) * 20);
 
   if (shouldPickNewDirection) {
-    const angle = world.rng.next() * Math.PI * 2;
+    const angle = world.rng.next() * Math.PI / 2;
     state = {
       dirX: Math.cos(angle),

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:118:19
     isPointInSafeSpace(world, px + (state?.dirX ?? 0) * 20, py + (state?.dirY ?? 0) * 20);
 
   if (shouldPickNewDirection) {
-    const angle = world.rng.next() * Math.PI * 2;
+    const angle = world.rng.next() / Math.PI * 2;
     state = {
       dirX: Math.cos(angle),

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:122:19
     state = {
       dirX: Math.cos(angle),
       dirY: Math.sin(angle),
-      untilFrame: world.frameCount + world.rng.nextInt(24, 96),
+      untilFrame: world.frameCount - world.rng.nextInt(24, 96),
     };
     wanderMap.set(eid, state);

[Survived] MethodExpression
src/game/enemyAISystem.ts:131:61
     setVelocity(world, eid, 0, 0);
     return;
   }
-  setNavigatingVelocity(world, eid, state.dirX, state.dirY, Math.max(0.2, speed * 0.45));
+  setNavigatingVelocity(world, eid, state.dirX, state.dirY, Math.min(0.2, speed * 0.45));
 }
 

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:131:75
     setVelocity(world, eid, 0, 0);
     return;
   }
-  setNavigatingVelocity(world, eid, state.dirX, state.dirY, Math.max(0.2, speed * 0.45));
+  setNavigatingVelocity(world, eid, state.dirX, state.dirY, Math.max(0.2, speed / 0.45));
 }
 

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:138:18
   const cos = Math.cos(angle);
   const sin = Math.sin(angle);
   return {
-    x: x * cos - y * sin,
+    x: x * cos - y / sin,
     y: x * sin + y * cos,
   };
killedBy: enemyAISystem navigator personas route through doorways instead of getting stuck on pillars
statusReason: expected 159.79580688476562 to be greater than 304

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:138:8
   const cos = Math.cos(angle);
   const sin = Math.sin(angle);
   return {
-    x: x * cos - y * sin,
+    x: x / cos - y * sin,
     y: x * sin + y * cos,
   };

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:139:8
   const sin = Math.sin(angle);
   return {
     x: x * cos - y * sin,
-    y: x * sin + y * cos,
+    y: x / sin + y * cos,
   };
 }
killedBy: enemyAISystem navigator personas route through doorways instead of getting stuck on pillars
statusReason: expected 183.29092407226562 to be greater than 304

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:139:18
   const sin = Math.sin(angle);
   return {
     x: x * cos - y * sin,
-    y: x * sin + y * cos,
+    y: x * sin + y / cos,
   };
 }

[Killed] EqualityOperator
src/game/enemyAISystem.ts:151:7
   speed: number,
 ): void {
   const desired = normalize(desiredX, desiredY);
-  if (desired.length <= EPSILON) {
+  if (desired.length > EPSILON) {
     setVelocity(world, eid, 0, 0);
     return;
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Survived] BlockStatement
src/game/enemyAISystem.ts:151:34
   speed: number,
 ): void {
   const desired = normalize(desiredX, desiredY);
-  if (desired.length <= EPSILON) {
-    setVelocity(world, eid, 0, 0);
-    return;
-  }
+  if (desired.length <= EPSILON) {}
 
   const floorMap = world.floorMap;

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:158:48
 
   const floorMap = world.floorMap;
   if (!floorMap) {
-    setVelocity(world, eid, desired.x * speed, desired.y * speed);
+    setVelocity(world, eid, desired.x * speed, desired.y / speed);
     return;
   }
killedBy: enemyAISystem sets chase enemy velocity toward the player
statusReason: expected -0.3199999928474426 to be close to -2, received difference is 1.6800000071525574, but expected 0.005

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:158:29
 
   const floorMap = world.floorMap;
   if (!floorMap) {
-    setVelocity(world, eid, desired.x * speed, desired.y * speed);
+    setVelocity(world, eid, desired.x / speed, desired.y * speed);
     return;
   }
killedBy: enemyAISystem sets chase enemy velocity toward the player
statusReason: expected -0.23999999463558197 to be close to -1.5, received difference is 1.260000005364418, but expected 0.005

[Killed] BlockStatement
src/game/enemyAISystem.ts:165:50
   const enemyX = world.stores.position.x[eid] ?? 0;
   const enemyY = world.stores.position.y[eid] ?? 0;
 
-  for (const offset of NAVIGATION_ANGLE_OFFSETS) {
-    const candidate = rotate(desired.x, desired.y, offset);
-    const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;
-    const sampleY = enemyY + candidate.y * NAVIGATION_LOOKAHEAD_PX;
-    if (floorMap.isPassableAt(sampleX, sampleY) && !isPointInSafeSpace(world, sampleX, sampleY)) {
-      setVelocity(world, eid, candidate.x * speed, candidate.y * speed);
-      return;
-    }
-  }
+  for (const offset of NAVIGATION_ANGLE_OFFSETS) {}
 
   setVelocity(world, eid, 0, 0);
killedBy: enemyAISystem keeps room enemies idle until their room door opens
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:167:21
 
   for (const offset of NAVIGATION_ANGLE_OFFSETS) {
     const candidate = rotate(desired.x, desired.y, offset);
-    const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;
+    const sampleX = enemyX - candidate.x * NAVIGATION_LOOKAHEAD_PX;
     const sampleY = enemyY + candidate.y * NAVIGATION_LOOKAHEAD_PX;
     if (floorMap.isPassableAt(sampleX, sampleY) && !isPointInSafeSpace(world, sampleX, sampleY)) {

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:167:30
 
   for (const offset of NAVIGATION_ANGLE_OFFSETS) {
     const candidate = rotate(desired.x, desired.y, offset);
-    const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;
+    const sampleX = enemyX + candidate.x / NAVIGATION_LOOKAHEAD_PX;
     const sampleY = enemyY + candidate.y * NAVIGATION_LOOKAHEAD_PX;
     if (floorMap.isPassableAt(sampleX, sampleY) && !isPointInSafeSpace(world, sampleX, sampleY)) {

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:168:30
   for (const offset of NAVIGATION_ANGLE_OFFSETS) {
     const candidate = rotate(desired.x, desired.y, offset);
     const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;
-    const sampleY = enemyY + candidate.y * NAVIGATION_LOOKAHEAD_PX;
+    const sampleY = enemyY + candidate.y / NAVIGATION_LOOKAHEAD_PX;
     if (floorMap.isPassableAt(sampleX, sampleY) && !isPointInSafeSpace(world, sampleX, sampleY)) {
       setVelocity(world, eid, candidate.x * speed, candidate.y * speed);

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:168:21
   for (const offset of NAVIGATION_ANGLE_OFFSETS) {
     const candidate = rotate(desired.x, desired.y, offset);
     const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;
-    const sampleY = enemyY + candidate.y * NAVIGATION_LOOKAHEAD_PX;
+    const sampleY = enemyY - candidate.y * NAVIGATION_LOOKAHEAD_PX;
     if (floorMap.isPassableAt(sampleX, sampleY) && !isPointInSafeSpace(world, sampleX, sampleY)) {
       setVelocity(world, eid, candidate.x * speed, candidate.y * speed);

[Killed] BlockStatement
src/game/enemyAISystem.ts:169:98
     const candidate = rotate(desired.x, desired.y, offset);
     const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;
     const sampleY = enemyY + candidate.y * NAVIGATION_LOOKAHEAD_PX;
-    if (floorMap.isPassableAt(sampleX, sampleY) && !isPointInSafeSpace(world, sampleX, sampleY)) {
-      setVelocity(world, eid, candidate.x * speed, candidate.y * speed);
-      return;
-    }
+    if (floorMap.isPassableAt(sampleX, sampleY) && !isPointInSafeSpace(world, sampleX, sampleY)) {}
   }
 
killedBy: enemyAISystem keeps room enemies idle until their room door opens
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:169:52
     const candidate = rotate(desired.x, desired.y, offset);
     const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;
     const sampleY = enemyY + candidate.y * NAVIGATION_LOOKAHEAD_PX;
-    if (floorMap.isPassableAt(sampleX, sampleY) && !isPointInSafeSpace(world, sampleX, sampleY)) {
+    if (floorMap.isPassableAt(sampleX, sampleY) && isPointInSafeSpace(world, sampleX, sampleY)) {
       setVelocity(world, eid, candidate.x * speed, candidate.y * speed);
       return;
killedBy: enemyAISystem keeps room enemies idle until their room door opens
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:170:31
     const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;
     const sampleY = enemyY + candidate.y * NAVIGATION_LOOKAHEAD_PX;
     if (floorMap.isPassableAt(sampleX, sampleY) && !isPointInSafeSpace(world, sampleX, sampleY)) {
-      setVelocity(world, eid, candidate.x * speed, candidate.y * speed);
+      setVelocity(world, eid, candidate.x / speed, candidate.y * speed);
       return;
     }
killedBy: enemyAISystem navigator personas route through doorways instead of getting stuck on pillars
statusReason: expected 172 to be greater than 304

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:170:52
     const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;
     const sampleY = enemyY + candidate.y * NAVIGATION_LOOKAHEAD_PX;
     if (floorMap.isPassableAt(sampleX, sampleY) && !isPointInSafeSpace(world, sampleX, sampleY)) {
-      setVelocity(world, eid, candidate.x * speed, candidate.y * speed);
+      setVelocity(world, eid, candidate.x * speed, candidate.y / speed);
       return;
     }

[Survived] EqualityOperator
src/game/enemyAISystem.ts:197:7
   const enemyY = world.stores.position.y[eid] ?? 0;
   const desired = normalize(desiredX, desiredY);
 
-  if (desired.length <= EPSILON) return;
+  if (desired.length > EPSILON) return;
 
   // Try wider arc: UNSTUCK_ANGLE_COUNT angles

[Survived] EqualityOperator
src/game/enemyAISystem.ts:197:7
   const enemyY = world.stores.position.y[eid] ?? 0;
   const desired = normalize(desiredX, desiredY);
 
-  if (desired.length <= EPSILON) return;
+  if (desired.length < EPSILON) return;
 
   // Try wider arc: UNSTUCK_ANGLE_COUNT angles

[NoCoverage] UpdateOperator
src/game/enemyAISystem.ts:200:44
   if (desired.length <= EPSILON) return;
 
   // Try wider arc: UNSTUCK_ANGLE_COUNT angles
-  for (let i = 0; i < UNSTUCK_ANGLE_COUNT; i++) {
+  for (let i = 0; i < UNSTUCK_ANGLE_COUNT; i--) {
     const angle = (i / UNSTUCK_ANGLE_COUNT) * Math.PI * 2;
     const candidate = rotate(desired.x, desired.y, angle);

[Survived] EqualityOperator
src/game/enemyAISystem.ts:200:19
   if (desired.length <= EPSILON) return;
 
   // Try wider arc: UNSTUCK_ANGLE_COUNT angles
-  for (let i = 0; i < UNSTUCK_ANGLE_COUNT; i++) {
+  for (let i = 0; i >= UNSTUCK_ANGLE_COUNT; i++) {
     const angle = (i / UNSTUCK_ANGLE_COUNT) * Math.PI * 2;
     const candidate = rotate(desired.x, desired.y, angle);

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:201:19
 
   // Try wider arc: UNSTUCK_ANGLE_COUNT angles
   for (let i = 0; i < UNSTUCK_ANGLE_COUNT; i++) {
-    const angle = (i / UNSTUCK_ANGLE_COUNT) * Math.PI * 2;
+    const angle = i / UNSTUCK_ANGLE_COUNT * Math.PI / 2;
     const candidate = rotate(desired.x, desired.y, angle);
     const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:201:19
 
   // Try wider arc: UNSTUCK_ANGLE_COUNT angles
   for (let i = 0; i < UNSTUCK_ANGLE_COUNT; i++) {
-    const angle = (i / UNSTUCK_ANGLE_COUNT) * Math.PI * 2;
+    const angle = i / UNSTUCK_ANGLE_COUNT / Math.PI * 2;
     const candidate = rotate(desired.x, desired.y, angle);
     const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:203:30
   for (let i = 0; i < UNSTUCK_ANGLE_COUNT; i++) {
     const angle = (i / UNSTUCK_ANGLE_COUNT) * Math.PI * 2;
     const candidate = rotate(desired.x, desired.y, angle);
-    const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;
+    const sampleX = enemyX + candidate.x / NAVIGATION_LOOKAHEAD_PX;
     const sampleY = enemyY + candidate.y * NAVIGATION_LOOKAHEAD_PX;
     if (floorMap.isPassableAt(sampleX, sampleY) && !isPointInSafeSpace(world, sampleX, sampleY)) {

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:203:21
   for (let i = 0; i < UNSTUCK_ANGLE_COUNT; i++) {
     const angle = (i / UNSTUCK_ANGLE_COUNT) * Math.PI * 2;
     const candidate = rotate(desired.x, desired.y, angle);
-    const sampleX = enemyX + candidate.x * NAVIGATION_LOOKAHEAD_PX;
+    const sampleX = enemyX - candidate.x * NAVIGATION_LOOKAHEAD_PX;
     const sampleY = enemyY + candidate.y * NAVIGATION_LOOKAHEAD_PX;
     if (floorMap.isPassableAt(sampleX, sampleY) && !isPointInSafeSpace(world, sampleX, sampleY)) {

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:212:23
   }
 
   // Still stuck — try random jiggle as last resort
-  const jiggleAngle = random.next() * Math.PI * 2;
+  const jiggleAngle = random.next() * Math.PI / 2;
   const jiggle = {
     x: Math.cos(jiggleAngle),

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:212:23
   }
 
   // Still stuck — try random jiggle as last resort
-  const jiggleAngle = random.next() * Math.PI * 2;
+  const jiggleAngle = random.next() / Math.PI * 2;
   const jiggle = {
     x: Math.cos(jiggleAngle),

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:217:45
     x: Math.cos(jiggleAngle),
     y: Math.sin(jiggleAngle),
   };
-  setVelocity(world, eid, jiggle.x * speed, jiggle.y * speed);
+  setVelocity(world, eid, jiggle.x * speed, jiggle.y / speed);
 }
 

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:217:27
     x: Math.cos(jiggleAngle),
     y: Math.sin(jiggleAngle),
   };
-  setVelocity(world, eid, jiggle.x * speed, jiggle.y * speed);
+  setVelocity(world, eid, jiggle.x / speed, jiggle.y * speed);
 }
 

[Killed] EqualityOperator
src/game/enemyAISystem.ts:221:29
 }
 
 function isAggroActive(aggroRange: number, distanceToPlayer: number): boolean {
-  return aggroRange <= 0 || distanceToPlayer <= aggroRange;
+  return aggroRange <= 0 || distanceToPlayer > aggroRange;
 }
 
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 0.7096396088600159 to be close to +0, received difference is 0.7096396088600159, but expected 0.005

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:221:29
 }
 
 function isAggroActive(aggroRange: number, distanceToPlayer: number): boolean {
-  return aggroRange <= 0 || distanceToPlayer <= aggroRange;
+  return aggroRange <= 0 || false;
 }
 
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 0.7096396088600159 to be close to +0, received difference is 0.7096396088600159, but expected 0.005

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:226:7
 
 function getPathStateMap(world: GameWorld): Map<number, PathState> {
   let map = pathStatesByWorld.get(world);
-  if (!map) {
+  if (true) {
     map = new Map();
     pathStatesByWorld.set(world, map);

[Survived] BlockStatement
src/game/enemyAISystem.ts:238:28
   const { doorState } = world.stores;
   let hash = 2_166_136_261;
 
-  for (const eid of doors) {
-    const tx = doorState.tileX[eid] ?? 0;
-    const ty = doorState.tileY[eid] ?? 0;
-    const isOpen = doorState.isOpen[eid] ?? 0;
-    hash ^= tx * 73856093;
-    hash = Math.imul(hash, 16777619);
-    hash ^= ty * 19349663;
-    hash = Math.imul(hash, 16777619);
-    hash ^= isOpen;
-    hash = Math.imul(hash, 16777619);
-  }
+  for (const eid of doors) {}
 
   const existing = doorRevisionByWorld.get(world);

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:242:13
     const tx = doorState.tileX[eid] ?? 0;
     const ty = doorState.tileY[eid] ?? 0;
     const isOpen = doorState.isOpen[eid] ?? 0;
-    hash ^= tx * 73856093;
+    hash ^= tx / 73856093;
     hash = Math.imul(hash, 16777619);
     hash ^= ty * 19349663;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:244:13
     const isOpen = doorState.isOpen[eid] ?? 0;
     hash ^= tx * 73856093;
     hash = Math.imul(hash, 16777619);
-    hash ^= ty * 19349663;
+    hash ^= ty / 19349663;
     hash = Math.imul(hash, 16777619);
     hash ^= isOpen;

[Survived] EqualityOperator
src/game/enemyAISystem.ts:256:7
     return 1;
   }
 
-  if (existing.hash !== hash) {
+  if (existing.hash === hash) {
     existing.hash = hash;
     existing.revision += 1;

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:256:7
     return 1;
   }
 
-  if (existing.hash !== hash) {
+  if (true) {
     existing.hash = hash;
     existing.revision += 1;

[Survived] AssignmentOperator
src/game/enemyAISystem.ts:258:5
 
   if (existing.hash !== hash) {
     existing.hash = hash;
-    existing.revision += 1;
+    existing.revision -= 1;
   }
   return existing.revision;
