[Survived] BlockStatement
src/game/enemyAISystem.ts:263:85
   return existing.revision;
 }
 
-function trimStalePaths(world: GameWorld, pathStates: Map<number, PathState>): void {
-  for (const [eid, state] of pathStates.entries()) {
-    if (world.frameCount - state.lastTouchedFrame > STALE_PATH_FRAMES) {
-      pathStates.delete(eid);
-    }
-  }
-}
+function trimStalePaths(world: GameWorld, pathStates: Map<number, PathState>): void {}
 
 function isTileTraversable(world: GameWorld, tile: TilePoint, traversalMode: number): boolean {

[Survived] BlockStatement
src/game/enemyAISystem.ts:264:52
 }
 
 function trimStalePaths(world: GameWorld, pathStates: Map<number, PathState>): void {
-  for (const [eid, state] of pathStates.entries()) {
-    if (world.frameCount - state.lastTouchedFrame > STALE_PATH_FRAMES) {
-      pathStates.delete(eid);
-    }
-  }
+  for (const [eid, state] of pathStates.entries()) {}
 }
 

[NoCoverage] BlockStatement
src/game/enemyAISystem.ts:265:72
 
 function trimStalePaths(world: GameWorld, pathStates: Map<number, PathState>): void {
   for (const [eid, state] of pathStates.entries()) {
-    if (world.frameCount - state.lastTouchedFrame > STALE_PATH_FRAMES) {
-      pathStates.delete(eid);
-    }
+    if (world.frameCount - state.lastTouchedFrame > STALE_PATH_FRAMES) {}
   }
 }

[Survived] EqualityOperator
src/game/enemyAISystem.ts:265:9
 
 function trimStalePaths(world: GameWorld, pathStates: Map<number, PathState>): void {
   for (const [eid, state] of pathStates.entries()) {
-    if (world.frameCount - state.lastTouchedFrame > STALE_PATH_FRAMES) {
+    if (world.frameCount - state.lastTouchedFrame <= STALE_PATH_FRAMES) {
       pathStates.delete(eid);
     }

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:273:20
 
 function isTileTraversable(world: GameWorld, tile: TilePoint, traversalMode: number): boolean {
   const floorMap = world.floorMap;
-  if (!floorMap || !floorMap.tileMap.inBounds(tile.x, tile.y)) {
+  if (!floorMap || floorMap.tileMap.inBounds(tile.x, tile.y)) {
     return false;
   }
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:274:12
 function isTileTraversable(world: GameWorld, tile: TilePoint, traversalMode: number): boolean {
   const floorMap = world.floorMap;
   if (!floorMap || !floorMap.tileMap.inBounds(tile.x, tile.y)) {
-    return false;
+    return true;
   }
   if (traversalMode === TRAVERSAL_MODE.FLYING) {
killedBy: enemyAISystem keeps pathing flanker enemies idle when no traversable target tile exists
statusReason: expected 0.1533930003643036 to be +0 // Object.is equality

[Killed] EqualityOperator
src/game/enemyAISystem.ts:276:7
   if (!floorMap || !floorMap.tileMap.inBounds(tile.x, tile.y)) {
     return false;
   }
-  if (traversalMode === TRAVERSAL_MODE.FLYING) {
+  if (traversalMode !== TRAVERSAL_MODE.FLYING) {
     return true;
   }
killedBy: enemyAISystem keeps pathing flanker enemies idle when no traversable target tile exists
statusReason: expected 0.971285879611969 to be +0 // Object.is equality

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:276:7
   if (!floorMap || !floorMap.tileMap.inBounds(tile.x, tile.y)) {
     return false;
   }
-  if (traversalMode === TRAVERSAL_MODE.FLYING) {
+  if (false) {
     return true;
   }

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:277:12
     return false;
   }
   if (traversalMode === TRAVERSAL_MODE.FLYING) {
-    return true;
+    return false;
   }
   return floorMap.tileMap.isPassable(tile.x, tile.y);
killedBy: enemyAISystem flying traversal can cross blocked structures where ground traversal cannot
statusReason: expected 125.89190673828125 to be greater than 288

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:287:7
   target: TilePoint,
   traversalMode: number,
 ): TilePoint | null {
-  if (isTileTraversable(world, target, traversalMode)) {
+  if (false) {
     return target;
   }
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:287:7
   target: TilePoint,
   traversalMode: number,
 ): TilePoint | null {
-  if (isTileTraversable(world, target, traversalMode)) {
+  if (true) {
     return target;
   }
killedBy: enemyAISystem keeps pathing flanker enemies idle when no traversable target tile exists
statusReason: expected 0.971285879611969 to be +0 // Object.is equality

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:292:7
   }
 
   const floorMap = world.floorMap;
-  if (!floorMap) {
+  if (false) {
     return null;
   }

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:292:7
   }
 
   const floorMap = world.floorMap;
-  if (!floorMap) {
+  if (true) {
     return null;
   }

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:296:24
     return null;
   }
 
-  for (let radius = 1; radius <= TARGET_SEARCH_RADIUS; radius += 1) {
+  for (let radius = 1; false; radius += 1) {
     for (let y = target.y - radius; y <= target.y + radius; y += 1) {
       for (let x = target.x - radius; x <= target.x + radius; x += 1) {

[Survived] EqualityOperator
src/game/enemyAISystem.ts:296:24
     return null;
   }
 
-  for (let radius = 1; radius <= TARGET_SEARCH_RADIUS; radius += 1) {
+  for (let radius = 1; radius < TARGET_SEARCH_RADIUS; radius += 1) {
     for (let y = target.y - radius; y <= target.y + radius; y += 1) {
       for (let x = target.x - radius; x <= target.x + radius; x += 1) {

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:297:37
   }
 
   for (let radius = 1; radius <= TARGET_SEARCH_RADIUS; radius += 1) {
-    for (let y = target.y - radius; y <= target.y + radius; y += 1) {
+    for (let y = target.y - radius; false; y += 1) {
       for (let x = target.x - radius; x <= target.x + radius; x += 1) {
         if (Math.abs(x - target.x) !== radius && Math.abs(y - target.y) !== radius) {

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:297:42
   }
 
   for (let radius = 1; radius <= TARGET_SEARCH_RADIUS; radius += 1) {
-    for (let y = target.y - radius; y <= target.y + radius; y += 1) {
+    for (let y = target.y - radius; y <= target.y - radius; y += 1) {
       for (let x = target.x - radius; x <= target.x + radius; x += 1) {
         if (Math.abs(x - target.x) !== radius && Math.abs(y - target.y) !== radius) {

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:298:20
 
   for (let radius = 1; radius <= TARGET_SEARCH_RADIUS; radius += 1) {
     for (let y = target.y - radius; y <= target.y + radius; y += 1) {
-      for (let x = target.x - radius; x <= target.x + radius; x += 1) {
+      for (let x = target.x + radius; x <= target.x + radius; x += 1) {
         if (Math.abs(x - target.x) !== radius && Math.abs(y - target.y) !== radius) {
           continue;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 296.29266357421875 to be greater than 304

[Survived] BlockStatement
src/game/enemyAISystem.ts:298:71
 
   for (let radius = 1; radius <= TARGET_SEARCH_RADIUS; radius += 1) {
     for (let y = target.y - radius; y <= target.y + radius; y += 1) {
-      for (let x = target.x - radius; x <= target.x + radius; x += 1) {
-        if (Math.abs(x - target.x) !== radius && Math.abs(y - target.y) !== radius) {
-          continue;
-        }
-        const candidate = { x, y };
-        if (isTileTraversable(world, candidate, traversalMode)) {
-          return candidate;
-        }
-      }
+      for (let x = target.x - radius; x <= target.x + radius; x += 1) {}
     }
   }

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:299:59
   for (let radius = 1; radius <= TARGET_SEARCH_RADIUS; radius += 1) {
     for (let y = target.y - radius; y <= target.y + radius; y += 1) {
       for (let x = target.x - radius; x <= target.x + radius; x += 1) {
-        if (Math.abs(x - target.x) !== radius && Math.abs(y - target.y) !== radius) {
+        if (Math.abs(x - target.x) !== radius && Math.abs(y + target.y) !== radius) {
           continue;
         }

[Survived] BlockStatement
src/game/enemyAISystem.ts:299:85
   for (let radius = 1; radius <= TARGET_SEARCH_RADIUS; radius += 1) {
     for (let y = target.y - radius; y <= target.y + radius; y += 1) {
       for (let x = target.x - radius; x <= target.x + radius; x += 1) {
-        if (Math.abs(x - target.x) !== radius && Math.abs(y - target.y) !== radius) {
-          continue;
-        }
+        if (Math.abs(x - target.x) !== radius && Math.abs(y - target.y) !== radius) {}
         const candidate = { x, y };
         if (isTileTraversable(world, candidate, traversalMode)) {

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:303:13
           continue;
         }
         const candidate = { x, y };
-        if (isTileTraversable(world, candidate, traversalMode)) {
+        if (true) {
           return candidate;
         }
killedBy: enemyAISystem keeps pathing flanker enemies idle when no traversable target tile exists
statusReason: expected 0.7878385782241821 to be +0 // Object.is equality

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:303:13
           continue;
         }
         const candidate = { x, y };
-        if (isTileTraversable(world, candidate, traversalMode)) {
+        if (false) {
           return candidate;
         }

[NoCoverage] ArrayDeclaration
src/game/enemyAISystem.ts:331:12
 ): TilePoint[] {
   const floorMap = world.floorMap;
   if (!floorMap) {
-    return [asTilePoint(world, playerX, playerY)];
+    return [];
   }
 

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:334:48
     return [asTilePoint(world, playerX, playerY)];
   }
 
-  const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
+  const toPlayer = normalize(playerX - enemyX, playerY + enemyY);
   if (toPlayer.length <= EPSILON) {
     return [asTilePoint(world, playerX, playerY)];
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 272.20733642578125 to be greater than 304

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:334:30
     return [asTilePoint(world, playerX, playerY)];
   }
 
-  const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
+  const toPlayer = normalize(playerX + enemyX, playerY - enemyY);
   if (toPlayer.length <= EPSILON) {
     return [asTilePoint(world, playerX, playerY)];

[Killed] EqualityOperator
src/game/enemyAISystem.ts:335:7
   }
 
   const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
-  if (toPlayer.length <= EPSILON) {
+  if (toPlayer.length > EPSILON) {
     return [asTilePoint(world, playerX, playerY)];
   }
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 292 to be greater than 304

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:335:7
   }
 
   const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
-  if (toPlayer.length <= EPSILON) {
+  if (false) {
     return [asTilePoint(world, playerX, playerY)];
   }

[Killed] MethodExpression
src/game/enemyAISystem.ts:339:25
     return [asTilePoint(world, playerX, playerY)];
   }
 
-  const flankDistance = Math.max(
-    floorMap.config.tileSizePx * 2,
-    world.stores.enemyBehavior.flankDistance[eid] || DEFAULT_FLANK_DISTANCE,
-  );
+  const flankDistance = Math.min(floorMap.config.tileSizePx * 2, world.stores.enemyBehavior.flankDistance[eid] || DEFAULT_FLANK_DISTANCE);
   const sideDistance = Math.max(floorMap.config.tileSizePx * 1.5, flankDistance * 0.5);
   const sideSign = eid % 2 === 0 ? 1 : -1;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 294.7577819824219 to be greater than 304

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:340:5
   }
 
   const flankDistance = Math.max(
-    floorMap.config.tileSizePx * 2,
+    floorMap.config.tileSizePx / 2,
     world.stores.enemyBehavior.flankDistance[eid] || DEFAULT_FLANK_DISTANCE,
   );

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:343:33
     floorMap.config.tileSizePx * 2,
     world.stores.enemyBehavior.flankDistance[eid] || DEFAULT_FLANK_DISTANCE,
   );
-  const sideDistance = Math.max(floorMap.config.tileSizePx * 1.5, flankDistance * 0.5);
+  const sideDistance = Math.max(floorMap.config.tileSizePx / 1.5, flankDistance * 0.5);
   const sideSign = eid % 2 === 0 ? 1 : -1;
   const leftX = -toPlayer.y;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:343:67
     floorMap.config.tileSizePx * 2,
     world.stores.enemyBehavior.flankDistance[eid] || DEFAULT_FLANK_DISTANCE,
   );
-  const sideDistance = Math.max(floorMap.config.tileSizePx * 1.5, flankDistance * 0.5);
+  const sideDistance = Math.max(floorMap.config.tileSizePx * 1.5, flankDistance / 0.5);
   const sideSign = eid % 2 === 0 ? 1 : -1;
   const leftX = -toPlayer.y;

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:344:20
     world.stores.enemyBehavior.flankDistance[eid] || DEFAULT_FLANK_DISTANCE,
   );
   const sideDistance = Math.max(floorMap.config.tileSizePx * 1.5, flankDistance * 0.5);
-  const sideSign = eid % 2 === 0 ? 1 : -1;
+  const sideSign = eid * 2 === 0 ? 1 : -1;
   const leftX = -toPlayer.y;
   const leftY = toPlayer.x;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 297.48968505859375 to be greater than 304

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:344:20
     world.stores.enemyBehavior.flankDistance[eid] || DEFAULT_FLANK_DISTANCE,
   );
   const sideDistance = Math.max(floorMap.config.tileSizePx * 1.5, flankDistance * 0.5);
-  const sideSign = eid % 2 === 0 ? 1 : -1;
+  const sideSign = false ? 1 : -1;
   const leftX = -toPlayer.y;
   const leftY = toPlayer.x;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 297.48968505859375 to be greater than 304

[Killed] UnaryOperator
src/game/enemyAISystem.ts:345:17
   );
   const sideDistance = Math.max(floorMap.config.tileSizePx * 1.5, flankDistance * 0.5);
   const sideSign = eid % 2 === 0 ? 1 : -1;
-  const leftX = -toPlayer.y;
+  const leftX = +toPlayer.y;
   const leftY = toPlayer.x;
 
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 297.48968505859375 to be greater than 304

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:351:46
   return [
     asTilePoint(
       world,
-      playerX + toPlayer.x * flankDistance + leftX * sideDistance * sideSign,
+      playerX + toPlayer.x * flankDistance + leftX / sideDistance * sideSign,
       playerY + toPlayer.y * flankDistance + leftY * sideDistance * sideSign,
     ),
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 303.8171081542969 to be greater than 304

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:351:7
   return [
     asTilePoint(
       world,
-      playerX + toPlayer.x * flankDistance + leftX * sideDistance * sideSign,
+      playerX - toPlayer.x * flankDistance + leftX * sideDistance * sideSign,
       playerY + toPlayer.y * flankDistance + leftY * sideDistance * sideSign,
     ),
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 176.98313903808594 to be greater than 304

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:352:46
     asTilePoint(
       world,
       playerX + toPlayer.x * flankDistance + leftX * sideDistance * sideSign,
-      playerY + toPlayer.y * flankDistance + leftY * sideDistance * sideSign,
+      playerY + toPlayer.y * flankDistance + leftY * sideDistance / sideSign,
     ),
     asTilePoint(

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:352:7
     asTilePoint(
       world,
       playerX + toPlayer.x * flankDistance + leftX * sideDistance * sideSign,
-      playerY + toPlayer.y * flankDistance + leftY * sideDistance * sideSign,
+      playerY + toPlayer.y * flankDistance - leftY * sideDistance * sideSign,
     ),
     asTilePoint(

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:356:17
     ),
     asTilePoint(
       world,
-      playerX + toPlayer.x * flankDistance - leftX * sideDistance * sideSign,
+      playerX + toPlayer.x / flankDistance - leftX * sideDistance * sideSign,
       playerY + toPlayer.y * flankDistance - leftY * sideDistance * sideSign,
     ),

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:356:7
     ),
     asTilePoint(
       world,
-      playerX + toPlayer.x * flankDistance - leftX * sideDistance * sideSign,
+      playerX - toPlayer.x * flankDistance - leftX * sideDistance * sideSign,
       playerY + toPlayer.y * flankDistance - leftY * sideDistance * sideSign,
     ),

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:357:7
     asTilePoint(
       world,
       playerX + toPlayer.x * flankDistance - leftX * sideDistance * sideSign,
-      playerY + toPlayer.y * flankDistance - leftY * sideDistance * sideSign,
+      playerY + toPlayer.y * flankDistance + leftY * sideDistance * sideSign,
     ),
     asTilePoint(world, playerX + toPlayer.x * flankDistance, playerY + toPlayer.y * flankDistance),

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:357:46
     asTilePoint(
       world,
       playerX + toPlayer.x * flankDistance - leftX * sideDistance * sideSign,
-      playerY + toPlayer.y * flankDistance - leftY * sideDistance * sideSign,
+      playerY + toPlayer.y * flankDistance - leftY / sideDistance * sideSign,
     ),
     asTilePoint(world, playerX + toPlayer.x * flankDistance, playerY + toPlayer.y * flankDistance),

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:359:72
       playerX + toPlayer.x * flankDistance - leftX * sideDistance * sideSign,
       playerY + toPlayer.y * flankDistance - leftY * sideDistance * sideSign,
     ),
-    asTilePoint(world, playerX + toPlayer.x * flankDistance, playerY + toPlayer.y * flankDistance),
+    asTilePoint(world, playerX + toPlayer.x * flankDistance, playerY + toPlayer.y / flankDistance),
     asTilePoint(world, playerX, playerY),
   ];

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:359:62
       playerX + toPlayer.x * flankDistance - leftX * sideDistance * sideSign,
       playerY + toPlayer.y * flankDistance - leftY * sideDistance * sideSign,
     ),
-    asTilePoint(world, playerX + toPlayer.x * flankDistance, playerY + toPlayer.y * flankDistance),
+    asTilePoint(world, playerX + toPlayer.x * flankDistance, playerY - toPlayer.y * flankDistance),
     asTilePoint(world, playerX, playerY),
   ];

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:376:7
   const persona = world.stores.enemyBehavior.persona[eid] ?? PATH_PERSONA.NAVIGATOR;
   const baseTarget = asTilePoint(world, playerX, playerY);
 
-  if (persona !== PATH_PERSONA.FLANKER) {
+  if (true) {
     return findNearestTraversableTile(world, baseTarget, traversalMode);
   }
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 292 to be greater than 304

[Killed] EqualityOperator
src/game/enemyAISystem.ts:376:7
   const persona = world.stores.enemyBehavior.persona[eid] ?? PATH_PERSONA.NAVIGATOR;
   const baseTarget = asTilePoint(world, playerX, playerY);
 
-  if (persona !== PATH_PERSONA.FLANKER) {
+  if (persona === PATH_PERSONA.FLANKER) {
     return findNearestTraversableTile(world, baseTarget, traversalMode);
   }
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 292 to be greater than 304

[Killed] BlockStatement
src/game/enemyAISystem.ts:381:38
   }
 
   const flankTargets = makeFlankTargets(world, eid, enemyX, enemyY, playerX, playerY);
-  for (const target of flankTargets) {
-    const traversable = findNearestTraversableTile(world, target, traversalMode);
-    if (traversable) {
-      return traversable;
-    }
-  }
+  for (const target of flankTargets) {}
 
   return null;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 99.20001220703125 to be greater than 304

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:383:9
   const flankTargets = makeFlankTargets(world, eid, enemyX, enemyY, playerX, playerY);
   for (const target of flankTargets) {
     const traversable = findNearestTraversableTile(world, target, traversalMode);
-    if (traversable) {
+    if (false) {
       return traversable;
     }
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 99.20001220703125 to be greater than 304

[Killed] BlockStatement
src/game/enemyAISystem.ts:383:22
   const flankTargets = makeFlankTargets(world, eid, enemyX, enemyY, playerX, playerY);
   for (const target of flankTargets) {
     const traversable = findNearestTraversableTile(world, target, traversalMode);
-    if (traversable) {
-      return traversable;
-    }
+    if (traversable) {}
   }
 
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 99.20001220703125 to be greater than 304

[NoCoverage] BooleanLiteral
src/game/enemyAISystem.ts:399:33
 ): { x: number; y: number; valid: boolean } {
   const floorMap = world.floorMap;
   if (!floorMap) {
-    return { x: 0, y: 0, valid: false };
+    return { x: 0, y: 0, valid: true };
   }
 

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:404:47
 
   const enemyX = world.stores.position.x[eid] ?? 0;
   const enemyY = world.stores.position.y[eid] ?? 0;
-  const maxReach = Math.max(WAYPOINT_EPSILON, speed + 0.5);
+  const maxReach = Math.max(WAYPOINT_EPSILON, speed - 0.5);
 
   while (pathState.waypointIndex < pathState.waypoints.length) {

[Survived] MethodExpression
src/game/enemyAISystem.ts:404:20
 
   const enemyX = world.stores.position.x[eid] ?? 0;
   const enemyY = world.stores.position.y[eid] ?? 0;
-  const maxReach = Math.max(WAYPOINT_EPSILON, speed + 0.5);
+  const maxReach = Math.min(WAYPOINT_EPSILON, speed + 0.5);
 
   while (pathState.waypointIndex < pathState.waypoints.length) {

[Killed] EqualityOperator
src/game/enemyAISystem.ts:406:10
   const enemyY = world.stores.position.y[eid] ?? 0;
   const maxReach = Math.max(WAYPOINT_EPSILON, speed + 0.5);
 
-  while (pathState.waypointIndex < pathState.waypoints.length) {
+  while (pathState.waypointIndex >= pathState.waypoints.length) {
     const waypoint = pathState.waypoints[pathState.waypointIndex]!;
     const waypointCenter = floorMap.tileToPixel(waypoint.x, waypoint.y);
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] EqualityOperator
src/game/enemyAISystem.ts:406:10
   const enemyY = world.stores.position.y[eid] ?? 0;
   const maxReach = Math.max(WAYPOINT_EPSILON, speed + 0.5);
 
-  while (pathState.waypointIndex < pathState.waypoints.length) {
+  while (pathState.waypointIndex <= pathState.waypoints.length) {
     const waypoint = pathState.waypoints[pathState.waypointIndex]!;
     const waypointCenter = floorMap.tileToPixel(waypoint.x, waypoint.y);
killedBy: enemyAISystem pathing ranged enemies retreat when too close to the player
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:409:56
   while (pathState.waypointIndex < pathState.waypoints.length) {
     const waypoint = pathState.waypoints[pathState.waypointIndex]!;
     const waypointCenter = floorMap.tileToPixel(waypoint.x, waypoint.y);
-    const delta = normalize(waypointCenter.x - enemyX, waypointCenter.y - enemyY);
+    const delta = normalize(waypointCenter.x - enemyX, waypointCenter.y + enemyY);
 
     if (delta.length <= maxReach) {
killedBy: enemyAISystem navigator personas route through doorways instead of getting stuck on pillars
statusReason: expected 172.20773315429688 to be greater than 304

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:409:29
   while (pathState.waypointIndex < pathState.waypoints.length) {
     const waypoint = pathState.waypoints[pathState.waypointIndex]!;
     const waypointCenter = floorMap.tileToPixel(waypoint.x, waypoint.y);
-    const delta = normalize(waypointCenter.x - enemyX, waypointCenter.y - enemyY);
+    const delta = normalize(waypointCenter.x + enemyX, waypointCenter.y - enemyY);
 
     if (delta.length <= maxReach) {

[Killed] EqualityOperator
src/game/enemyAISystem.ts:411:9
     const waypointCenter = floorMap.tileToPixel(waypoint.x, waypoint.y);
     const delta = normalize(waypointCenter.x - enemyX, waypointCenter.y - enemyY);
 
-    if (delta.length <= maxReach) {
+    if (delta.length > maxReach) {
       pathState.waypointIndex += 1;
       continue;
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:411:9
     const waypointCenter = floorMap.tileToPixel(waypoint.x, waypoint.y);
     const delta = normalize(waypointCenter.x - enemyX, waypointCenter.y - enemyY);
 
-    if (delta.length <= maxReach) {
+    if (true) {
       pathState.waypointIndex += 1;
       continue;
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[NoCoverage] AssignmentOperator
src/game/enemyAISystem.ts:412:7
     const delta = normalize(waypointCenter.x - enemyX, waypointCenter.y - enemyY);
 
     if (delta.length <= maxReach) {
-      pathState.waypointIndex += 1;
+      pathState.waypointIndex -= 1;
       continue;
     }

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:416:45
       continue;
     }
 
-    return { x: delta.x, y: delta.y, valid: true };
+    return { x: delta.x, y: delta.y, valid: false };
   }
 
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Survived] BooleanLiteral
src/game/enemyAISystem.ts:419:31
     return { x: delta.x, y: delta.y, valid: true };
   }
 
-  return { x: 0, y: 0, valid: false };
+  return { x: 0, y: 0, valid: true };
 }
 

[NoCoverage] BooleanLiteral
src/game/enemyAISystem.ts:432:12
 ): boolean {
   const floorMap = world.floorMap;
   if (!floorMap) {
-    return false;
+    return true;
   }
 

[Survived] MethodExpression
src/game/enemyAISystem.ts:436:25
   }
 
   const pathStates = getPathStateMap(world);
-  const refreshFrames = Math.max(
-    1,
-    world.stores.enemyBehavior.pathRefreshFrames[eid] || DEFAULT_PATH_REFRESH_FRAMES,
-  );
+  const refreshFrames = Math.min(1, world.stores.enemyBehavior.pathRefreshFrames[eid] || DEFAULT_PATH_REFRESH_FRAMES);
   const enemyTile = asTilePoint(
     world,

[Survived] StringLiteral
src/game/enemyAISystem.ts:445:19
     world.stores.position.x[eid] ?? 0,
     world.stores.position.y[eid] ?? 0,
   );
-  const pathKey = `${enemyTile.x},${enemyTile.y}|${targetTile.x},${targetTile.y}|${traversalMode}|${doorRevision}`;
+  const pathKey = ``;
   const previousState = pathStates.get(eid);
 

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:450:5
 
   let pathState = previousState;
   const shouldRefresh =
-    !pathState ||
-    pathState.key !== pathKey ||
-    world.frameCount - pathState.lastComputedFrame >= refreshFrames ||
-    pathState.waypointIndex >= pathState.waypoints.length;
+    false;
 
   if (shouldRefresh) {
killedBy: enemyAISystem steers around nearby wall obstacles instead of pushing straight into them
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:450:5
 
   let pathState = previousState;
   const shouldRefresh =
-    !pathState ||
-    pathState.key !== pathKey ||
-    world.frameCount - pathState.lastComputedFrame >= refreshFrames ||
-    pathState.waypointIndex >= pathState.waypoints.length;
+    true;
 
   if (shouldRefresh) {

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:451:5
   let pathState = previousState;
   const shouldRefresh =
     !pathState ||
-    pathState.key !== pathKey ||
+    false ||
     world.frameCount - pathState.lastComputedFrame >= refreshFrames ||
     pathState.waypointIndex >= pathState.waypoints.length;

[Survived] EqualityOperator
src/game/enemyAISystem.ts:451:5
   let pathState = previousState;
   const shouldRefresh =
     !pathState ||
-    pathState.key !== pathKey ||
+    pathState.key === pathKey ||
     world.frameCount - pathState.lastComputedFrame >= refreshFrames ||
     pathState.waypointIndex >= pathState.waypoints.length;

[Survived] EqualityOperator
src/game/enemyAISystem.ts:452:5
   const shouldRefresh =
     !pathState ||
     pathState.key !== pathKey ||
-    world.frameCount - pathState.lastComputedFrame >= refreshFrames ||
+    world.frameCount - pathState.lastComputedFrame > refreshFrames ||
     pathState.waypointIndex >= pathState.waypoints.length;
 

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:452:5
   const shouldRefresh =
     !pathState ||
     pathState.key !== pathKey ||
-    world.frameCount - pathState.lastComputedFrame >= refreshFrames ||
+    world.frameCount + pathState.lastComputedFrame >= refreshFrames ||
     pathState.waypointIndex >= pathState.waypoints.length;
 
