[Survived] ConditionalExpression
src/game/enemyAISystem.ts:453:5
     !pathState ||
     pathState.key !== pathKey ||
     world.frameCount - pathState.lastComputedFrame >= refreshFrames ||
-    pathState.waypointIndex >= pathState.waypoints.length;
+    false;
 
   if (shouldRefresh) {

[Survived] EqualityOperator
src/game/enemyAISystem.ts:453:5
     !pathState ||
     pathState.key !== pathKey ||
     world.frameCount - pathState.lastComputedFrame >= refreshFrames ||
-    pathState.waypointIndex >= pathState.waypoints.length;
+    pathState.waypointIndex < pathState.waypoints.length;
 
   if (shouldRefresh) {

[Killed] BlockStatement
src/game/enemyAISystem.ts:455:22
     world.frameCount - pathState.lastComputedFrame >= refreshFrames ||
     pathState.waypointIndex >= pathState.waypoints.length;
 
-  if (shouldRefresh) {
-    const path = findTilePath(floorMap, enemyTile, targetTile, {
-      traversalMode:
-        traversalMode === TRAVERSAL_MODE.FLYING ? PATH_TRAVERSAL.FLYING : PATH_TRAVERSAL.GROUND,
-      maxPathLength: 8_192,
-    });
-    if (path.length === 0) {
-      pathStates.delete(eid);
-      return false;
-    }
-
-    pathState = {
-      key: pathKey,
-      waypoints: path,
-      waypointIndex: 1,
-      lastComputedFrame: world.frameCount,
-      lastTouchedFrame: world.frameCount,
-    };
-    pathStates.set(eid, pathState);
-  } else if (pathState) {
+  if (shouldRefresh) {} else if (pathState) {
     pathState.lastTouchedFrame = world.frameCount;
   }
killedBy: enemyAISystem steers around nearby wall obstacles instead of pushing straight into them
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:458:9
   if (shouldRefresh) {
     const path = findTilePath(floorMap, enemyTile, targetTile, {
       traversalMode:
-        traversalMode === TRAVERSAL_MODE.FLYING ? PATH_TRAVERSAL.FLYING : PATH_TRAVERSAL.GROUND,
+        true ? PATH_TRAVERSAL.FLYING : PATH_TRAVERSAL.GROUND,
       maxPathLength: 8_192,
     });
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 296.29266357421875 to be greater than 304

[Killed] EqualityOperator
src/game/enemyAISystem.ts:458:9
   if (shouldRefresh) {
     const path = findTilePath(floorMap, enemyTile, targetTile, {
       traversalMode:
-        traversalMode === TRAVERSAL_MODE.FLYING ? PATH_TRAVERSAL.FLYING : PATH_TRAVERSAL.GROUND,
+        traversalMode !== TRAVERSAL_MODE.FLYING ? PATH_TRAVERSAL.FLYING : PATH_TRAVERSAL.GROUND,
       maxPathLength: 8_192,
     });
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 296.29266357421875 to be greater than 304

[Killed] EqualityOperator
src/game/enemyAISystem.ts:461:9
         traversalMode === TRAVERSAL_MODE.FLYING ? PATH_TRAVERSAL.FLYING : PATH_TRAVERSAL.GROUND,
       maxPathLength: 8_192,
     });
-    if (path.length === 0) {
+    if (path.length !== 0) {
       pathStates.delete(eid);
       return false;
killedBy: enemyAISystem steers around nearby wall obstacles instead of pushing straight into them
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:461:9
         traversalMode === TRAVERSAL_MODE.FLYING ? PATH_TRAVERSAL.FLYING : PATH_TRAVERSAL.GROUND,
       maxPathLength: 8_192,
     });
-    if (path.length === 0) {
+    if (false) {
       pathStates.delete(eid);
       return false;

[Survived] BooleanLiteral
src/game/enemyAISystem.ts:463:14
     });
     if (path.length === 0) {
       pathStates.delete(eid);
-      return false;
+      return true;
     }
 

[Survived] BlockStatement
src/game/enemyAISystem.ts:474:25
       lastTouchedFrame: world.frameCount,
     };
     pathStates.set(eid, pathState);
-  } else if (pathState) {
-    pathState.lastTouchedFrame = world.frameCount;
-  }
+  } else if (pathState) {}
 
   if (!pathState) {

[NoCoverage] BooleanLiteral
src/game/enemyAISystem.ts:479:12
   }
 
   if (!pathState) {
-    return false;
+    return true;
   }
 

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:483:7
   }
 
   const direction = nextWaypointDirection(world, eid, pathState, speed);
-  if (!direction.valid) {
+  if (direction.valid) {
     setVelocity(world, eid, 0, 0);
     return true;
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:483:7
   }
 
   const direction = nextWaypointDirection(world, eid, pathState, speed);
-  if (!direction.valid) {
+  if (true) {
     setVelocity(world, eid, 0, 0);
     return true;
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Survived] BooleanLiteral
src/game/enemyAISystem.ts:485:12
   const direction = nextWaypointDirection(world, eid, pathState, speed);
   if (!direction.valid) {
     setVelocity(world, eid, 0, 0);
-    return true;
+    return false;
   }
 

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:488:27
     return true;
   }
 
-  setVelocity(world, eid, direction.x * speed, direction.y * speed);
+  setVelocity(world, eid, direction.x / speed, direction.y * speed);
   return true;
 }
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 138.33316040039062 to be greater than 304

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:488:48
     return true;
   }
 
-  setVelocity(world, eid, direction.x * speed, direction.y * speed);
+  setVelocity(world, eid, direction.x * speed, direction.y / speed);
   return true;
 }

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:489:10
   }
 
   setVelocity(world, eid, direction.x * speed, direction.y * speed);
-  return true;
+  return false;
 }
 
killedBy: enemyAISystem steers around nearby wall obstacles instead of pushing straight into them
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:495:12
 function isEnemyRoomDoorOpen(world: GameWorld, eid: number): boolean {
   const floorMap = world.floorMap;
   if (!floorMap) {
-    return true;
+    return false;
   }
 
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Killed] EqualityOperator
src/game/enemyAISystem.ts:502:7
   const enemyY = world.stores.position.y[eid] ?? 0;
   const tile = floorMap.pixelToTile(enemyX, enemyY);
   const roomId = floorMap.roomGraph.getRoomAt(tile.x, tile.y);
-  if (roomId < 0) {
+  if (roomId <= 0) {
     return true;
   }
killedBy: enemyAISystem keeps room enemies idle until their room door opens
statusReason: expected 0.7427813410758972 to be close to +0, received difference is 0.7427813410758972, but expected 0.005

[Killed] EqualityOperator
src/game/enemyAISystem.ts:502:7
   const enemyY = world.stores.position.y[eid] ?? 0;
   const tile = floorMap.pixelToTile(enemyX, enemyY);
   const roomId = floorMap.roomGraph.getRoomAt(tile.x, tile.y);
-  if (roomId < 0) {
+  if (roomId >= 0) {
     return true;
   }
killedBy: enemyAISystem keeps room enemies idle until their room door opens
statusReason: expected 0.7427813410758972 to be close to +0, received difference is 0.7427813410758972, but expected 0.005

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:503:12
   const tile = floorMap.pixelToTile(enemyX, enemyY);
   const roomId = floorMap.roomGraph.getRoomAt(tile.x, tile.y);
   if (roomId < 0) {
-    return true;
+    return false;
   }
 
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] EqualityOperator
src/game/enemyAISystem.ts:507:16
   }
 
   const room = floorMap.roomGraph.get(roomId);
-  if (!room || room.doors.length === 0) {
+  if (!room || room.doors.length !== 0) {
     return true;
   }
killedBy: enemyAISystem keeps room enemies idle until their room door opens
statusReason: expected 0.7427813410758972 to be close to +0, received difference is 0.7427813410758972, but expected 0.005

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:507:16
   }
 
   const room = floorMap.roomGraph.get(roomId);
-  if (!room || room.doors.length === 0) {
+  if (!room || false) {
     return true;
   }

[NoCoverage] BooleanLiteral
src/game/enemyAISystem.ts:508:12
 
   const room = floorMap.roomGraph.get(roomId);
   if (!room || room.doors.length === 0) {
-    return true;
+    return false;
   }
 

[Killed] BlockStatement
src/game/enemyAISystem.ts:511:34
     return true;
   }
 
-  for (const door of room.doors) {
-    if (floorMap.tileMap.isPassable(door.x, door.y)) {
-      return true;
-    }
-  }
+  for (const door of room.doors) {}
 
   return false;
killedBy: enemyAISystem keeps room enemies idle until their room door opens
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Killed] BlockStatement
src/game/enemyAISystem.ts:512:54
   }
 
   for (const door of room.doors) {
-    if (floorMap.tileMap.isPassable(door.x, door.y)) {
-      return true;
-    }
+    if (floorMap.tileMap.isPassable(door.x, door.y)) {}
   }
 
killedBy: enemyAISystem keeps room enemies idle until their room door opens
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:512:9
   }
 
   for (const door of room.doors) {
-    if (floorMap.tileMap.isPassable(door.x, door.y)) {
+    if (false) {
       return true;
     }
killedBy: enemyAISystem keeps room enemies idle until their room door opens
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:513:14
 
   for (const door of room.doors) {
     if (floorMap.tileMap.isPassable(door.x, door.y)) {
-      return true;
+      return false;
     }
   }
killedBy: enemyAISystem keeps room enemies idle until their room door opens
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Killed] BlockStatement
src/game/enemyAISystem.ts:528:9
   distanceToPlayer: number,
   aggroRange: number,
   speed: number,
-): void {
-  if (!isAggroActive(aggroRange, distanceToPlayer)) {
-    setVelocity(world, eid, 0, 0);
-    return;
-  }
-
-  setNavigatingVelocity(world, eid, playerDx, playerDy, speed);
-}
+): void {}
 
 function applyLegacySwarm(
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:529:7
   aggroRange: number,
   speed: number,
 ): void {
-  if (!isAggroActive(aggroRange, distanceToPlayer)) {
+  if (isAggroActive(aggroRange, distanceToPlayer)) {
     setVelocity(world, eid, 0, 0);
     return;
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:529:7
   aggroRange: number,
   speed: number,
 ): void {
-  if (!isAggroActive(aggroRange, distanceToPlayer)) {
+  if (true) {
     setVelocity(world, eid, 0, 0);
     return;
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Survived] BlockStatement
src/game/enemyAISystem.ts:562:38
   let cohesionY = 0;
   let neighborCount = 0;
 
-  for (const other of swarmEntities) {
-    if (other === eid) {
-      continue;
-    }
-
-    const otherX = position.x[other]!;
-    const otherY = position.y[other]!;
-    const offsetX = enemyX - otherX;
-    const offsetY = enemyY - otherY;
-    const distance = Math.hypot(offsetX, offsetY);
-
-    if (distance <= EPSILON || distance > SWARM_NEIGHBOR_RADIUS) {
-      continue;
-    }
-
-    const weight = (SWARM_NEIGHBOR_RADIUS - distance) / SWARM_NEIGHBOR_RADIUS;
-    separationX += (offsetX / distance) * weight;
-    separationY += (offsetY / distance) * weight;
-    cohesionX += otherX;
-    cohesionY += otherY;
-    neighborCount += 1;
-  }
+  for (const other of swarmEntities) {}
 
   let steerX = toPlayer.x * SWARM_PLAYER_WEIGHT;

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:563:9
   let neighborCount = 0;
 
   for (const other of swarmEntities) {
-    if (other === eid) {
+    if (false) {
       continue;
     }

[Survived] EqualityOperator
src/game/enemyAISystem.ts:563:9
   let neighborCount = 0;
 
   for (const other of swarmEntities) {
-    if (other === eid) {
+    if (other !== eid) {
       continue;
     }

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:569:21
 
     const otherX = position.x[other]!;
     const otherY = position.y[other]!;
-    const offsetX = enemyX - otherX;
+    const offsetX = enemyX + otherX;
     const offsetY = enemyY - otherY;
     const distance = Math.hypot(offsetX, offsetY);

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:570:21
     const otherX = position.x[other]!;
     const otherY = position.y[other]!;
     const offsetX = enemyX - otherX;
-    const offsetY = enemyY - otherY;
+    const offsetY = enemyY + otherY;
     const distance = Math.hypot(offsetX, offsetY);
 
killedBy: enemyAISystem moves a swarm enemy toward the player while separating from nearby swarmers
statusReason: expected 1.1828757524490356 to be less than 0

[Survived] LogicalOperator
src/game/enemyAISystem.ts:573:9
     const offsetY = enemyY - otherY;
     const distance = Math.hypot(offsetX, offsetY);
 
-    if (distance <= EPSILON || distance > SWARM_NEIGHBOR_RADIUS) {
+    if (distance <= EPSILON && distance > SWARM_NEIGHBOR_RADIUS) {
       continue;
     }

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:573:9
     const offsetY = enemyY - otherY;
     const distance = Math.hypot(offsetX, offsetY);
 
-    if (distance <= EPSILON || distance > SWARM_NEIGHBOR_RADIUS) {
+    if (true) {
       continue;
     }

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:577:20
       continue;
     }
 
-    const weight = (SWARM_NEIGHBOR_RADIUS - distance) / SWARM_NEIGHBOR_RADIUS;
+    const weight = (SWARM_NEIGHBOR_RADIUS - distance) * SWARM_NEIGHBOR_RADIUS;
     separationX += (offsetX / distance) * weight;
     separationY += (offsetY / distance) * weight;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:577:21
       continue;
     }
 
-    const weight = (SWARM_NEIGHBOR_RADIUS - distance) / SWARM_NEIGHBOR_RADIUS;
+    const weight = (SWARM_NEIGHBOR_RADIUS + distance) / SWARM_NEIGHBOR_RADIUS;
     separationX += (offsetX / distance) * weight;
     separationY += (offsetY / distance) * weight;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:578:21
     }
 
     const weight = (SWARM_NEIGHBOR_RADIUS - distance) / SWARM_NEIGHBOR_RADIUS;
-    separationX += (offsetX / distance) * weight;
+    separationX += (offsetX * distance) * weight;
     separationY += (offsetY / distance) * weight;
     cohesionX += otherX;

[Survived] AssignmentOperator
src/game/enemyAISystem.ts:578:5
     }
 
     const weight = (SWARM_NEIGHBOR_RADIUS - distance) / SWARM_NEIGHBOR_RADIUS;
-    separationX += (offsetX / distance) * weight;
+    separationX -= offsetX / distance * weight;
     separationY += (offsetY / distance) * weight;
     cohesionX += otherX;

[Killed] AssignmentOperator
src/game/enemyAISystem.ts:579:5
 
     const weight = (SWARM_NEIGHBOR_RADIUS - distance) / SWARM_NEIGHBOR_RADIUS;
     separationX += (offsetX / distance) * weight;
-    separationY += (offsetY / distance) * weight;
+    separationY -= offsetY / distance * weight;
     cohesionX += otherX;
     cohesionY += otherY;
killedBy: enemyAISystem moves a swarm enemy toward the player while separating from nearby swarmers
statusReason: expected 1.1828757524490356 to be less than 0

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:579:20
 
     const weight = (SWARM_NEIGHBOR_RADIUS - distance) / SWARM_NEIGHBOR_RADIUS;
     separationX += (offsetX / distance) * weight;
-    separationY += (offsetY / distance) * weight;
+    separationY += offsetY / distance / weight;
     cohesionX += otherX;
     cohesionY += otherY;

[Survived] AssignmentOperator
src/game/enemyAISystem.ts:580:5
     const weight = (SWARM_NEIGHBOR_RADIUS - distance) / SWARM_NEIGHBOR_RADIUS;
     separationX += (offsetX / distance) * weight;
     separationY += (offsetY / distance) * weight;
-    cohesionX += otherX;
+    cohesionX -= otherX;
     cohesionY += otherY;
     neighborCount += 1;

[Survived] AssignmentOperator
src/game/enemyAISystem.ts:581:5
     separationX += (offsetX / distance) * weight;
     separationY += (offsetY / distance) * weight;
     cohesionX += otherX;
-    cohesionY += otherY;
+    cohesionY -= otherY;
     neighborCount += 1;
   }

[Survived] AssignmentOperator
src/game/enemyAISystem.ts:582:5
     separationY += (offsetY / distance) * weight;
     cohesionX += otherX;
     cohesionY += otherY;
-    neighborCount += 1;
+    neighborCount -= 1;
   }
 

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:585:16
     neighborCount += 1;
   }
 
-  let steerX = toPlayer.x * SWARM_PLAYER_WEIGHT;
+  let steerX = toPlayer.x / SWARM_PLAYER_WEIGHT;
   let steerY = toPlayer.y * SWARM_PLAYER_WEIGHT;
 

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:586:16
   }
 
   let steerX = toPlayer.x * SWARM_PLAYER_WEIGHT;
-  let steerY = toPlayer.y * SWARM_PLAYER_WEIGHT;
+  let steerY = toPlayer.y / SWARM_PLAYER_WEIGHT;
 
   if (neighborCount > 0) {

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:588:7
   let steerX = toPlayer.x * SWARM_PLAYER_WEIGHT;
   let steerY = toPlayer.y * SWARM_PLAYER_WEIGHT;
 
-  if (neighborCount > 0) {
+  if (true) {
     steerX += separationX * SWARM_SEPARATION_WEIGHT;
     steerY += separationY * SWARM_SEPARATION_WEIGHT;
killedBy: enemyAISystem ignores distant swarm neighbors outside the neighbor radius
statusReason: expected NaN to be close to 2, received difference is NaN, but expected 0.005

[Killed] EqualityOperator
src/game/enemyAISystem.ts:588:7
   let steerX = toPlayer.x * SWARM_PLAYER_WEIGHT;
   let steerY = toPlayer.y * SWARM_PLAYER_WEIGHT;
 
-  if (neighborCount > 0) {
+  if (neighborCount <= 0) {
     steerX += separationX * SWARM_SEPARATION_WEIGHT;
     steerY += separationY * SWARM_SEPARATION_WEIGHT;
killedBy: enemyAISystem ignores distant swarm neighbors outside the neighbor radius
statusReason: expected NaN to be close to 2, received difference is NaN, but expected 0.005

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:589:15
   let steerY = toPlayer.y * SWARM_PLAYER_WEIGHT;
 
   if (neighborCount > 0) {
-    steerX += separationX * SWARM_SEPARATION_WEIGHT;
+    steerX += separationX / SWARM_SEPARATION_WEIGHT;
     steerY += separationY * SWARM_SEPARATION_WEIGHT;
 

[Survived] AssignmentOperator
src/game/enemyAISystem.ts:589:5
   let steerY = toPlayer.y * SWARM_PLAYER_WEIGHT;
 
   if (neighborCount > 0) {
-    steerX += separationX * SWARM_SEPARATION_WEIGHT;
+    steerX -= separationX * SWARM_SEPARATION_WEIGHT;
     steerY += separationY * SWARM_SEPARATION_WEIGHT;
 

[Killed] AssignmentOperator
src/game/enemyAISystem.ts:590:5
 
   if (neighborCount > 0) {
     steerX += separationX * SWARM_SEPARATION_WEIGHT;
-    steerY += separationY * SWARM_SEPARATION_WEIGHT;
+    steerY -= separationY * SWARM_SEPARATION_WEIGHT;
 
     const localCenterX = cohesionX / neighborCount;
killedBy: enemyAISystem moves a swarm enemy toward the player while separating from nearby swarmers
statusReason: expected 1.1828757524490356 to be less than 0

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:590:15
 
   if (neighborCount > 0) {
     steerX += separationX * SWARM_SEPARATION_WEIGHT;
-    steerY += separationY * SWARM_SEPARATION_WEIGHT;
+    steerY += separationY / SWARM_SEPARATION_WEIGHT;
 
     const localCenterX = cohesionX / neighborCount;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:592:26
     steerX += separationX * SWARM_SEPARATION_WEIGHT;
     steerY += separationY * SWARM_SEPARATION_WEIGHT;
 
-    const localCenterX = cohesionX / neighborCount;
+    const localCenterX = cohesionX * neighborCount;
     const localCenterY = cohesionY / neighborCount;
     const cohesion = normalize(localCenterX - enemyX, localCenterY - enemyY);

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:593:26
     steerY += separationY * SWARM_SEPARATION_WEIGHT;
 
     const localCenterX = cohesionX / neighborCount;
-    const localCenterY = cohesionY / neighborCount;
+    const localCenterY = cohesionY * neighborCount;
     const cohesion = normalize(localCenterX - enemyX, localCenterY - enemyY);
     steerX += cohesion.x * SWARM_COHESION_WEIGHT;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:594:32
 
     const localCenterX = cohesionX / neighborCount;
     const localCenterY = cohesionY / neighborCount;
-    const cohesion = normalize(localCenterX - enemyX, localCenterY - enemyY);
+    const cohesion = normalize(localCenterX + enemyX, localCenterY - enemyY);
     steerX += cohesion.x * SWARM_COHESION_WEIGHT;
     steerY += cohesion.y * SWARM_COHESION_WEIGHT;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:594:55
 
     const localCenterX = cohesionX / neighborCount;
     const localCenterY = cohesionY / neighborCount;
-    const cohesion = normalize(localCenterX - enemyX, localCenterY - enemyY);
+    const cohesion = normalize(localCenterX - enemyX, localCenterY + enemyY);
     steerX += cohesion.x * SWARM_COHESION_WEIGHT;
     steerY += cohesion.y * SWARM_COHESION_WEIGHT;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:595:15
     const localCenterX = cohesionX / neighborCount;
     const localCenterY = cohesionY / neighborCount;
     const cohesion = normalize(localCenterX - enemyX, localCenterY - enemyY);
-    steerX += cohesion.x * SWARM_COHESION_WEIGHT;
+    steerX += cohesion.x / SWARM_COHESION_WEIGHT;
     steerY += cohesion.y * SWARM_COHESION_WEIGHT;
   }

[Survived] AssignmentOperator
src/game/enemyAISystem.ts:595:5
     const localCenterX = cohesionX / neighborCount;
     const localCenterY = cohesionY / neighborCount;
     const cohesion = normalize(localCenterX - enemyX, localCenterY - enemyY);
-    steerX += cohesion.x * SWARM_COHESION_WEIGHT;
+    steerX -= cohesion.x * SWARM_COHESION_WEIGHT;
     steerY += cohesion.y * SWARM_COHESION_WEIGHT;
   }

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:596:15
     const localCenterY = cohesionY / neighborCount;
     const cohesion = normalize(localCenterX - enemyX, localCenterY - enemyY);
     steerX += cohesion.x * SWARM_COHESION_WEIGHT;
-    steerY += cohesion.y * SWARM_COHESION_WEIGHT;
+    steerY += cohesion.y / SWARM_COHESION_WEIGHT;
   }
 
killedBy: enemyAISystem moves a swarm enemy toward the player while separating from nearby swarmers
statusReason: expected 1.6080076694488525 to be less than 0

[Survived] AssignmentOperator
src/game/enemyAISystem.ts:596:5
     const localCenterY = cohesionY / neighborCount;
     const cohesion = normalize(localCenterX - enemyX, localCenterY - enemyY);
     steerX += cohesion.x * SWARM_COHESION_WEIGHT;
-    steerY += cohesion.y * SWARM_COHESION_WEIGHT;
+    steerY -= cohesion.y * SWARM_COHESION_WEIGHT;
   }
 

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:610:29
 ): void {
   const { enemyBehavior, position } = world.stores;
   const cooldown = enemyBehavior.fireCooldownMs[eid]!;
-  const effectiveCooldown = cooldown > 0 ? cooldown : ENEMY_PROJECTILE.FIRE_COOLDOWN_MS;
+  const effectiveCooldown = true ? cooldown : ENEMY_PROJECTILE.FIRE_COOLDOWN_MS;
   const lastFire = enemyBehavior.lastFireMs[eid]!;
 
killedBy: enemy ranged shooting ranged enemy respects fire cooldown
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/game/enemyAISystem.ts:610:29
 ): void {
   const { enemyBehavior, position } = world.stores;
   const cooldown = enemyBehavior.fireCooldownMs[eid]!;
-  const effectiveCooldown = cooldown > 0 ? cooldown : ENEMY_PROJECTILE.FIRE_COOLDOWN_MS;
+  const effectiveCooldown = cooldown >= 0 ? cooldown : ENEMY_PROJECTILE.FIRE_COOLDOWN_MS;
   const lastFire = enemyBehavior.lastFireMs[eid]!;
 
killedBy: enemy ranged shooting ranged enemy respects fire cooldown
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/game/enemyAISystem.ts:613:71
   const effectiveCooldown = cooldown > 0 ? cooldown : ENEMY_PROJECTILE.FIRE_COOLDOWN_MS;
   const lastFire = enemyBehavior.lastFireMs[eid]!;
 
-  if (lastFire > 0 && world.elapsedMs - lastFire < effectiveCooldown) {
-    return;
-  }
+  if (lastFire > 0 && world.elapsedMs - lastFire < effectiveCooldown) {}
 
   const direction = normalize(toPlayerX, toPlayerY);
killedBy: enemyAISystem respects ranged fire cooldown before firing again
statusReason: expected [ 3 ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:613:7
   const effectiveCooldown = cooldown > 0 ? cooldown : ENEMY_PROJECTILE.FIRE_COOLDOWN_MS;
   const lastFire = enemyBehavior.lastFireMs[eid]!;
 
-  if (lastFire > 0 && world.elapsedMs - lastFire < effectiveCooldown) {
+  if (false) {
     return;
   }
killedBy: enemyAISystem respects ranged fire cooldown before firing again
statusReason: expected [ 3 ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/game/enemyAISystem.ts:618:7
   }
 
   const direction = normalize(toPlayerX, toPlayerY);
-  if (direction.length <= EPSILON) {
+  if (direction.length > EPSILON) {
     return;
   }
killedBy: enemyAISystem does not fire projectiles at zero distance and remains stationary
statusReason: expected [ 3 ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:618:7
   }
 
   const direction = normalize(toPlayerX, toPlayerY);
-  if (direction.length <= EPSILON) {
+  if (false) {
     return;
   }
killedBy: enemyAISystem does not fire projectiles at zero distance and remains stationary
statusReason: expected [ 3 ] to have a length of +0 but got 1

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:624:18
 
   const enemyX = position.x[eid]!;
   const enemyY = position.y[eid]!;
-  const spawnX = enemyX + direction.x * ENEMY_PROJECTILE.MUZZLE_OFFSET;
+  const spawnX = enemyX - direction.x * ENEMY_PROJECTILE.MUZZLE_OFFSET;
   const spawnY = enemyY + direction.y * ENEMY_PROJECTILE.MUZZLE_OFFSET;
 

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:624:27
 
   const enemyX = position.x[eid]!;
   const enemyY = position.y[eid]!;
-  const spawnX = enemyX + direction.x * ENEMY_PROJECTILE.MUZZLE_OFFSET;
+  const spawnX = enemyX + direction.x / ENEMY_PROJECTILE.MUZZLE_OFFSET;
   const spawnY = enemyY + direction.y * ENEMY_PROJECTILE.MUZZLE_OFFSET;
 

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:625:27
   const enemyX = position.x[eid]!;
   const enemyY = position.y[eid]!;
   const spawnX = enemyX + direction.x * ENEMY_PROJECTILE.MUZZLE_OFFSET;
-  const spawnY = enemyY + direction.y * ENEMY_PROJECTILE.MUZZLE_OFFSET;
+  const spawnY = enemyY + direction.y / ENEMY_PROJECTILE.MUZZLE_OFFSET;
 
   if (FIREBALL_DEF) {

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:625:18
   const enemyX = position.x[eid]!;
   const enemyY = position.y[eid]!;
   const spawnX = enemyX + direction.x * ENEMY_PROJECTILE.MUZZLE_OFFSET;
-  const spawnY = enemyY + direction.y * ENEMY_PROJECTILE.MUZZLE_OFFSET;
+  const spawnY = enemyY - direction.y * ENEMY_PROJECTILE.MUZZLE_OFFSET;
 
   if (FIREBALL_DEF) {

[Killed] BlockStatement
src/game/enemyAISystem.ts:627:21
   const spawnX = enemyX + direction.x * ENEMY_PROJECTILE.MUZZLE_OFFSET;
   const spawnY = enemyY + direction.y * ENEMY_PROJECTILE.MUZZLE_OFFSET;
 
-  if (FIREBALL_DEF) {
-    const projectile = spawnAoeProjectile(
-      world,
-      spawnX,
-      spawnY,
-      direction.x * FIREBALL_DEF.projectileSpeed,
-      direction.y * FIREBALL_DEF.projectileSpeed,
-      FIREBALL_DEF.baseDamage,
-      ftToPx(FIREBALL_DEF.aoeRadius),
-      FIREBALL_DEF.baseDamage,
-      eid,
-      TeamId.ENEMY,
-      ftToPx(FIREBALL_DEF.range),
-    );
-    addComponent(world.ecs, projectile, EnemyProjectile);
-  } else {
+  if (FIREBALL_DEF) {} else {
     spawnEnemyProjectile(
       world,
killedBy: enemy ranged shooting ranged enemy fires a projectile when within attack range
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:632:7
       world,
       spawnX,
       spawnY,
-      direction.x * FIREBALL_DEF.projectileSpeed,
+      direction.x / FIREBALL_DEF.projectileSpeed,
       direction.y * FIREBALL_DEF.projectileSpeed,
       FIREBALL_DEF.baseDamage,

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:633:7
       spawnX,
       spawnY,
       direction.x * FIREBALL_DEF.projectileSpeed,
-      direction.y * FIREBALL_DEF.projectileSpeed,
+      direction.y / FIREBALL_DEF.projectileSpeed,
       FIREBALL_DEF.baseDamage,
       ftToPx(FIREBALL_DEF.aoeRadius),

[NoCoverage] BlockStatement
src/game/enemyAISystem.ts:642:10
       ftToPx(FIREBALL_DEF.range),
     );
     addComponent(world.ecs, projectile, EnemyProjectile);
-  } else {
-    spawnEnemyProjectile(
-      world,
-      spawnX,
-      spawnY,
-      direction.x * ENEMY_PROJECTILE.SPEED,
-      direction.y * ENEMY_PROJECTILE.SPEED,
-      ENEMY_PROJECTILE.DAMAGE,
-    );
-  }
+  } else {}
 
   enemyBehavior.lastFireMs[eid] = world.elapsedMs;

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:647:7
       world,
       spawnX,
       spawnY,
-      direction.x * ENEMY_PROJECTILE.SPEED,
+      direction.x / ENEMY_PROJECTILE.SPEED,
       direction.y * ENEMY_PROJECTILE.SPEED,
       ENEMY_PROJECTILE.DAMAGE,
