[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:648:7
       spawnX,
       spawnY,
       direction.x * ENEMY_PROJECTILE.SPEED,
-      direction.y * ENEMY_PROJECTILE.SPEED,
+      direction.y / ENEMY_PROJECTILE.SPEED,
       ENEMY_PROJECTILE.DAMAGE,
     );

[Killed] EqualityOperator
src/game/enemyAISystem.ts:671:7
     return;
   }
 
-  if (attackRange <= EPSILON) {
+  if (attackRange > EPSILON) {
     setNavigatingVelocity(world, eid, playerDx, playerDy, speed);
     return;
killedBy: enemyAISystem makes ranged enemies back away when they are too close
statusReason: expected -1.5 to be greater than 0

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:671:7
     return;
   }
 
-  if (attackRange <= EPSILON) {
+  if (true) {
     setNavigatingVelocity(world, eid, playerDx, playerDy, speed);
     return;
killedBy: enemyAISystem makes ranged enemies back away when they are too close
statusReason: expected -1.5 to be greater than 0

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:676:27
     return;
   }
 
-  const retreatDistance = attackRange * 0.5;
+  const retreatDistance = attackRange / 0.5;
   const toPlayer = normalize(playerDx, playerDy);
 
killedBy: enemyAISystem stops ranged enemies from approaching once they are within attack range
statusReason: expected 1.5 to be close to +0, received difference is 1.5, but expected 0.005

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:679:7
   const retreatDistance = attackRange * 0.5;
   const toPlayer = normalize(playerDx, playerDy);
 
-  if (distanceToPlayer > attackRange) {
+  if (false) {
     setNavigatingVelocity(world, eid, toPlayer.x, toPlayer.y, speed);
     return;
killedBy: enemyAISystem moves ranged enemies toward the player while outside attack range
statusReason: expected -0 to be close to -2, received difference is 2, but expected 0.005

[Killed] BlockStatement
src/game/enemyAISystem.ts:679:39
   const retreatDistance = attackRange * 0.5;
   const toPlayer = normalize(playerDx, playerDy);
 
-  if (distanceToPlayer > attackRange) {
-    setNavigatingVelocity(world, eid, toPlayer.x, toPlayer.y, speed);
-    return;
-  }
+  if (distanceToPlayer > attackRange) {}
 
   if (distanceToPlayer < retreatDistance && distanceToPlayer > EPSILON) {
killedBy: enemyAISystem moves ranged enemies toward the player while outside attack range
statusReason: expected -0 to be close to -2, received difference is 2, but expected 0.005

[Killed] EqualityOperator
src/game/enemyAISystem.ts:684:45
     return;
   }
 
-  if (distanceToPlayer < retreatDistance && distanceToPlayer > EPSILON) {
+  if (distanceToPlayer < retreatDistance && distanceToPlayer <= EPSILON) {
     setNavigatingVelocity(world, eid, -toPlayer.x, -toPlayer.y, speed);
     return;
killedBy: enemyAISystem makes ranged enemies back away when they are too close
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
src/game/enemyAISystem.ts:684:7
     return;
   }
 
-  if (distanceToPlayer < retreatDistance && distanceToPlayer > EPSILON) {
+  if (distanceToPlayer < retreatDistance || distanceToPlayer > EPSILON) {
     setNavigatingVelocity(world, eid, -toPlayer.x, -toPlayer.y, speed);
     return;
killedBy: enemyAISystem stops ranged enemies from approaching once they are within attack range
statusReason: expected 1.5 to be close to +0, received difference is 1.5, but expected 0.005

[Killed] UnaryOperator
src/game/enemyAISystem.ts:685:39
   }
 
   if (distanceToPlayer < retreatDistance && distanceToPlayer > EPSILON) {
-    setNavigatingVelocity(world, eid, -toPlayer.x, -toPlayer.y, speed);
+    setNavigatingVelocity(world, eid, +toPlayer.x, -toPlayer.y, speed);
     return;
   }
killedBy: enemyAISystem makes ranged enemies back away when they are too close
statusReason: expected -1.5 to be greater than 0

[Survived] UnaryOperator
src/game/enemyAISystem.ts:685:52
   }
 
   if (distanceToPlayer < retreatDistance && distanceToPlayer > EPSILON) {
-    setNavigatingVelocity(world, eid, -toPlayer.x, -toPlayer.y, speed);
+    setNavigatingVelocity(world, eid, -toPlayer.x, +toPlayer.y, speed);
     return;
   }

[Survived] UnaryOperator
src/game/enemyAISystem.ts:689:20
     return;
   }
 
-  const tangentX = -toPlayer.y;
+  const tangentX = +toPlayer.y;
   const tangentY = toPlayer.x;
   const tangent = normalize(tangentX, tangentY);

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:704:30
   distanceToPlayer: number,
   attackRange: number,
 ): { x: number; y: number } {
-  const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
+  const toPlayer = normalize(playerX + enemyX, playerY - enemyY);
   if (attackRange <= EPSILON || toPlayer.length <= EPSILON) {
     return { x: playerX, y: playerY };
killedBy: enemyAISystem pathing ranged enemies retreat when too close to the player
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:704:48
   distanceToPlayer: number,
   attackRange: number,
 ): { x: number; y: number } {
-  const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
+  const toPlayer = normalize(playerX - enemyX, playerY + enemyY);
   if (attackRange <= EPSILON || toPlayer.length <= EPSILON) {
     return { x: playerX, y: playerY };
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] EqualityOperator
src/game/enemyAISystem.ts:705:7
   attackRange: number,
 ): { x: number; y: number } {
   const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
-  if (attackRange <= EPSILON || toPlayer.length <= EPSILON) {
+  if (attackRange > EPSILON || toPlayer.length <= EPSILON) {
     return { x: playerX, y: playerY };
   }
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:705:7
   attackRange: number,
 ): { x: number; y: number } {
   const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
-  if (attackRange <= EPSILON || toPlayer.length <= EPSILON) {
+  if (true) {
     return { x: playerX, y: playerY };
   }
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] EqualityOperator
src/game/enemyAISystem.ts:710:7
   }
 
   const retreatDistance = attackRange * 0.5;
-  if (distanceToPlayer > attackRange) {
+  if (distanceToPlayer <= attackRange) {
     return { x: playerX, y: playerY };
   }
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:710:7
   }
 
   const retreatDistance = attackRange * 0.5;
-  if (distanceToPlayer > attackRange) {
+  if (true) {
     return { x: playerX, y: playerY };
   }
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:714:7
     return { x: playerX, y: playerY };
   }
 
-  if (distanceToPlayer < retreatDistance) {
+  if (true) {
     return {
       x: enemyX - toPlayer.x * attackRange,
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] EqualityOperator
src/game/enemyAISystem.ts:714:7
     return { x: playerX, y: playerY };
   }
 
-  if (distanceToPlayer < retreatDistance) {
+  if (distanceToPlayer >= retreatDistance) {
     return {
       x: enemyX - toPlayer.x * attackRange,
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:716:10
 
   if (distanceToPlayer < retreatDistance) {
     return {
-      x: enemyX - toPlayer.x * attackRange,
+      x: enemyX + toPlayer.x * attackRange,
       y: enemyY - toPlayer.y * attackRange,
     };

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:716:19
 
   if (distanceToPlayer < retreatDistance) {
     return {
-      x: enemyX - toPlayer.x * attackRange,
+      x: enemyX - toPlayer.x / attackRange,
       y: enemyY - toPlayer.y * attackRange,
     };

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:717:19
   if (distanceToPlayer < retreatDistance) {
     return {
       x: enemyX - toPlayer.x * attackRange,
-      y: enemyY - toPlayer.y * attackRange,
+      y: enemyY - toPlayer.y / attackRange,
     };
   }

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:717:10
   if (distanceToPlayer < retreatDistance) {
     return {
       x: enemyX - toPlayer.x * attackRange,
-      y: enemyY - toPlayer.y * attackRange,
+      y: enemyY + toPlayer.y * attackRange,
     };
   }

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:721:23
     };
   }
 
-  const tangentSign = eid % 2 === 0 ? 1 : -1;
+  const tangentSign = false ? 1 : -1;
   return {
     x: enemyX + -toPlayer.y * tangentSign * attackRange * 0.65,

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:721:23
     };
   }
 
-  const tangentSign = eid % 2 === 0 ? 1 : -1;
+  const tangentSign = eid * 2 === 0 ? 1 : -1;
   return {
     x: enemyX + -toPlayer.y * tangentSign * attackRange * 0.65,

[Survived] UnaryOperator
src/game/enemyAISystem.ts:723:17
 
   const tangentSign = eid % 2 === 0 ? 1 : -1;
   return {
-    x: enemyX + -toPlayer.y * tangentSign * attackRange * 0.65,
+    x: enemyX + +toPlayer.y * tangentSign * attackRange * 0.65,
     y: enemyY + toPlayer.x * tangentSign * attackRange * 0.65,
   };

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:723:17
 
   const tangentSign = eid % 2 === 0 ? 1 : -1;
   return {
-    x: enemyX + -toPlayer.y * tangentSign * attackRange * 0.65,
+    x: enemyX + -toPlayer.y * tangentSign / attackRange * 0.65,
     y: enemyY + toPlayer.x * tangentSign * attackRange * 0.65,
   };

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:724:17
   const tangentSign = eid % 2 === 0 ? 1 : -1;
   return {
     x: enemyX + -toPlayer.y * tangentSign * attackRange * 0.65,
-    y: enemyY + toPlayer.x * tangentSign * attackRange * 0.65,
+    y: enemyY + toPlayer.x * tangentSign * attackRange / 0.65,
   };
 }
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:724:17
   const tangentSign = eid % 2 === 0 ? 1 : -1;
   return {
     x: enemyX + -toPlayer.y * tangentSign * attackRange * 0.65,
-    y: enemyY + toPlayer.x * tangentSign * attackRange * 0.65,
+    y: enemyY + toPlayer.x * tangentSign / attackRange * 0.65,
   };
 }
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] BlockStatement
src/game/enemyAISystem.ts:757:40
   }
 
   let targetTile = personaTarget;
-  if (behaviorType === AI_TYPE.RANGED) {
-    const rangedTargetPx = buildRangedPathTarget(
-      eid,
-      enemyX,
-      enemyY,
-      playerX,
-      playerY,
-      distanceToPlayer,
-      attackRange,
-    );
-    const preferred = asTilePoint(world, rangedTargetPx.x, rangedTargetPx.y);
-    const fallback = findNearestTraversableTile(world, preferred, traversalMode);
-    if (fallback) {
-      targetTile = fallback;
-    }
-  }
+  if (behaviorType === AI_TYPE.RANGED) {}
 
   const usedPath = followPathWithCaching(
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] EqualityOperator
src/game/enemyAISystem.ts:757:7
   }
 
   let targetTile = personaTarget;
-  if (behaviorType === AI_TYPE.RANGED) {
+  if (behaviorType !== AI_TYPE.RANGED) {
     const rangedTargetPx = buildRangedPathTarget(
       eid,
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] BlockStatement
src/game/enemyAISystem.ts:769:19
     );
     const preferred = asTilePoint(world, rangedTargetPx.x, rangedTargetPx.y);
     const fallback = findNearestTraversableTile(world, preferred, traversalMode);
-    if (fallback) {
-      targetTile = fallback;
-    }
+    if (fallback) {}
   }
 
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:783:7
     doorRevision,
   );
 
-  if (!usedPath) {
+  if (true) {
     const waypoint = world.floorMap?.tileToPixel(targetTile.x, targetTile.y);
     if (!waypoint) {
killedBy: enemyAISystem steers around nearby wall obstacles instead of pushing straight into them
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:783:7
     doorRevision,
   );
 
-  if (!usedPath) {
+  if (usedPath) {
     const waypoint = world.floorMap?.tileToPixel(targetTile.x, targetTile.y);
     if (!waypoint) {
killedBy: enemyAISystem steers around nearby wall obstacles instead of pushing straight into them
statusReason: expected +0 to not be close to +0, received difference is 0, but expected 0.005

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:789:32
       setVelocity(world, eid, 0, 0);
       return;
     }
-    const fallback = normalize(waypoint.x - enemyX, waypoint.y - enemyY);
+    const fallback = normalize(waypoint.x + enemyX, waypoint.y - enemyY);
     setVelocity(world, eid, fallback.x * speed, fallback.y * speed);
     return;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:789:53
       setVelocity(world, eid, 0, 0);
       return;
     }
-    const fallback = normalize(waypoint.x - enemyX, waypoint.y - enemyY);
+    const fallback = normalize(waypoint.x - enemyX, waypoint.y + enemyY);
     setVelocity(world, eid, fallback.x * speed, fallback.y * speed);
     return;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:790:29
       return;
     }
     const fallback = normalize(waypoint.x - enemyX, waypoint.y - enemyY);
-    setVelocity(world, eid, fallback.x * speed, fallback.y * speed);
+    setVelocity(world, eid, fallback.x / speed, fallback.y * speed);
     return;
   }

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:790:49
       return;
     }
     const fallback = normalize(waypoint.x - enemyX, waypoint.y - enemyY);
-    setVelocity(world, eid, fallback.x * speed, fallback.y * speed);
+    setVelocity(world, eid, fallback.x * speed, fallback.y / speed);
     return;
   }

[Survived] LogicalOperator
src/game/enemyAISystem.ts:796:19
 
   // Keep chase/swarm mobs converging on the player instead of mirroring lateral
   // player strafes tile-for-tile when pathing updates are frequent.
-  const persona = world.stores.enemyBehavior.persona[eid] ?? PATH_PERSONA.NAVIGATOR;
+  const persona = world.stores.enemyBehavior.persona[eid] && PATH_PERSONA.NAVIGATOR;
   if (
     (behaviorType === AI_TYPE.CHASE || behaviorType === AI_TYPE.SWARM) &&

[Killed] LogicalOperator
src/game/enemyAISystem.ts:798:5
   // player strafes tile-for-tile when pathing updates are frequent.
   const persona = world.stores.enemyBehavior.persona[eid] ?? PATH_PERSONA.NAVIGATOR;
   if (
-    (behaviorType === AI_TYPE.CHASE || behaviorType === AI_TYPE.SWARM) &&
-    persona === PATH_PERSONA.NAVIGATOR &&
-    traversalMode !== TRAVERSAL_MODE.FLYING
+    (behaviorType === AI_TYPE.CHASE || behaviorType === AI_TYPE.SWARM) && persona === PATH_PERSONA.NAVIGATOR || traversalMode !== TRAVERSAL_MODE.FLYING
   ) {
     const currentVx = world.stores.velocity.x[eid] ?? 0;
killedBy: enemyAISystem flying traversal can cross blocked structures where ground traversal cannot
statusReason: expected 182.84707641601562 to be greater than 288

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:798:5
   // player strafes tile-for-tile when pathing updates are frequent.
   const persona = world.stores.enemyBehavior.persona[eid] ?? PATH_PERSONA.NAVIGATOR;
   if (
-    (behaviorType === AI_TYPE.CHASE || behaviorType === AI_TYPE.SWARM) &&
-    persona === PATH_PERSONA.NAVIGATOR &&
-    traversalMode !== TRAVERSAL_MODE.FLYING
+    true
   ) {
     const currentVx = world.stores.velocity.x[eid] ?? 0;
killedBy: enemyAISystem flying traversal can cross blocked structures where ground traversal cannot
statusReason: expected 182.84707641601562 to be greater than 288

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:799:5
   const persona = world.stores.enemyBehavior.persona[eid] ?? PATH_PERSONA.NAVIGATOR;
   if (
     (behaviorType === AI_TYPE.CHASE || behaviorType === AI_TYPE.SWARM) &&
-    persona === PATH_PERSONA.NAVIGATOR &&
+    true &&
     traversalMode !== TRAVERSAL_MODE.FLYING
   ) {

[Survived] EqualityOperator
src/game/enemyAISystem.ts:799:5
   const persona = world.stores.enemyBehavior.persona[eid] ?? PATH_PERSONA.NAVIGATOR;
   if (
     (behaviorType === AI_TYPE.CHASE || behaviorType === AI_TYPE.SWARM) &&
-    persona === PATH_PERSONA.NAVIGATOR &&
+    persona !== PATH_PERSONA.NAVIGATOR &&
     traversalMode !== TRAVERSAL_MODE.FLYING
   ) {

[Killed] EqualityOperator
src/game/enemyAISystem.ts:800:5
   if (
     (behaviorType === AI_TYPE.CHASE || behaviorType === AI_TYPE.SWARM) &&
     persona === PATH_PERSONA.NAVIGATOR &&
-    traversalMode !== TRAVERSAL_MODE.FLYING
+    traversalMode === TRAVERSAL_MODE.FLYING
   ) {
     const currentVx = world.stores.velocity.x[eid] ?? 0;
killedBy: enemyAISystem flying traversal can cross blocked structures where ground traversal cannot
statusReason: expected 182.84707641601562 to be greater than 288

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:800:5
   if (
     (behaviorType === AI_TYPE.CHASE || behaviorType === AI_TYPE.SWARM) &&
     persona === PATH_PERSONA.NAVIGATOR &&
-    traversalMode !== TRAVERSAL_MODE.FLYING
+    true
   ) {
     const currentVx = world.stores.velocity.x[eid] ?? 0;
killedBy: enemyAISystem flying traversal can cross blocked structures where ground traversal cannot
statusReason: expected 182.84707641601562 to be greater than 288

[Survived] BlockStatement
src/game/enemyAISystem.ts:801:5
     (behaviorType === AI_TYPE.CHASE || behaviorType === AI_TYPE.SWARM) &&
     persona === PATH_PERSONA.NAVIGATOR &&
     traversalMode !== TRAVERSAL_MODE.FLYING
-  ) {
-    const currentVx = world.stores.velocity.x[eid] ?? 0;
-    const currentVy = world.stores.velocity.y[eid] ?? 0;
-    const pathDirection = normalize(currentVx, currentVy);
-    const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
-    if (pathDirection.length > EPSILON && toPlayer.length > EPSILON) {
-      const blended = normalize(
-        pathDirection.x * 0.7 + toPlayer.x * 0.3,
-        pathDirection.y * 0.7 + toPlayer.y * 0.3,
-      );
-      if (blended.length > EPSILON) {
-        setNavigatingVelocity(world, eid, blended.x, blended.y, speed);
-      }
-    }
-  }
+  ) {}
 }
 

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:805:32
     const currentVx = world.stores.velocity.x[eid] ?? 0;
     const currentVy = world.stores.velocity.y[eid] ?? 0;
     const pathDirection = normalize(currentVx, currentVy);
-    const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
+    const toPlayer = normalize(playerX + enemyX, playerY - enemyY);
     if (pathDirection.length > EPSILON && toPlayer.length > EPSILON) {
       const blended = normalize(

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:805:50
     const currentVx = world.stores.velocity.x[eid] ?? 0;
     const currentVy = world.stores.velocity.y[eid] ?? 0;
     const pathDirection = normalize(currentVx, currentVy);
-    const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
+    const toPlayer = normalize(playerX - enemyX, playerY + enemyY);
     if (pathDirection.length > EPSILON && toPlayer.length > EPSILON) {
       const blended = normalize(

[Survived] EqualityOperator
src/game/enemyAISystem.ts:806:43
     const currentVy = world.stores.velocity.y[eid] ?? 0;
     const pathDirection = normalize(currentVx, currentVy);
     const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
-    if (pathDirection.length > EPSILON && toPlayer.length > EPSILON) {
+    if (pathDirection.length > EPSILON && toPlayer.length <= EPSILON) {
       const blended = normalize(
         pathDirection.x * 0.7 + toPlayer.x * 0.3,

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:806:43
     const currentVy = world.stores.velocity.y[eid] ?? 0;
     const pathDirection = normalize(currentVx, currentVy);
     const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
-    if (pathDirection.length > EPSILON && toPlayer.length > EPSILON) {
+    if (pathDirection.length > EPSILON && true) {
       const blended = normalize(
         pathDirection.x * 0.7 + toPlayer.x * 0.3,

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:808:33
     const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
     if (pathDirection.length > EPSILON && toPlayer.length > EPSILON) {
       const blended = normalize(
-        pathDirection.x * 0.7 + toPlayer.x * 0.3,
+        pathDirection.x * 0.7 + toPlayer.x / 0.3,
         pathDirection.y * 0.7 + toPlayer.y * 0.3,
       );

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:808:9
     const toPlayer = normalize(playerX - enemyX, playerY - enemyY);
     if (pathDirection.length > EPSILON && toPlayer.length > EPSILON) {
       const blended = normalize(
-        pathDirection.x * 0.7 + toPlayer.x * 0.3,
+        pathDirection.x * 0.7 - toPlayer.x * 0.3,
         pathDirection.y * 0.7 + toPlayer.y * 0.3,
       );

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:809:9
     if (pathDirection.length > EPSILON && toPlayer.length > EPSILON) {
       const blended = normalize(
         pathDirection.x * 0.7 + toPlayer.x * 0.3,
-        pathDirection.y * 0.7 + toPlayer.y * 0.3,
+        pathDirection.y / 0.7 + toPlayer.y * 0.3,
       );
       if (blended.length > EPSILON) {

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:809:33
     if (pathDirection.length > EPSILON && toPlayer.length > EPSILON) {
       const blended = normalize(
         pathDirection.x * 0.7 + toPlayer.x * 0.3,
-        pathDirection.y * 0.7 + toPlayer.y * 0.3,
+        pathDirection.y * 0.7 + toPlayer.y / 0.3,
       );
       if (blended.length > EPSILON) {

[Survived] BlockStatement
src/game/enemyAISystem.ts:811:37
         pathDirection.x * 0.7 + toPlayer.x * 0.3,
         pathDirection.y * 0.7 + toPlayer.y * 0.3,
       );
-      if (blended.length > EPSILON) {
-        setNavigatingVelocity(world, eid, blended.x, blended.y, speed);
-      }
+      if (blended.length > EPSILON) {}
     }
   }

[Survived] EqualityOperator
src/game/enemyAISystem.ts:811:11
         pathDirection.x * 0.7 + toPlayer.x * 0.3,
         pathDirection.y * 0.7 + toPlayer.y * 0.3,
       );
-      if (blended.length > EPSILON) {
+      if (blended.length <= EPSILON) {
         setNavigatingVelocity(world, eid, blended.x, blended.y, speed);
       }

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:826:43
   playerX: number,
   playerY: number,
 ): void {
-  const minDistance = ENEMY_RADIUS * 2 * (1 - MAX_OVERLAP_FRACTION);
+  const minDistance = ENEMY_RADIUS * 2 * (1 + MAX_OVERLAP_FRACTION);
   const separationEnemies =
     activeEnemies.length <= MAX_PAIRWISE_SEPARATION_ENEMIES

[Survived] EqualityOperator
src/game/enemyAISystem.ts:828:5
 ): void {
   const minDistance = ENEMY_RADIUS * 2 * (1 - MAX_OVERLAP_FRACTION);
   const separationEnemies =
-    activeEnemies.length <= MAX_PAIRWISE_SEPARATION_ENEMIES
+    activeEnemies.length < MAX_PAIRWISE_SEPARATION_ENEMIES
       ? activeEnemies
       : [...activeEnemies]

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:828:5
 ): void {
   const minDistance = ENEMY_RADIUS * 2 * (1 - MAX_OVERLAP_FRACTION);
   const separationEnemies =
-    activeEnemies.length <= MAX_PAIRWISE_SEPARATION_ENEMIES
+    true
       ? activeEnemies
       : [...activeEnemies]

[NoCoverage] MethodExpression
src/game/enemyAISystem.ts:830:9
   const separationEnemies =
     activeEnemies.length <= MAX_PAIRWISE_SEPARATION_ENEMIES
       ? activeEnemies
-      : [...activeEnemies]
-          .sort((a, b) => {
-            const adx = (position.x[a] ?? 0) - playerX;
-            const ady = (position.y[a] ?? 0) - playerY;
-            const bdx = (position.x[b] ?? 0) - playerX;
-            const bdy = (position.y[b] ?? 0) - playerY;
-            return adx * adx + ady * ady - (bdx * bdx + bdy * bdy);
-          })
-          .slice(0, MAX_PAIRWISE_SEPARATION_ENEMIES);
+      : [...activeEnemies].sort((a, b) => {
+  const adx = (position.x[a] ?? 0) - playerX;
+  const ady = (position.y[a] ?? 0) - playerY;
+  const bdx = (position.x[b] ?? 0) - playerX;
+  const bdy = (position.y[b] ?? 0) - playerY;
+  return adx * adx + ady * ady - (bdx * bdx + bdy * bdy);
+});
 
   for (let i = 0; i < separationEnemies.length; i += 1) {

[NoCoverage] MethodExpression
src/game/enemyAISystem.ts:830:9
   const separationEnemies =
     activeEnemies.length <= MAX_PAIRWISE_SEPARATION_ENEMIES
       ? activeEnemies
-      : [...activeEnemies]
-          .sort((a, b) => {
-            const adx = (position.x[a] ?? 0) - playerX;
-            const ady = (position.y[a] ?? 0) - playerY;
-            const bdx = (position.x[b] ?? 0) - playerX;
-            const bdy = (position.y[b] ?? 0) - playerY;
-            return adx * adx + ady * ady - (bdx * bdx + bdy * bdy);
-          })
+      : [...activeEnemies]
           .slice(0, MAX_PAIRWISE_SEPARATION_ENEMIES);
 

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:832:25
       ? activeEnemies
       : [...activeEnemies]
           .sort((a, b) => {
-            const adx = (position.x[a] ?? 0) - playerX;
+            const adx = (position.x[a] ?? 0) + playerX;
             const ady = (position.y[a] ?? 0) - playerY;
             const bdx = (position.x[b] ?? 0) - playerX;

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:833:25
       : [...activeEnemies]
           .sort((a, b) => {
             const adx = (position.x[a] ?? 0) - playerX;
-            const ady = (position.y[a] ?? 0) - playerY;
+            const ady = (position.y[a] ?? 0) + playerY;
             const bdx = (position.x[b] ?? 0) - playerX;
             const bdy = (position.y[b] ?? 0) - playerY;

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:834:25
           .sort((a, b) => {
             const adx = (position.x[a] ?? 0) - playerX;
             const ady = (position.y[a] ?? 0) - playerY;
-            const bdx = (position.x[b] ?? 0) - playerX;
+            const bdx = (position.x[b] ?? 0) + playerX;
             const bdy = (position.y[b] ?? 0) - playerY;
             return adx * adx + ady * ady - (bdx * bdx + bdy * bdy);

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:835:25
             const adx = (position.x[a] ?? 0) - playerX;
             const ady = (position.y[a] ?? 0) - playerY;
             const bdx = (position.x[b] ?? 0) - playerX;
-            const bdy = (position.y[b] ?? 0) - playerY;
+            const bdy = (position.y[b] ?? 0) + playerY;
             return adx * adx + ady * ady - (bdx * bdx + bdy * bdy);
           })

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:836:32
             const ady = (position.y[a] ?? 0) - playerY;
             const bdx = (position.x[b] ?? 0) - playerX;
             const bdy = (position.y[b] ?? 0) - playerY;
-            return adx * adx + ady * ady - (bdx * bdx + bdy * bdy);
+            return adx * adx + ady / ady - (bdx * bdx + bdy * bdy);
           })
           .slice(0, MAX_PAIRWISE_SEPARATION_ENEMIES);

[NoCoverage] ArithmeticOperator
src/game/enemyAISystem.ts:836:45
             const ady = (position.y[a] ?? 0) - playerY;
             const bdx = (position.x[b] ?? 0) - playerX;
             const bdy = (position.y[b] ?? 0) - playerY;
-            return adx * adx + ady * ady - (bdx * bdx + bdy * bdy);
+            return adx * adx + ady * ady - (bdx * bdx - bdy * bdy);
           })
           .slice(0, MAX_PAIRWISE_SEPARATION_ENEMIES);

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:840:19
           })
           .slice(0, MAX_PAIRWISE_SEPARATION_ENEMIES);
 
-  for (let i = 0; i < separationEnemies.length; i += 1) {
+  for (let i = 0; false; i += 1) {
     const a = separationEnemies[i]!;
     const ax = position.x[a]!;
killedBy: enemyAISystem pushes overlapping enemies apart via separation
statusReason: expected false to be true // Object.is equality

[Survived] EqualityOperator
src/game/enemyAISystem.ts:840:19
           })
           .slice(0, MAX_PAIRWISE_SEPARATION_ENEMIES);
 
-  for (let i = 0; i < separationEnemies.length; i += 1) {
+  for (let i = 0; i <= separationEnemies.length; i += 1) {
     const a = separationEnemies[i]!;
     const ax = position.x[a]!;

[Killed] EqualityOperator
src/game/enemyAISystem.ts:845:25
     const ax = position.x[a]!;
     const ay = position.y[a]!;
 
-    for (let j = i + 1; j < separationEnemies.length; j += 1) {
+    for (let j = i + 1; j <= separationEnemies.length; j += 1) {
       const b = separationEnemies[j]!;
       const bx = position.x[b]!;
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected NaN to be less than 10
