[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:845:18
     const ax = position.x[a]!;
     const ay = position.y[a]!;
 
-    for (let j = i + 1; j < separationEnemies.length; j += 1) {
+    for (let j = i - 1; j < separationEnemies.length; j += 1) {
       const b = separationEnemies[j]!;
       const bx = position.x[b]!;
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected NaN to be less than 10

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:854:11
       const dy = ay - by;
       const dist = Math.hypot(dx, dy);
 
-      if (dist >= minDistance) {
+      if (true) {
         continue;
       }
killedBy: enemyAISystem pushes overlapping enemies apart via separation
statusReason: expected false to be true // Object.is equality

[NoCoverage] UnaryOperator
src/game/enemyAISystem.ts:863:32
       let penetration: number;
 
       if (dist <= EPSILON) {
-        nx = a % 2 === 0 ? 1 : -1;
+        nx = a % 2 === 0 ? 1 : +1;
         ny = b % 2 === 0 ? 1 : -1;
         const len = Math.hypot(nx, ny);

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:864:14
 
       if (dist <= EPSILON) {
         nx = a % 2 === 0 ? 1 : -1;
-        ny = b % 2 === 0 ? 1 : -1;
+        ny = false ? 1 : -1;
         const len = Math.hypot(nx, ny);
         nx /= len;

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:883:7
     }
   }
 
-  if (world.floorMap) {
+  if (true) {
     // Clamp enemy motion so mobs cannot exceed the shared player overlap cap.
     // This keeps one collision restriction path for all personas/traversal modes.
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:883:7
     }
   }
 
-  if (world.floorMap) {
+  if (false) {
     // Clamp enemy motion so mobs cannot exceed the shared player overlap cap.
     // This keeps one collision restriction path for all personas/traversal modes.
killedBy: enemyAISystem flanker personas respect the player overlap cap while pathing past the player
statusReason: expected 0.8004150390625 to be greater than or equal to 11.95

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:893:11
       const currentVy = velocity.y[eid] ?? 0;
       const speed = Math.hypot(currentVx, currentVy);
 
-      if (speed <= EPSILON) {
+      if (true) {
         continue;
       }
killedBy: enemyAISystem flanker personas respect the player overlap cap while pathing past the player
statusReason: expected 0.8004150390625 to be greater than or equal to 11.95

[Killed] EqualityOperator
src/game/enemyAISystem.ts:893:11
       const currentVy = velocity.y[eid] ?? 0;
       const speed = Math.hypot(currentVx, currentVy);
 
-      if (speed <= EPSILON) {
+      if (speed > EPSILON) {
         continue;
       }
killedBy: enemyAISystem flanker personas respect the player overlap cap while pathing past the player
statusReason: expected 0.8004150390625 to be greater than or equal to 11.95

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:897:25
         continue;
       }
 
-      const toPlayerX = playerX - enemyX;
+      const toPlayerX = playerX + enemyX;
       const toPlayerY = playerY - enemyY;
       const distance = Math.hypot(toPlayerX, toPlayerY);
killedBy: enemyAISystem flanker personas respect the player overlap cap while pathing past the player
statusReason: expected 0.8004150390625 to be greater than or equal to 11.95

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:898:25
       }
 
       const toPlayerX = playerX - enemyX;
-      const toPlayerY = playerY - enemyY;
+      const toPlayerY = playerY + enemyY;
       const distance = Math.hypot(toPlayerX, toPlayerY);
       let toward = normalize(toPlayerX, toPlayerY);
killedBy: enemyAISystem flanker personas respect the player overlap cap while pathing past the player
statusReason: expected 0.8004150390625 to be greater than or equal to 11.95

[NoCoverage] BlockStatement
src/game/enemyAISystem.ts:902:37
       const distance = Math.hypot(toPlayerX, toPlayerY);
       let toward = normalize(toPlayerX, toPlayerY);
 
-      if (toward.length <= EPSILON) {
-        const velocityDirection = normalize(currentVx, currentVy);
-        toward =
-          velocityDirection.length > EPSILON
-            ? velocityDirection
-            : { x: eid % 2 === 0 ? 1 : -1, y: 0, length: 1 };
-      }
+      if (toward.length <= EPSILON) {}
 
       const radialToward = currentVx * toward.x + currentVy * toward.y;

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:902:11
       const distance = Math.hypot(toPlayerX, toPlayerY);
       let toward = normalize(toPlayerX, toPlayerY);
 
-      if (toward.length <= EPSILON) {
+      if (true) {
         const velocityDirection = normalize(currentVx, currentVy);
         toward =

[NoCoverage] EqualityOperator
src/game/enemyAISystem.ts:905:11
       if (toward.length <= EPSILON) {
         const velocityDirection = normalize(currentVx, currentVy);
         toward =
-          velocityDirection.length > EPSILON
+          velocityDirection.length >= EPSILON
             ? velocityDirection
             : { x: eid % 2 === 0 ? 1 : -1, y: 0, length: 1 };

[NoCoverage] ConditionalExpression
src/game/enemyAISystem.ts:905:11
       if (toward.length <= EPSILON) {
         const velocityDirection = normalize(currentVx, currentVy);
         toward =
-          velocityDirection.length > EPSILON
+          true
             ? velocityDirection
             : { x: eid % 2 === 0 ? 1 : -1, y: 0, length: 1 };

[NoCoverage] EqualityOperator
src/game/enemyAISystem.ts:907:20
         toward =
           velocityDirection.length > EPSILON
             ? velocityDirection
-            : { x: eid % 2 === 0 ? 1 : -1, y: 0, length: 1 };
+            : { x: eid % 2 !== 0 ? 1 : -1, y: 0, length: 1 };
       }
 

[NoCoverage] ConditionalExpression
src/game/enemyAISystem.ts:907:20
         toward =
           velocityDirection.length > EPSILON
             ? velocityDirection
-            : { x: eid % 2 === 0 ? 1 : -1, y: 0, length: 1 };
+            : { x: true ? 1 : -1, y: 0, length: 1 };
       }
 

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:910:51
             : { x: eid % 2 === 0 ? 1 : -1, y: 0, length: 1 };
       }
 
-      const radialToward = currentVx * toward.x + currentVy * toward.y;
+      const radialToward = currentVx * toward.x + currentVy / toward.y;
       if (radialToward <= EPSILON) {
         continue;
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected NaN to be greater than 0.1

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:910:28
             : { x: eid % 2 === 0 ? 1 : -1, y: 0, length: 1 };
       }
 
-      const radialToward = currentVx * toward.x + currentVy * toward.y;
+      const radialToward = currentVx / toward.x + currentVy * toward.y;
       if (radialToward <= EPSILON) {
         continue;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 303.1758117675781 to be greater than 304

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:911:11
       }
 
       const radialToward = currentVx * toward.x + currentVy * toward.y;
-      if (radialToward <= EPSILON) {
+      if (true) {
         continue;
       }
killedBy: enemyAISystem flanker personas respect the player overlap cap while pathing past the player
statusReason: expected 0.8004150390625 to be greater than or equal to 11.95

[Killed] EqualityOperator
src/game/enemyAISystem.ts:911:11
       }
 
       const radialToward = currentVx * toward.x + currentVy * toward.y;
-      if (radialToward <= EPSILON) {
+      if (radialToward > EPSILON) {
         continue;
       }
killedBy: enemyAISystem flanker personas respect the player overlap cap while pathing past the player
statusReason: expected 0.8004150390625 to be greater than or equal to 11.95

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:915:45
         continue;
       }
 
-      const allowedTowardStep = Math.max(0, distance - MIN_MOB_PLAYER_DISTANCE);
+      const allowedTowardStep = Math.max(0, distance + MIN_MOB_PLAYER_DISTANCE);
       if (radialToward <= allowedTowardStep + EPSILON) {
         continue;
killedBy: enemyAISystem flanker personas respect the player overlap cap while pathing past the player
statusReason: expected 0.8004150390625 to be greater than or equal to 11.95

[Killed] MethodExpression
src/game/enemyAISystem.ts:915:33
         continue;
       }
 
-      const allowedTowardStep = Math.max(0, distance - MIN_MOB_PLAYER_DISTANCE);
+      const allowedTowardStep = Math.min(0, distance - MIN_MOB_PLAYER_DISTANCE);
       if (radialToward <= allowedTowardStep + EPSILON) {
         continue;
killedBy: enemyAISystem navigator personas route through doorways instead of getting stuck on pillars
statusReason: expected 111.99209594726562 to be greater than 304

[Killed] EqualityOperator
src/game/enemyAISystem.ts:916:11
       }
 
       const allowedTowardStep = Math.max(0, distance - MIN_MOB_PLAYER_DISTANCE);
-      if (radialToward <= allowedTowardStep + EPSILON) {
+      if (radialToward > allowedTowardStep + EPSILON) {
         continue;
       }
killedBy: enemyAISystem flanker personas respect the player overlap cap while pathing past the player
statusReason: expected 0.8004150390625 to be greater than or equal to 11.95

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:916:11
       }
 
       const allowedTowardStep = Math.max(0, distance - MIN_MOB_PLAYER_DISTANCE);
-      if (radialToward <= allowedTowardStep + EPSILON) {
+      if (true) {
         continue;
       }
killedBy: enemyAISystem flanker personas respect the player overlap cap while pathing past the player
statusReason: expected 0.8004150390625 to be greater than or equal to 11.95

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:920:24
         continue;
       }
 
-      const tangentX = currentVx - toward.x * radialToward;
+      const tangentX = currentVx + toward.x * radialToward;
       const tangentY = currentVy - toward.y * radialToward;
       const clampedToward = Math.min(radialToward, allowedTowardStep);
killedBy: enemyAISystem flanker personas respect the player overlap cap while pathing past the player
statusReason: expected 0.8004150390625 to be greater than or equal to 11.95

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:920:36
         continue;
       }
 
-      const tangentX = currentVx - toward.x * radialToward;
+      const tangentX = currentVx - toward.x / radialToward;
       const tangentY = currentVy - toward.y * radialToward;
       const clampedToward = Math.min(radialToward, allowedTowardStep);
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 303.51629638671875 to be greater than 304

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:921:36
       }
 
       const tangentX = currentVx - toward.x * radialToward;
-      const tangentY = currentVy - toward.y * radialToward;
+      const tangentY = currentVy - toward.y / radialToward;
       const clampedToward = Math.min(radialToward, allowedTowardStep);
       const tangentMagnitude = Math.hypot(tangentX, tangentY);
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 294.1427001953125 to be greater than 304

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:921:24
       }
 
       const tangentX = currentVx - toward.x * radialToward;
-      const tangentY = currentVy - toward.y * radialToward;
+      const tangentY = currentVy + toward.y * radialToward;
       const clampedToward = Math.min(radialToward, allowedTowardStep);
       const tangentMagnitude = Math.hypot(tangentX, tangentY);
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 292.55181884765625 to be greater than 304

[Killed] MethodExpression
src/game/enemyAISystem.ts:922:29
 
       const tangentX = currentVx - toward.x * radialToward;
       const tangentY = currentVy - toward.y * radialToward;
-      const clampedToward = Math.min(radialToward, allowedTowardStep);
+      const clampedToward = Math.max(radialToward, allowedTowardStep);
       const tangentMagnitude = Math.hypot(tangentX, tangentY);
 
killedBy: enemyAISystem flanker personas respect the player overlap cap while pathing past the player
statusReason: expected 0.8004150390625 to be greater than or equal to 11.95

[Killed] BlockStatement
src/game/enemyAISystem.ts:925:68
       const clampedToward = Math.min(radialToward, allowedTowardStep);
       const tangentMagnitude = Math.hypot(tangentX, tangentY);
 
-      if (clampedToward <= EPSILON && tangentMagnitude <= EPSILON) {
-        const tangentSign = eid % 2 === 0 ? 1 : -1;
-        velocity.x[eid] = -toward.y * tangentSign * speed;
-        velocity.y[eid] = toward.x * tangentSign * speed;
-        continue;
-      }
+      if (clampedToward <= EPSILON && tangentMagnitude <= EPSILON) {}
 
       velocity.x[eid] = tangentX + toward.x * clampedToward;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 292 to be greater than 304

[Killed] EqualityOperator
src/game/enemyAISystem.ts:925:39
       const clampedToward = Math.min(radialToward, allowedTowardStep);
       const tangentMagnitude = Math.hypot(tangentX, tangentY);
 
-      if (clampedToward <= EPSILON && tangentMagnitude <= EPSILON) {
+      if (clampedToward <= EPSILON && tangentMagnitude > EPSILON) {
         const tangentSign = eid % 2 === 0 ? 1 : -1;
         velocity.x[eid] = -toward.y * tangentSign * speed;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 292 to be greater than 304

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:926:29
       const tangentMagnitude = Math.hypot(tangentX, tangentY);
 
       if (clampedToward <= EPSILON && tangentMagnitude <= EPSILON) {
-        const tangentSign = eid % 2 === 0 ? 1 : -1;
+        const tangentSign = false ? 1 : -1;
         velocity.x[eid] = -toward.y * tangentSign * speed;
         velocity.y[eid] = toward.x * tangentSign * speed;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 297.48968505859375 to be greater than 304

[Killed] EqualityOperator
src/game/enemyAISystem.ts:926:29
       const tangentMagnitude = Math.hypot(tangentX, tangentY);
 
       if (clampedToward <= EPSILON && tangentMagnitude <= EPSILON) {
-        const tangentSign = eid % 2 === 0 ? 1 : -1;
+        const tangentSign = eid % 2 !== 0 ? 1 : -1;
         velocity.x[eid] = -toward.y * tangentSign * speed;
         velocity.y[eid] = toward.x * tangentSign * speed;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 297.48968505859375 to be greater than 304

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:927:27
 
       if (clampedToward <= EPSILON && tangentMagnitude <= EPSILON) {
         const tangentSign = eid % 2 === 0 ? 1 : -1;
-        velocity.x[eid] = -toward.y * tangentSign * speed;
+        velocity.x[eid] = -toward.y * tangentSign / speed;
         velocity.y[eid] = toward.x * tangentSign * speed;
         continue;

[Survived] UnaryOperator
src/game/enemyAISystem.ts:927:27
 
       if (clampedToward <= EPSILON && tangentMagnitude <= EPSILON) {
         const tangentSign = eid % 2 === 0 ? 1 : -1;
-        velocity.x[eid] = -toward.y * tangentSign * speed;
+        velocity.x[eid] = +toward.y * tangentSign * speed;
         velocity.y[eid] = toward.x * tangentSign * speed;
         continue;

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:928:27
       if (clampedToward <= EPSILON && tangentMagnitude <= EPSILON) {
         const tangentSign = eid % 2 === 0 ? 1 : -1;
         velocity.x[eid] = -toward.y * tangentSign * speed;
-        velocity.y[eid] = toward.x * tangentSign * speed;
+        velocity.y[eid] = toward.x / tangentSign * speed;
         continue;
       }

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:928:27
       if (clampedToward <= EPSILON && tangentMagnitude <= EPSILON) {
         const tangentSign = eid % 2 === 0 ? 1 : -1;
         velocity.x[eid] = -toward.y * tangentSign * speed;
-        velocity.y[eid] = toward.x * tangentSign * speed;
+        velocity.y[eid] = toward.x * tangentSign / speed;
         continue;
       }

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:932:36
         continue;
       }
 
-      velocity.x[eid] = tangentX + toward.x * clampedToward;
+      velocity.x[eid] = tangentX + toward.x / clampedToward;
       velocity.y[eid] = tangentY + toward.y * clampedToward;
     }
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 296.50201416015625 to be greater than 304

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:932:25
         continue;
       }
 
-      velocity.x[eid] = tangentX + toward.x * clampedToward;
+      velocity.x[eid] = tangentX - toward.x * clampedToward;
       velocity.y[eid] = tangentY + toward.y * clampedToward;
     }
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 289.6444396972656 to be greater than 304

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:933:36
       }
 
       velocity.x[eid] = tangentX + toward.x * clampedToward;
-      velocity.y[eid] = tangentY + toward.y * clampedToward;
+      velocity.y[eid] = tangentY + toward.y / clampedToward;
     }
   }
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 293.3271179199219 to be greater than 304

[Survived] ArithmeticOperator
src/game/enemyAISystem.ts:933:25
       }
 
       velocity.x[eid] = tangentX + toward.x * clampedToward;
-      velocity.y[eid] = tangentY + toward.y * clampedToward;
+      velocity.y[eid] = tangentY - toward.y * clampedToward;
     }
   }

[Killed] BlockStatement
src/game/enemyAISystem.ts:937:36
     }
   }
 
-  for (const eid of activeEnemies) {
-    const vx = velocity.x[eid] ?? 0;
-    const vy = velocity.y[eid] ?? 0;
-    const mag = Math.hypot(vx, vy);
-    const maxSpeed = getEnemySpeed(world, eid);
-
-    if (mag > maxSpeed && mag > EPSILON) {
-      const scale = maxSpeed / mag;
-      setVelocity(world, eid, vx * scale, vy * scale);
-    } else {
-      setVelocity(world, eid, vx, vy);
-    }
-  }
+  for (const eid of activeEnemies) {}
 }
 
killedBy: enemyAISystem pushes overlapping enemies apart via separation
statusReason: expected 3.695518208557121 to be less than or equal to 2.001

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:943:9
     const mag = Math.hypot(vx, vy);
     const maxSpeed = getEnemySpeed(world, eid);
 
-    if (mag > maxSpeed && mag > EPSILON) {
+    if (false) {
       const scale = maxSpeed / mag;
       setVelocity(world, eid, vx * scale, vy * scale);
killedBy: enemyAISystem pushes overlapping enemies apart via separation
statusReason: expected 3.695518208557121 to be less than or equal to 2.001

[Killed] EqualityOperator
src/game/enemyAISystem.ts:943:9
     const mag = Math.hypot(vx, vy);
     const maxSpeed = getEnemySpeed(world, eid);
 
-    if (mag > maxSpeed && mag > EPSILON) {
+    if (mag <= maxSpeed && mag > EPSILON) {
       const scale = maxSpeed / mag;
       setVelocity(world, eid, vx * scale, vy * scale);
killedBy: enemyAISystem pushes overlapping enemies apart via separation
statusReason: expected 3.695518208557121 to be less than or equal to 2.001

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:944:21
     const maxSpeed = getEnemySpeed(world, eid);
 
     if (mag > maxSpeed && mag > EPSILON) {
-      const scale = maxSpeed / mag;
+      const scale = maxSpeed * mag;
       setVelocity(world, eid, vx * scale, vy * scale);
     } else {
killedBy: enemyAISystem pushes overlapping enemies apart via separation
statusReason: expected 27.31370953521448 to be less than or equal to 2.001

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:945:43
 
     if (mag > maxSpeed && mag > EPSILON) {
       const scale = maxSpeed / mag;
-      setVelocity(world, eid, vx * scale, vy * scale);
+      setVelocity(world, eid, vx * scale, vy / scale);
     } else {
       setVelocity(world, eid, vx, vy);
killedBy: enemyAISystem pushes overlapping enemies apart via separation
statusReason: expected 3.2004127065162415 to be less than or equal to 2.001

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:945:31
 
     if (mag > maxSpeed && mag > EPSILON) {
       const scale = maxSpeed / mag;
-      setVelocity(world, eid, vx * scale, vy * scale);
+      setVelocity(world, eid, vx / scale, vy * scale);
     } else {
       setVelocity(world, eid, vx, vy);
killedBy: enemyAISystem pushes overlapping enemies apart via separation
statusReason: expected 6.354901986349935 to be less than or equal to 2.001

[Survived] BlockStatement
src/game/enemyAISystem.ts:946:12
     if (mag > maxSpeed && mag > EPSILON) {
       const scale = maxSpeed / mag;
       setVelocity(world, eid, vx * scale, vy * scale);
-    } else {
-      setVelocity(world, eid, vx, vy);
-    }
+    } else {}
   }
 }

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:958:7
   const playerEid = players[0];
   const pathStates = getPathStateMap(world);
 
-  if (world.frameCount % 60 === 0) {
+  if (false) {
     trimStalePaths(world, pathStates);
   }

[Survived] EqualityOperator
src/game/enemyAISystem.ts:958:7
   const playerEid = players[0];
   const pathStates = getPathStateMap(world);
 
-  if (world.frameCount % 60 === 0) {
+  if (world.frameCount % 60 !== 0) {
     trimStalePaths(world, pathStates);
   }

[Killed] BlockStatement
src/game/enemyAISystem.ts:963:32
   }
 
   if (playerEid === undefined) {
-    for (const eid of enemies) {
-      setVelocity(world, eid, 0, 0);
-      pathStates.delete(eid);
-    }
+    for (const eid of enemies) {}
     return;
   }
killedBy: enemyAISystem stops all behavior enemies when no player exists
statusReason: expected 1.25 to be close to +0, received difference is 1.25, but expected 0.005

[Survived] EqualityOperator
src/game/enemyAISystem.ts:973:7
   const floorMap = world.floorMap;
   const { enemyBehavior, position, velocity } = world.stores;
   const enemyList = Array.from(enemies);
-  if (world.frameCount % 60 === 0) {
+  if (world.frameCount % 60 !== 0) {
     const activeEnemySet = new Set(enemyList);
     const wanderMap = getWanderStateMap(world);

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:973:7
   const floorMap = world.floorMap;
   const { enemyBehavior, position, velocity } = world.stores;
   const enemyList = Array.from(enemies);
-  if (world.frameCount % 60 === 0) {
+  if (false) {
     const activeEnemySet = new Set(enemyList);
     const wanderMap = getWanderStateMap(world);

[NoCoverage] BlockStatement
src/game/enemyAISystem.ts:976:46
   if (world.frameCount % 60 === 0) {
     const activeEnemySet = new Set(enemyList);
     const wanderMap = getWanderStateMap(world);
-    for (const eid of [...wanderMap.keys()]) {
-      if (!activeEnemySet.has(eid)) {
-        wanderMap.delete(eid);
-      }
-    }
+    for (const eid of [...wanderMap.keys()]) {}
   }
   const playerX = position.x[playerEid]!;

[NoCoverage] BlockStatement
src/game/enemyAISystem.ts:977:37
     const activeEnemySet = new Set(enemyList);
     const wanderMap = getWanderStateMap(world);
     for (const eid of [...wanderMap.keys()]) {
-      if (!activeEnemySet.has(eid)) {
-        wanderMap.delete(eid);
-      }
+      if (!activeEnemySet.has(eid)) {}
     }
   }

[NoCoverage] ConditionalExpression
src/game/enemyAISystem.ts:977:11
     const activeEnemySet = new Set(enemyList);
     const wanderMap = getWanderStateMap(world);
     for (const eid of [...wanderMap.keys()]) {
-      if (!activeEnemySet.has(eid)) {
+      if (true) {
         wanderMap.delete(eid);
       }

[Survived] MethodExpression
src/game/enemyAISystem.ts:984:25
   }
   const playerX = position.x[playerEid]!;
   const playerY = position.y[playerEid]!;
-  const swarmEntities = enemyList.filter((eid) => enemyBehavior.type[eid] === AI_TYPE.SWARM);
+  const swarmEntities = enemyList;
   const activeEnemies: number[] = [];
   const doorRevision = floorMap ? getDoorRevision(world) : 0;

[Survived] ArrowFunction
src/game/enemyAISystem.ts:984:42
   }
   const playerX = position.x[playerEid]!;
   const playerY = position.y[playerEid]!;
-  const swarmEntities = enemyList.filter((eid) => enemyBehavior.type[eid] === AI_TYPE.SWARM);
+  const swarmEntities = enemyList.filter(() => undefined);
   const activeEnemies: number[] = [];
   const doorRevision = floorMap ? getDoorRevision(world) : 0;

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:991:22
   for (const eid of enemies) {
     const enemyX = position.x[eid]!;
     const enemyY = position.y[eid]!;
-    const playerDx = playerX - enemyX;
+    const playerDx = playerX + enemyX;
     const playerDy = playerY - enemyY;
     const distanceToPlayer = Math.hypot(playerDx, playerDy);
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 12 to be less than 10

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:992:22
     const enemyX = position.x[eid]!;
     const enemyY = position.y[eid]!;
     const playerDx = playerX - enemyX;
-    const playerDy = playerY - enemyY;
+    const playerDy = playerY + enemyY;
     const distanceToPlayer = Math.hypot(playerDx, playerDy);
     const behaviorType = enemyBehavior.type[eid]!;
killedBy: enemyAISystem sets chase enemy velocity toward the player
statusReason: expected 2 to be close to -2, received difference is 4, but expected 0.005

[Survived] LogicalOperator
src/game/enemyAISystem.ts:998:21
     const aggroRange = enemyBehavior.aggroRange[eid]!;
     const attackRange = enemyBehavior.attackRange[eid]!;
     const speed = getEnemySpeed(world, eid);
-    const persona = enemyBehavior.persona[eid] ?? PATH_PERSONA.NAVIGATOR;
+    const persona = enemyBehavior.persona[eid] && PATH_PERSONA.NAVIGATOR;
     const hasOpenRoomDoor = isEnemyRoomDoorOpen(world, eid);
     const permanentAggro = (enemyBehavior.aggroedPermanently?.[eid] ?? 0) === 1;

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1000:28
     const speed = getEnemySpeed(world, eid);
     const persona = enemyBehavior.persona[eid] ?? PATH_PERSONA.NAVIGATOR;
     const hasOpenRoomDoor = isEnemyRoomDoorOpen(world, eid);
-    const permanentAggro = (enemyBehavior.aggroedPermanently?.[eid] ?? 0) === 1;
+    const permanentAggro = true;
     const inAggroRange = permanentAggro || isAggroActive(aggroRange, distanceToPlayer);
     const canDetectPlayer = (hasOpenRoomDoor || permanentAggro) && inAggroRange;
killedBy: enemyAISystem makes chase enemies wander when the player is outside aggro range
statusReason: expected 0 to be greater than 0.1

[Killed] EqualityOperator
src/game/enemyAISystem.ts:1000:28
     const speed = getEnemySpeed(world, eid);
     const persona = enemyBehavior.persona[eid] ?? PATH_PERSONA.NAVIGATOR;
     const hasOpenRoomDoor = isEnemyRoomDoorOpen(world, eid);
-    const permanentAggro = (enemyBehavior.aggroedPermanently?.[eid] ?? 0) === 1;
+    const permanentAggro = (enemyBehavior.aggroedPermanently?.[eid] ?? 0) !== 1;
     const inAggroRange = permanentAggro || isAggroActive(aggroRange, distanceToPlayer);
     const canDetectPlayer = (hasOpenRoomDoor || permanentAggro) && inAggroRange;
killedBy: enemyAISystem makes chase enemies wander when the player is outside aggro range
statusReason: expected 0 to be greater than 0.1

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1001:26
     const persona = enemyBehavior.persona[eid] ?? PATH_PERSONA.NAVIGATOR;
     const hasOpenRoomDoor = isEnemyRoomDoorOpen(world, eid);
     const permanentAggro = (enemyBehavior.aggroedPermanently?.[eid] ?? 0) === 1;
-    const inAggroRange = permanentAggro || isAggroActive(aggroRange, distanceToPlayer);
+    const inAggroRange = true;
     const canDetectPlayer = (hasOpenRoomDoor || permanentAggro) && inAggroRange;
 
killedBy: enemyAISystem makes chase enemies wander when the player is outside aggro range
statusReason: expected 0 to be greater than 0.1

[Killed] LogicalOperator
src/game/enemyAISystem.ts:1001:26
     const persona = enemyBehavior.persona[eid] ?? PATH_PERSONA.NAVIGATOR;
     const hasOpenRoomDoor = isEnemyRoomDoorOpen(world, eid);
     const permanentAggro = (enemyBehavior.aggroedPermanently?.[eid] ?? 0) === 1;
-    const inAggroRange = permanentAggro || isAggroActive(aggroRange, distanceToPlayer);
+    const inAggroRange = permanentAggro && isAggroActive(aggroRange, distanceToPlayer);
     const canDetectPlayer = (hasOpenRoomDoor || permanentAggro) && inAggroRange;
 
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 0.7096396088600159 to be close to +0, received difference is 0.7096396088600159, but expected 0.005
