[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1002:30
     const hasOpenRoomDoor = isEnemyRoomDoorOpen(world, eid);
     const permanentAggro = (enemyBehavior.aggroedPermanently?.[eid] ?? 0) === 1;
     const inAggroRange = permanentAggro || isAggroActive(aggroRange, distanceToPlayer);
-    const canDetectPlayer = (hasOpenRoomDoor || permanentAggro) && inAggroRange;
+    const canDetectPlayer = (true) && inAggroRange;
 
     const currentVx = velocity.x[eid] ?? 0;
killedBy: enemyAISystem keeps room enemies idle until their room door opens
statusReason: expected 0.7427813410758972 to be close to +0, received difference is 0.7427813410758972, but expected 0.005

[Killed] LogicalOperator
src/game/enemyAISystem.ts:1002:30
     const hasOpenRoomDoor = isEnemyRoomDoorOpen(world, eid);
     const permanentAggro = (enemyBehavior.aggroedPermanently?.[eid] ?? 0) === 1;
     const inAggroRange = permanentAggro || isAggroActive(aggroRange, distanceToPlayer);
-    const canDetectPlayer = (hasOpenRoomDoor || permanentAggro) && inAggroRange;
+    const canDetectPlayer = (hasOpenRoomDoor && permanentAggro) && inAggroRange;
 
     const currentVx = velocity.x[eid] ?? 0;
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Killed] EqualityOperator
src/game/enemyAISystem.ts:1006:22
 
     const currentVx = velocity.x[eid] ?? 0;
     const currentVy = velocity.y[eid] ?? 0;
-    const isMoving = Math.hypot(currentVx, currentVy) > EPSILON;
+    const isMoving = Math.hypot(currentVx, currentVy) <= EPSILON;
     if (isMoving) {
       enemyBehavior.stuckFrames[eid] = 0;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 299.01116943359375 to be greater than 304

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1006:22
 
     const currentVx = velocity.x[eid] ?? 0;
     const currentVy = velocity.y[eid] ?? 0;
-    const isMoving = Math.hypot(currentVx, currentVy) > EPSILON;
+    const isMoving = false;
     if (isMoving) {
       enemyBehavior.stuckFrames[eid] = 0;
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 299.01116943359375 to be greater than 304

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1007:9
     const currentVx = velocity.x[eid] ?? 0;
     const currentVy = velocity.y[eid] ?? 0;
     const isMoving = Math.hypot(currentVx, currentVy) > EPSILON;
-    if (isMoving) {
+    if (false) {
       enemyBehavior.stuckFrames[eid] = 0;
     } else {
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 299.01116943359375 to be greater than 304

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:1007:9
     const currentVx = velocity.x[eid] ?? 0;
     const currentVy = velocity.y[eid] ?? 0;
     const isMoving = Math.hypot(currentVx, currentVy) > EPSILON;
-    if (isMoving) {
+    if (true) {
       enemyBehavior.stuckFrames[eid] = 0;
     } else {

[Survived] BlockStatement
src/game/enemyAISystem.ts:1009:12
     const isMoving = Math.hypot(currentVx, currentVy) > EPSILON;
     if (isMoving) {
       enemyBehavior.stuckFrames[eid] = 0;
-    } else {
-      enemyBehavior.stuckFrames[eid] = (enemyBehavior.stuckFrames[eid] ?? 0) + 1;
-    }
+    } else {}
 
     if (!canDetectPlayer) {

[Killed] ArithmeticOperator
src/game/enemyAISystem.ts:1010:40
     if (isMoving) {
       enemyBehavior.stuckFrames[eid] = 0;
     } else {
-      enemyBehavior.stuckFrames[eid] = (enemyBehavior.stuckFrames[eid] ?? 0) + 1;
+      enemyBehavior.stuckFrames[eid] = (enemyBehavior.stuckFrames[eid] ?? 0) - 1;
     }
 
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:1013:9
       enemyBehavior.stuckFrames[eid] = (enemyBehavior.stuckFrames[eid] ?? 0) + 1;
     }
 
-    if (!canDetectPlayer) {
+    if (canDetectPlayer) {
       if (!inAggroRange) {
         applyIdleWander(world, eid, speed);
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1013:9
       enemyBehavior.stuckFrames[eid] = (enemyBehavior.stuckFrames[eid] ?? 0) + 1;
     }
 
-    if (!canDetectPlayer) {
+    if (false) {
       if (!inAggroRange) {
         applyIdleWander(world, eid, speed);
killedBy: enemyAISystem makes chase enemies wander when the player is outside aggro range
statusReason: expected 0 to be greater than 0.1

[Killed] BlockStatement
src/game/enemyAISystem.ts:1014:26
     }
 
     if (!canDetectPlayer) {
-      if (!inAggroRange) {
-        applyIdleWander(world, eid, speed);
-      } else {
+      if (!inAggroRange) {} else {
         setVelocity(world, eid, 0, 0);
       }
killedBy: enemyAISystem makes chase enemies wander when the player is outside aggro range
statusReason: expected 0 to be greater than 0.1

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:1014:11
     }
 
     if (!canDetectPlayer) {
-      if (!inAggroRange) {
+      if (inAggroRange) {
         applyIdleWander(world, eid, speed);
       } else {
killedBy: enemyAISystem makes chase enemies wander when the player is outside aggro range
statusReason: expected 0 to be greater than 0.1

[Survived] BlockStatement
src/game/enemyAISystem.ts:1016:14
     if (!canDetectPlayer) {
       if (!inAggroRange) {
         applyIdleWander(world, eid, speed);
-      } else {
-        setVelocity(world, eid, 0, 0);
-      }
+      } else {}
       pathStates.delete(eid);
       continue;

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1023:24
       continue;
     }
 
-    const usePathing = floorMap !== null && persona !== PATH_PERSONA.STUPID;
+    const usePathing = false;
 
     if (!usePathing) {
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 299.01116943359375 to be greater than 304

[Killed] EqualityOperator
src/game/enemyAISystem.ts:1023:45
       continue;
     }
 
-    const usePathing = floorMap !== null && persona !== PATH_PERSONA.STUPID;
+    const usePathing = floorMap !== null && persona === PATH_PERSONA.STUPID;
 
     if (!usePathing) {
killedBy: enemyAISystem flanker personas prefer passing beyond the player instead of stopping in front
statusReason: expected 299.01116943359375 to be greater than 304

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1025:9
 
     const usePathing = floorMap !== null && persona !== PATH_PERSONA.STUPID;
 
-    if (!usePathing) {
+    if (false) {
       switch (behaviorType) {
         case AI_TYPE.SWARM:
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Killed] BooleanLiteral
src/game/enemyAISystem.ts:1025:9
 
     const usePathing = floorMap !== null && persona !== PATH_PERSONA.STUPID;
 
-    if (!usePathing) {
+    if (usePathing) {
       switch (behaviorType) {
         case AI_TYPE.SWARM:
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Survived] ConditionalExpression
src/game/enemyAISystem.ts:1027:9
 
     if (!usePathing) {
       switch (behaviorType) {
-        case AI_TYPE.SWARM:
-          applyLegacySwarm(
-            world,
-            eid,
-            swarmEntities,
-            playerDx,
-            playerDy,
-            distanceToPlayer,
-            aggroRange,
-            speed,
-          );
-          break;
+        case AI_TYPE.SWARM:
         case AI_TYPE.RANGED:
           applyLegacyRanged(

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1039:9
             speed,
           );
           break;
-        case AI_TYPE.RANGED:
-          applyLegacyRanged(
-            world,
-            eid,
-            playerDx,
-            playerDy,
-            distanceToPlayer,
-            aggroRange,
-            attackRange,
-            speed,
-          );
-          break;
+        case AI_TYPE.RANGED:
         case AI_TYPE.CHASE:
         default:
killedBy: enemyAISystem makes ranged enemies back away when they are too close
statusReason: expected -1.5 to be greater than 0

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1052:9
           );
           break;
         case AI_TYPE.CHASE:
-        default:
-          applyLegacyChase(world, eid, playerDx, playerDy, distanceToPlayer, aggroRange, speed);
-          break;
+        default:
       }
     } else {
killedBy: enemyAISystem moves a chase enemy toward the player
statusReason: expected 10 to be less than 10

[Killed] BlockStatement
src/game/enemyAISystem.ts:1056:12
           applyLegacyChase(world, eid, playerDx, playerDy, distanceToPlayer, aggroRange, speed);
           break;
       }
-    } else {
-      applyPathDrivenBehavior(
-        world,
-        eid,
-        behaviorType,
-        playerX,
-        playerY,
-        distanceToPlayer,
-        speed,
-        attackRange,
-        doorRevision,
-      );
-    }
+    } else {}
 
     if (attackRange > EPSILON && distanceToPlayer <= attackRange) {
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] EqualityOperator
src/game/enemyAISystem.ts:1070:34
       );
     }
 
-    if (attackRange > EPSILON && distanceToPlayer <= attackRange) {
+    if (attackRange > EPSILON && distanceToPlayer > attackRange) {
       tryFireEnemyProjectile(world, eid, playerDx, playerDy);
     }
killedBy: enemy ranged shooting ranged enemy fires a projectile when within attack range
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1070:9
       );
     }
 
-    if (attackRange > EPSILON && distanceToPlayer <= attackRange) {
+    if (false) {
       tryFireEnemyProjectile(world, eid, playerDx, playerDy);
     }
killedBy: enemy ranged shooting ranged enemy fires a projectile when within attack range
statusReason: expected +0 to be 1 // Object.is equality

[Survived] BlockStatement
src/game/enemyAISystem.ts:1076:18
 
     activeEnemies.push(eid);
     const tracked = pathStates.get(eid);
-    if (tracked) {
-      tracked.lastTouchedFrame = world.frameCount;
-    }
+    if (tracked) {}
 
     // Unstuck: if stuck for too long, try wider pathfinding or jiggle

[Survived] LogicalOperator
src/game/enemyAISystem.ts:1081:25
     }
 
     // Unstuck: if stuck for too long, try wider pathfinding or jiggle
-    const stuckFrames = enemyBehavior.stuckFrames[eid] ?? 0;
+    const stuckFrames = enemyBehavior.stuckFrames[eid] && 0;
     if (stuckFrames > STUCK_FRAMES_THRESHOLD && canDetectPlayer) {
       tryUnstuckVelocity(world, eid, playerDx, playerDy, speed, world.rng);

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1082:9
 
     // Unstuck: if stuck for too long, try wider pathfinding or jiggle
     const stuckFrames = enemyBehavior.stuckFrames[eid] ?? 0;
-    if (stuckFrames > STUCK_FRAMES_THRESHOLD && canDetectPlayer) {
+    if (true) {
       tryUnstuckVelocity(world, eid, playerDx, playerDy, speed, world.rng);
     }
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1

[Killed] ConditionalExpression
src/game/enemyAISystem.ts:1082:9
 
     // Unstuck: if stuck for too long, try wider pathfinding or jiggle
     const stuckFrames = enemyBehavior.stuckFrames[eid] ?? 0;
-    if (stuckFrames > STUCK_FRAMES_THRESHOLD && canDetectPlayer) {
+    if (true && canDetectPlayer) {
       tryUnstuckVelocity(world, eid, playerDx, playerDy, speed, world.rng);
     }
killedBy: enemyAISystem pathing ranged enemies strafe while inside attack range band
statusReason: expected 0 to be greater than 0.1
