[Killed] BlockStatement
src/game/weaponSystem.ts:465:46
 /** Set the active weapon definition for the weapon system. */
 export function setActiveWeapon(world: GameWorld, weaponDef: WeaponDef): void {
   const state = getWeaponState(world);
-  if (state.activeWeaponId === weaponDef.id) {
-    // Update def for live tuning without resetting cooldown
-    state.activeWeaponDef = weaponDef;
-    logger.debug('Updated active weapon tuning in place', { weaponId: weaponDef.id });
-    return;
-  }
+  if (state.activeWeaponId === weaponDef.id) {}
   state.activeWeaponId = weaponDef.id;
   state.activeWeaponDef = weaponDef;
killedBy: weaponSystem coverage paths keeps cooldown when updating active weapon and can return to legacy mode
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/game/weaponSystem.ts:465:7
 /** Set the active weapon definition for the weapon system. */
 export function setActiveWeapon(world: GameWorld, weaponDef: WeaponDef): void {
   const state = getWeaponState(world);
-  if (state.activeWeaponId === weaponDef.id) {
+  if (false) {
     // Update def for live tuning without resetting cooldown
     state.activeWeaponDef = weaponDef;
killedBy: weaponSystem coverage paths keeps cooldown when updating active weapon and can return to legacy mode
statusReason: expected 2 to be 1 // Object.is equality

[Survived] StringLiteral
src/game/weaponSystem.ts:468:18
   if (state.activeWeaponId === weaponDef.id) {
     // Update def for live tuning without resetting cooldown
     state.activeWeaponDef = weaponDef;
-    logger.debug('Updated active weapon tuning in place', { weaponId: weaponDef.id });
+    logger.debug("", { weaponId: weaponDef.id });
     return;
   }

[Killed] ArithmeticOperator
src/game/weaponSystem.ts:473:22
   }
   state.activeWeaponId = weaponDef.id;
   state.activeWeaponDef = weaponDef;
-  state.lastFireMs = world.elapsedMs - weaponDef.cooldownMs;
+  state.lastFireMs = world.elapsedMs + weaponDef.cooldownMs;
   logger.info('Equipped active weapon', {
     weaponId: weaponDef.id,
killedBy: melee weapons sword spawns a MeleeSwing entity at player position
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/game/weaponSystem.ts:482:59
 }
 
 /** Clear the active weapon, reverting to legacy projectile mode. */
-export function clearActiveWeapon(world: GameWorld): void {
-  const state = getWeaponState(world);
-  const previousWeaponId = state.activeWeaponId;
-  state.activeWeaponId = undefined;
-  state.activeWeaponDef = undefined;
-  logger.info('Cleared active weapon; returning to legacy projectile mode', { previousWeaponId });
-}
+export function clearActiveWeapon(world: GameWorld): void {}
 
 /** Get the active weapon definition, if any. */
killedBy: weaponSystem coverage paths keeps cooldown when updating active weapon and can return to legacy mode
statusReason: expected { Object (range, projectileSpeed, ...) } to be undefined

[Survived] StringLiteral
src/game/weaponSystem.ts:487:15
   const previousWeaponId = state.activeWeaponId;
   state.activeWeaponId = undefined;
   state.activeWeaponDef = undefined;
-  logger.info('Cleared active weapon; returning to legacy projectile mode', { previousWeaponId });
+  logger.info("", { previousWeaponId });
 }
 

[Survived] ConditionalExpression
src/game/weaponSystem.ts:501:7
   if (player === undefined) {
     return;
   }
-  if (isEntityInSafeSpace(world, player)) {
+  if (false) {
     return;
   }

[NoCoverage] BlockStatement
src/game/weaponSystem.ts:501:43
   if (player === undefined) {
     return;
   }
-  if (isEntityInSafeSpace(world, player)) {
-    return;
-  }
+  if (isEntityInSafeSpace(world, player)) {}
 
   const state = getWeaponState(world);

[Killed] EqualityOperator
src/game/weaponSystem.ts:516:9
     const def = state.activeWeaponDef;
 
     // Trap weapons deploy at the player's feet regardless of enemy proximity.
-    if (def.weaponType === WeaponType.TRAP) {
+    if (def.weaponType !== WeaponType.TRAP) {
       const lastFire = state.lastFireMs;
       if (world.elapsedMs - lastFire >= def.cooldownMs) {
killedBy: thrown weapons boomerang starts returning after exceeding max range
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/game/weaponSystem.ts:516:45
     const def = state.activeWeaponDef;
 
     // Trap weapons deploy at the player's feet regardless of enemy proximity.
-    if (def.weaponType === WeaponType.TRAP) {
-      const lastFire = state.lastFireMs;
-      if (world.elapsedMs - lastFire >= def.cooldownMs) {
-        dispatchAttack(world, player, def, { x: 0, y: 0 });
-        state.lastFireMs = world.elapsedMs;
-      }
-      return;
-    }
+    if (def.weaponType === WeaponType.TRAP) {}
 
     const target = getNearestEnemyTarget(world, playerX, playerY);
killedBy: trap weapons landmine spawns a Trap entity at player position
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/game/weaponSystem.ts:518:57
     // Trap weapons deploy at the player's feet regardless of enemy proximity.
     if (def.weaponType === WeaponType.TRAP) {
       const lastFire = state.lastFireMs;
-      if (world.elapsedMs - lastFire >= def.cooldownMs) {
-        dispatchAttack(world, player, def, { x: 0, y: 0 });
-        state.lastFireMs = world.elapsedMs;
-      }
+      if (world.elapsedMs - lastFire >= def.cooldownMs) {}
       return;
     }
killedBy: trap weapons landmine spawns a Trap entity at player position
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/game/weaponSystem.ts:518:11
     // Trap weapons deploy at the player's feet regardless of enemy proximity.
     if (def.weaponType === WeaponType.TRAP) {
       const lastFire = state.lastFireMs;
-      if (world.elapsedMs - lastFire >= def.cooldownMs) {
+      if (world.elapsedMs - lastFire < def.cooldownMs) {
         dispatchAttack(world, player, def, { x: 0, y: 0 });
         state.lastFireMs = world.elapsedMs;
killedBy: trap weapons landmine spawns a Trap entity at player position
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/game/weaponSystem.ts:530:25
       return;
     }
     const fireDir = target.direction;
-    const gateRangePx = getWeaponGateRangePx(def) * ATTACK_TARGET_GATE_MULTIPLIER;
+    const gateRangePx = getWeaponGateRangePx(def) / ATTACK_TARGET_GATE_MULTIPLIER;
     if (target.distanceSq > gateRangePx * gateRangePx) {
       return;
killedBy: melee weapons sword spawns a MeleeSwing entity at player position
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/game/weaponSystem.ts:531:29
     }
     const fireDir = target.direction;
     const gateRangePx = getWeaponGateRangePx(def) * ATTACK_TARGET_GATE_MULTIPLIER;
-    if (target.distanceSq > gateRangePx * gateRangePx) {
+    if (target.distanceSq > gateRangePx / gateRangePx) {
       return;
     }
killedBy: melee weapons sword spawns a MeleeSwing entity at player position
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/game/weaponSystem.ts:531:9
     }
     const fireDir = target.direction;
     const gateRangePx = getWeaponGateRangePx(def) * ATTACK_TARGET_GATE_MULTIPLIER;
-    if (target.distanceSq > gateRangePx * gateRangePx) {
+    if (target.distanceSq <= gateRangePx * gateRangePx) {
       return;
     }
killedBy: melee weapons sword spawns a MeleeSwing entity at player position
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/game/weaponSystem.ts:536:9
     }
     const lastFire = state.lastFireMs;
 
-    if (world.elapsedMs - lastFire < def.cooldownMs) {
+    if (world.elapsedMs + lastFire < def.cooldownMs) {
       return;
     }
killedBy: melee weapons sword spawns a MeleeSwing entity at player position
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/game/weaponSystem.ts:536:9
     }
     const lastFire = state.lastFireMs;
 
-    if (world.elapsedMs - lastFire < def.cooldownMs) {
+    if (false) {
       return;
     }
killedBy: magic weapons fireball respects cooldown
statusReason: expected 2 to be 1 // Object.is equality

[Survived] ObjectLiteral
src/game/weaponSystem.ts:544:48
     state.aimX = fireDir.x;
     state.aimY = fireDir.y;
     state.lastFireMs = world.elapsedMs;
-    logger.debug('Fired active weapon attack', {
-      weaponId: def.id,
-      weaponType: def.weaponType,
-      elapsedMs: world.elapsedMs,
-    });
+    logger.debug('Fired active weapon attack', {});
     return;
   }

[Killed] ConditionalExpression
src/game/weaponSystem.ts:556:7
   const config = resolveWeaponConfig(world, player);
   const lastFireMs = readLastFireMs(world, player);
 
-  if (world.elapsedMs - lastFireMs < config.fireRateMs) {
+  if (false) {
     return;
   }
killedBy: weaponSystem does not spawn a projectile while the weapon is on cooldown
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/game/weaponSystem.ts:556:7
   const config = resolveWeaponConfig(world, player);
   const lastFireMs = readLastFireMs(world, player);
 
-  if (world.elapsedMs - lastFireMs < config.fireRateMs) {
+  if (world.elapsedMs - lastFireMs <= config.fireRateMs) {
     return;
   }
killedBy: weaponSystem coverage paths applies Damage component overrides in legacy mode
statusReason: expected undefined to be defined

[Killed] ArithmeticOperator
src/game/weaponSystem.ts:564:29
   if (!legacyTarget) {
     return;
   }
-  const legacyGateRangePx = WEAPON.THROWN_MAX_RANGE * ATTACK_TARGET_GATE_MULTIPLIER;
+  const legacyGateRangePx = WEAPON.THROWN_MAX_RANGE / ATTACK_TARGET_GATE_MULTIPLIER;
   if (legacyTarget.distanceSq > legacyGateRangePx * legacyGateRangePx) {
     return;
killedBy: weaponSystem does not spawn a projectile while the weapon is on cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/game/weaponSystem.ts:565:33
     return;
   }
   const legacyGateRangePx = WEAPON.THROWN_MAX_RANGE * ATTACK_TARGET_GATE_MULTIPLIER;
-  if (legacyTarget.distanceSq > legacyGateRangePx * legacyGateRangePx) {
+  if (legacyTarget.distanceSq > legacyGateRangePx / legacyGateRangePx) {
     return;
   }
killedBy: weaponSystem spawns a projectile when the cooldown has elapsed
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/game/weaponSystem.ts:565:7
     return;
   }
   const legacyGateRangePx = WEAPON.THROWN_MAX_RANGE * ATTACK_TARGET_GATE_MULTIPLIER;
-  if (legacyTarget.distanceSq > legacyGateRangePx * legacyGateRangePx) {
+  if (legacyTarget.distanceSq <= legacyGateRangePx * legacyGateRangePx) {
     return;
   }
killedBy: weaponSystem spawns a projectile when the cooldown has elapsed
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/game/weaponSystem.ts:573:28
   const extraProjectiles = hasComponent(world.ecs, player, Stats)
     ? Math.floor(world.stores.stats.projectileCount[player]!)
     : 0;
-  const totalProjectiles = 1 + extraProjectiles;
+  const totalProjectiles = 1 - extraProjectiles;
 
   for (let i = 0; i < totalProjectiles; i++) {
killedBy: weaponSystem coverage paths fires spread projectiles when projectileCount grants extras
statusReason: expected [] to have a length of 3 but got +0

[Killed] EqualityOperator
src/game/weaponSystem.ts:575:19
     : 0;
   const totalProjectiles = 1 + extraProjectiles;
 
-  for (let i = 0; i < totalProjectiles; i++) {
+  for (let i = 0; i >= totalProjectiles; i++) {
     // Spread extra projectiles slightly so they don't perfectly overlap
     let dx = legacyTarget.direction.x;
killedBy: weaponSystem coverage paths fires spread projectiles when projectileCount grants extras
statusReason: expected [] to have a length of 3 but got +0

[Killed] BlockStatement
src/game/weaponSystem.ts:575:46
     : 0;
   const totalProjectiles = 1 + extraProjectiles;
 
-  for (let i = 0; i < totalProjectiles; i++) {
-    // Spread extra projectiles slightly so they don't perfectly overlap
-    let dx = legacyTarget.direction.x;
-    let dy = legacyTarget.direction.y;
-    if (i > 0) {
-      const spreadAngle = (i % 2 === 1 ? 1 : -1) * (Math.ceil(i / 2) * 0.15);
-      const cos = Math.cos(spreadAngle);
-      const sin = Math.sin(spreadAngle);
-      dx = legacyTarget.direction.x * cos - legacyTarget.direction.y * sin;
-      dy = legacyTarget.direction.x * sin + legacyTarget.direction.y * cos;
-      const len = Math.hypot(dx, dy);
-      dx /= len;
-      dy /= len;
-    }
-
-    spawnProjectile(
-      world,
-      playerX,
-      playerY,
-      dx * config.projectileSpeed,
-      dy * config.projectileSpeed,
-      config.baseDamage,
-    );
-  }
+  for (let i = 0; i < totalProjectiles; i++) {}
 
   state.aimX = legacyTarget.direction.x;
killedBy: weaponSystem coverage paths fires spread projectiles when projectileCount grants extras
statusReason: expected [] to have a length of 3 but got +0

[Killed] EqualityOperator
src/game/weaponSystem.ts:579:9
     // Spread extra projectiles slightly so they don't perfectly overlap
     let dx = legacyTarget.direction.x;
     let dy = legacyTarget.direction.y;
-    if (i > 0) {
+    if (i <= 0) {
       const spreadAngle = (i % 2 === 1 ? 1 : -1) * (Math.ceil(i / 2) * 0.15);
       const cos = Math.cos(spreadAngle);
killedBy: weaponSystem coverage paths fires spread projectiles when projectileCount grants extras
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/game/weaponSystem.ts:579:16
     // Spread extra projectiles slightly so they don't perfectly overlap
     let dx = legacyTarget.direction.x;
     let dy = legacyTarget.direction.y;
-    if (i > 0) {
-      const spreadAngle = (i % 2 === 1 ? 1 : -1) * (Math.ceil(i / 2) * 0.15);
-      const cos = Math.cos(spreadAngle);
-      const sin = Math.sin(spreadAngle);
-      dx = legacyTarget.direction.x * cos - legacyTarget.direction.y * sin;
-      dy = legacyTarget.direction.x * sin + legacyTarget.direction.y * cos;
-      const len = Math.hypot(dx, dy);
-      dx /= len;
-      dy /= len;
-    }
+    if (i > 0) {}
 
     spawnProjectile(
killedBy: weaponSystem coverage paths fires spread projectiles when projectileCount grants extras
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/game/weaponSystem.ts:580:28
     let dx = legacyTarget.direction.x;
     let dy = legacyTarget.direction.y;
     if (i > 0) {
-      const spreadAngle = (i % 2 === 1 ? 1 : -1) * (Math.ceil(i / 2) * 0.15);
+      const spreadAngle = (true ? 1 : -1) * (Math.ceil(i / 2) * 0.15);
       const cos = Math.cos(spreadAngle);
       const sin = Math.sin(spreadAngle);

[Survived] UnaryOperator
src/game/weaponSystem.ts:580:46
     let dx = legacyTarget.direction.x;
     let dy = legacyTarget.direction.y;
     if (i > 0) {
-      const spreadAngle = (i % 2 === 1 ? 1 : -1) * (Math.ceil(i / 2) * 0.15);
+      const spreadAngle = (i % 2 === 1 ? 1 : +1) * (Math.ceil(i / 2) * 0.15);
       const cos = Math.cos(spreadAngle);
       const sin = Math.sin(spreadAngle);

[Survived] ArithmeticOperator
src/game/weaponSystem.ts:583:12
       const spreadAngle = (i % 2 === 1 ? 1 : -1) * (Math.ceil(i / 2) * 0.15);
       const cos = Math.cos(spreadAngle);
       const sin = Math.sin(spreadAngle);
-      dx = legacyTarget.direction.x * cos - legacyTarget.direction.y * sin;
+      dx = legacyTarget.direction.x * cos + legacyTarget.direction.y * sin;
       dy = legacyTarget.direction.x * sin + legacyTarget.direction.y * cos;
       const len = Math.hypot(dx, dy);

[Survived] ArithmeticOperator
src/game/weaponSystem.ts:583:45
       const spreadAngle = (i % 2 === 1 ? 1 : -1) * (Math.ceil(i / 2) * 0.15);
       const cos = Math.cos(spreadAngle);
       const sin = Math.sin(spreadAngle);
-      dx = legacyTarget.direction.x * cos - legacyTarget.direction.y * sin;
+      dx = legacyTarget.direction.x * cos - legacyTarget.direction.y / sin;
       dy = legacyTarget.direction.x * sin + legacyTarget.direction.y * cos;
       const len = Math.hypot(dx, dy);

[Survived] ArithmeticOperator
src/game/weaponSystem.ts:584:45
       const cos = Math.cos(spreadAngle);
       const sin = Math.sin(spreadAngle);
       dx = legacyTarget.direction.x * cos - legacyTarget.direction.y * sin;
-      dy = legacyTarget.direction.x * sin + legacyTarget.direction.y * cos;
+      dy = legacyTarget.direction.x * sin + legacyTarget.direction.y / cos;
       const len = Math.hypot(dx, dy);
       dx /= len;

[Survived] ArithmeticOperator
src/game/weaponSystem.ts:584:12
       const cos = Math.cos(spreadAngle);
       const sin = Math.sin(spreadAngle);
       dx = legacyTarget.direction.x * cos - legacyTarget.direction.y * sin;
-      dy = legacyTarget.direction.x * sin + legacyTarget.direction.y * cos;
+      dy = legacyTarget.direction.x / sin + legacyTarget.direction.y * cos;
       const len = Math.hypot(dx, dy);
       dx /= len;

[Survived] AssignmentOperator
src/game/weaponSystem.ts:586:7
       dx = legacyTarget.direction.x * cos - legacyTarget.direction.y * sin;
       dy = legacyTarget.direction.x * sin + legacyTarget.direction.y * cos;
       const len = Math.hypot(dx, dy);
-      dx /= len;
+      dx *= len;
       dy /= len;
     }

[Survived] AssignmentOperator
src/game/weaponSystem.ts:587:7
       dy = legacyTarget.direction.x * sin + legacyTarget.direction.y * cos;
       const len = Math.hypot(dx, dy);
       dx /= len;
-      dy /= len;
+      dy *= len;
     }
 

[Killed] ArithmeticOperator
src/game/weaponSystem.ts:594:7
       world,
       playerX,
       playerY,
-      dx * config.projectileSpeed,
+      dx / config.projectileSpeed,
       dy * config.projectileSpeed,
       config.baseDamage,
killedBy: weaponSystem aims projectiles at the nearest enemy
statusReason: expected 0.20000000298023224 to be close to 5, received difference is 4.799999997019768, but expected 0.0000049999999999999996

[Survived] ArithmeticOperator
src/game/weaponSystem.ts:595:7
       playerX,
       playerY,
       dx * config.projectileSpeed,
-      dy * config.projectileSpeed,
+      dy / config.projectileSpeed,
       config.baseDamage,
     );

[Survived] ObjectLiteral
src/game/weaponSystem.ts:603:50
   state.aimX = legacyTarget.direction.x;
   state.aimY = legacyTarget.direction.y;
   writeLastFireMs(world, player, config, world.elapsedMs);
-  logger.debug('Fired legacy projectile volley', {
-    projectileCount: totalProjectiles,
-    baseDamage: config.baseDamage,
-    elapsedMs: world.elapsedMs,
-  });
+  logger.debug('Fired legacy projectile volley', {});
 }
 

[Survived] StringLiteral
src/game/weaponSystem.ts:603:16
   state.aimX = legacyTarget.direction.x;
   state.aimY = legacyTarget.direction.y;
   writeLastFireMs(world, player, config, world.elapsedMs);
-  logger.debug('Fired legacy projectile volley', {
+  logger.debug("", {
     projectileCount: totalProjectiles,
     baseDamage: config.baseDamage,

[Killed] BooleanLiteral
src/game/weaponSystem.ts:617:9
 
   for (const weid of weaponEntities) {
     const ownerEid = owner.eid[weid]!;
-    if (!hasComponent(world.ecs, ownerEid, Position)) {
+    if (hasComponent(world.ecs, ownerEid, Position)) {
       continue;
     }
killedBy: weaponEntitySystem coverage paths fires ranged weapon entities and respects cooldown gating
statusReason: expected +0 to be 1 // Object.is equality

[Survived] BlockStatement
src/game/weaponSystem.ts:617:55
 
   for (const weid of weaponEntities) {
     const ownerEid = owner.eid[weid]!;
-    if (!hasComponent(world.ecs, ownerEid, Position)) {
-      continue;
-    }
+    if (!hasComponent(world.ecs, ownerEid, Position)) {}
     if (hasComponent(world.ecs, ownerEid, Player) && isEntityInSafeSpace(world, ownerEid)) {
       continue;

[Killed] LogicalOperator
src/game/weaponSystem.ts:620:9
     if (!hasComponent(world.ecs, ownerEid, Position)) {
       continue;
     }
-    if (hasComponent(world.ecs, ownerEid, Player) && isEntityInSafeSpace(world, ownerEid)) {
+    if (hasComponent(world.ecs, ownerEid, Player) || isEntityInSafeSpace(world, ownerEid)) {
       continue;
     }
killedBy: weaponEntitySystem coverage paths fires ranged weapon entities and respects cooldown gating
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/game/weaponSystem.ts:620:9
     if (!hasComponent(world.ecs, ownerEid, Position)) {
       continue;
     }
-    if (hasComponent(world.ecs, ownerEid, Player) && isEntityInSafeSpace(world, ownerEid)) {
+    if (false) {
       continue;
     }

[Killed] EqualityOperator
src/game/weaponSystem.ts:627:9
     const cooldownMs = weapon.cooldownMs[weid]!;
     const lastFireMs = weapon.lastFireMs[weid]!;
 
-    if (world.elapsedMs - lastFireMs < cooldownMs) {
+    if (world.elapsedMs - lastFireMs >= cooldownMs) {
       continue;
     }
killedBy: weaponEntitySystem coverage paths fires ranged weapon entities and respects cooldown gating
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/game/weaponSystem.ts:627:9
     const cooldownMs = weapon.cooldownMs[weid]!;
     const lastFireMs = weapon.lastFireMs[weid]!;
 
-    if (world.elapsedMs - lastFireMs < cooldownMs) {
+    if (false) {
       continue;
     }
killedBy: weaponEntitySystem coverage paths fires ranged weapon entities and respects cooldown gating
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/game/weaponSystem.ts:639:9
     }
     const weaponType = weapon.weaponType[weid]!;
     const rawRange = weapon.range[weid] ?? 0;
-    if (rawRange > 0) {
+    if (rawRange <= 0) {
       let gateRangePx = rawRange * ATTACK_TARGET_GATE_MULTIPLIER;
       if (weaponType === WeaponType.MELEE) {
killedBy: weaponEntitySystem coverage paths fires ranged weapon entities and respects cooldown gating
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/game/weaponSystem.ts:639:9
     }
     const weaponType = weapon.weaponType[weid]!;
     const rawRange = weapon.range[weid] ?? 0;
-    if (rawRange > 0) {
+    if (rawRange >= 0) {
       let gateRangePx = rawRange * ATTACK_TARGET_GATE_MULTIPLIER;
       if (weaponType === WeaponType.MELEE) {
killedBy: weaponEntitySystem coverage paths fires ranged weapon entities and respects cooldown gating
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/game/weaponSystem.ts:640:25
     const weaponType = weapon.weaponType[weid]!;
     const rawRange = weapon.range[weid] ?? 0;
     if (rawRange > 0) {
-      let gateRangePx = rawRange * ATTACK_TARGET_GATE_MULTIPLIER;
+      let gateRangePx = rawRange / ATTACK_TARGET_GATE_MULTIPLIER;
       if (weaponType === WeaponType.MELEE) {
         gateRangePx += target.radiusPx;
killedBy: weaponEntitySystem coverage paths uses owner team for melee attacks and falls back to player team
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/game/weaponSystem.ts:641:11
     const rawRange = weapon.range[weid] ?? 0;
     if (rawRange > 0) {
       let gateRangePx = rawRange * ATTACK_TARGET_GATE_MULTIPLIER;
-      if (weaponType === WeaponType.MELEE) {
+      if (weaponType !== WeaponType.MELEE) {
         gateRangePx += target.radiusPx;
       }
killedBy: weaponEntitySystem coverage paths uses owner team for melee attacks and falls back to player team
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/game/weaponSystem.ts:641:44
     const rawRange = weapon.range[weid] ?? 0;
     if (rawRange > 0) {
       let gateRangePx = rawRange * ATTACK_TARGET_GATE_MULTIPLIER;
-      if (weaponType === WeaponType.MELEE) {
-        gateRangePx += target.radiusPx;
-      }
+      if (weaponType === WeaponType.MELEE) {}
       if (target.distanceSq > gateRangePx * gateRangePx) {
         continue;
killedBy: weaponEntitySystem coverage paths uses owner team for melee attacks and falls back to player team
statusReason: expected undefined to be defined

[Killed] AssignmentOperator
src/game/weaponSystem.ts:642:9
     if (rawRange > 0) {
       let gateRangePx = rawRange * ATTACK_TARGET_GATE_MULTIPLIER;
       if (weaponType === WeaponType.MELEE) {
-        gateRangePx += target.radiusPx;
+        gateRangePx -= target.radiusPx;
       }
       if (target.distanceSq > gateRangePx * gateRangePx) {
killedBy: weaponEntitySystem coverage paths uses owner team for melee attacks and falls back to player team
statusReason: expected undefined to be defined

[Killed] ArithmeticOperator
src/game/weaponSystem.ts:644:31
       if (weaponType === WeaponType.MELEE) {
         gateRangePx += target.radiusPx;
       }
-      if (target.distanceSq > gateRangePx * gateRangePx) {
+      if (target.distanceSq > gateRangePx / gateRangePx) {
         continue;
       }
killedBy: weaponEntitySystem coverage paths uses owner team for melee attacks and falls back to player team
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/game/weaponSystem.ts:644:11
       if (weaponType === WeaponType.MELEE) {
         gateRangePx += target.radiusPx;
       }
-      if (target.distanceSq > gateRangePx * gateRangePx) {
+      if (true) {
         continue;
       }
killedBy: weaponEntitySystem coverage paths uses owner team for melee attacks and falls back to player team
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/game/weaponSystem.ts:653:7
     const projSpeed = weapon.projectileSpeed[weid]!;
 
     switch (weaponType) {
-      case WeaponType.RANGED:
-        spawnProjectile(world, px, py, dir.x * projSpeed, dir.y * projSpeed, baseDamage);
-        break;
+      case WeaponType.RANGED:
       case WeaponType.MELEE: {
         const range = weapon.range[weid]!;
killedBy: weaponEntitySystem coverage paths fires ranged weapon entities and respects cooldown gating
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ArithmeticOperator
src/game/weaponSystem.ts:654:59
 
     switch (weaponType) {
       case WeaponType.RANGED:
-        spawnProjectile(world, px, py, dir.x * projSpeed, dir.y * projSpeed, baseDamage);
+        spawnProjectile(world, px, py, dir.x * projSpeed, dir.y / projSpeed, baseDamage);
         break;
       case WeaponType.MELEE: {

[Survived] ArithmeticOperator
src/game/weaponSystem.ts:654:40
 
     switch (weaponType) {
       case WeaponType.RANGED:
-        spawnProjectile(world, px, py, dir.x * projSpeed, dir.y * projSpeed, baseDamage);
+        spawnProjectile(world, px, py, dir.x / projSpeed, dir.y * projSpeed, baseDamage);
         break;
       case WeaponType.MELEE: {

[Killed] ConditionalExpression
src/game/weaponSystem.ts:656:7
       case WeaponType.RANGED:
         spawnProjectile(world, px, py, dir.x * projSpeed, dir.y * projSpeed, baseDamage);
         break;
-      case WeaponType.MELEE: {
-        const range = weapon.range[weid]!;
-        const ownerTeam = hasComponent(world.ecs, ownerEid, Team)
-          ? team.id[ownerEid]!
-          : TeamId.PLAYER;
-        spawnAreaAttack(
-          world,
-          px,
-          py,
-          ownerEid,
-          baseDamage,
-          range,
-          WEAPON.MELEE_DURATION_MS,
-          ownerTeam,
-        );
-        break;
-      }
+      case WeaponType.MELEE:
       default:
         spawnProjectile(world, px, py, dir.x * projSpeed, dir.y * projSpeed, baseDamage);
killedBy: weaponEntitySystem coverage paths uses owner team for melee attacks and falls back to player team
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/game/weaponSystem.ts:673:7
         );
         break;
       }
-      default:
-        spawnProjectile(world, px, py, dir.x * projSpeed, dir.y * projSpeed, baseDamage);
-        break;
+      default:
     }
 
killedBy: weaponEntitySystem coverage paths falls back to projectile spawn for unknown weapon type
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ArithmeticOperator
src/game/weaponSystem.ts:674:59
         break;
       }
       default:
-        spawnProjectile(world, px, py, dir.x * projSpeed, dir.y * projSpeed, baseDamage);
+        spawnProjectile(world, px, py, dir.x * projSpeed, dir.y / projSpeed, baseDamage);
         break;
     }

[Survived] ArithmeticOperator
src/game/weaponSystem.ts:674:40
         break;
       }
       default:
-        spawnProjectile(world, px, py, dir.x * projSpeed, dir.y * projSpeed, baseDamage);
+        spawnProjectile(world, px, py, dir.x / projSpeed, dir.y * projSpeed, baseDamage);
         break;
     }
