[Killed] ConditionalExpression
src/core/systems/areaDamageSystem.ts:12:7
 
 function getHitSet(world: GameWorld, eid: number): Set<number> {
   let worldHits = hitSets.get(world);
-  if (worldHits === undefined) {
+  if (true) {
     worldHits = new Map();
     hitSets.set(world, worldHits);
killedBy: areaDamageSystem hit-once prevents re-damaging same target
statusReason: expected 20 to be 35 // Object.is equality

[Survived] BlockStatement
src/core/systems/areaDamageSystem.ts:25:74
 }
 
 /** Clean up hit tracking for removed entities. */
-export function clearAreaDamageHits(world: GameWorld, eid: number): void {
-  const worldHits = hitSets.get(world);
-  if (worldHits !== undefined) {
-    worldHits.delete(eid);
-  }
-}
+export function clearAreaDamageHits(world: GameWorld, eid: number): void {}
 
 /** Deals damage to enemies within AreaDamage radius. Uses spatial grid for broad-phase. */

[NoCoverage] BlockStatement
src/core/systems/areaDamageSystem.ts:27:32
 /** Clean up hit tracking for removed entities. */
 export function clearAreaDamageHits(world: GameWorld, eid: number): void {
   const worldHits = hitSets.get(world);
-  if (worldHits !== undefined) {
-    worldHits.delete(eid);
-  }
+  if (worldHits !== undefined) {}
 }
 

[Survived] ArrayDeclaration
src/core/systems/areaDamageSystem.ts:34:41
 
 /** Deals damage to enemies within AreaDamage radius. Uses spatial grid for broad-phase. */
 export function areaDamageSystem(world: GameWorld, collisionResult: CollisionResult): void {
-  const areaEntities = query(world.ecs, [AreaDamage, Position]);
+  const areaEntities = query(world.ecs, []);
   const { position, areaDamage, team } = world.stores;
 

[Killed] EqualityOperator
src/core/systems/areaDamageSystem.ts:38:9
   const { position, areaDamage, team } = world.stores;
 
   for (const eid of areaEntities) {
-    if (eid === undefined || !entityExists(world.ecs, eid)) {
+    if (eid !== undefined || !entityExists(world.ecs, eid)) {
       continue;
     }
killedBy: areaDamageSystem damages enemies within radius
statusReason: expected 50 to be 35 // Object.is equality

[Killed] BooleanLiteral
src/core/systems/areaDamageSystem.ts:38:30
   const { position, areaDamage, team } = world.stores;
 
   for (const eid of areaEntities) {
-    if (eid === undefined || !entityExists(world.ecs, eid)) {
+    if (eid === undefined || entityExists(world.ecs, eid)) {
       continue;
     }
killedBy: areaDamageSystem damages enemies within radius
statusReason: expected 50 to be 35 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/areaDamageSystem.ts:46:23
     const y = position.y[eid] ?? 0;
     const radius = areaDamage.radius[eid] ?? 0;
     const damage = areaDamage.damage[eid] ?? 0;
-    const isHitOnce = (areaDamage.hitOnce[eid] ?? 0) !== 0;
+    const isHitOnce = false;
     const areaTeam = hasComponent(world.ecs, eid, Team) ? (team.id[eid] ?? 0) : -1;
     const ownerEid = hasComponent(world.ecs, eid, Owner) ? (world.stores.owner.eid[eid] ?? -1) : -1;
killedBy: areaDamageSystem hit-once prevents re-damaging same target
statusReason: expected 20 to be 35 // Object.is equality

[Killed] EqualityOperator
src/core/systems/areaDamageSystem.ts:46:23
     const y = position.y[eid] ?? 0;
     const radius = areaDamage.radius[eid] ?? 0;
     const damage = areaDamage.damage[eid] ?? 0;
-    const isHitOnce = (areaDamage.hitOnce[eid] ?? 0) !== 0;
+    const isHitOnce = (areaDamage.hitOnce[eid] ?? 0) === 0;
     const areaTeam = hasComponent(world.ecs, eid, Team) ? (team.id[eid] ?? 0) : -1;
     const ownerEid = hasComponent(world.ecs, eid, Owner) ? (world.stores.owner.eid[eid] ?? -1) : -1;
killedBy: areaDamageSystem hit-once prevents re-damaging same target
statusReason: expected 20 to be 35 // Object.is equality

[NoCoverage] UnaryOperator
src/core/systems/areaDamageSystem.ts:47:81
     const radius = areaDamage.radius[eid] ?? 0;
     const damage = areaDamage.damage[eid] ?? 0;
     const isHitOnce = (areaDamage.hitOnce[eid] ?? 0) !== 0;
-    const areaTeam = hasComponent(world.ecs, eid, Team) ? (team.id[eid] ?? 0) : -1;
+    const areaTeam = hasComponent(world.ecs, eid, Team) ? (team.id[eid] ?? 0) : +1;
     const ownerEid = hasComponent(world.ecs, eid, Owner) ? (world.stores.owner.eid[eid] ?? -1) : -1;
     if (

[NoCoverage] UnaryOperator
src/core/systems/areaDamageSystem.ts:48:98
     const damage = areaDamage.damage[eid] ?? 0;
     const isHitOnce = (areaDamage.hitOnce[eid] ?? 0) !== 0;
     const areaTeam = hasComponent(world.ecs, eid, Team) ? (team.id[eid] ?? 0) : -1;
-    const ownerEid = hasComponent(world.ecs, eid, Owner) ? (world.stores.owner.eid[eid] ?? -1) : -1;
+    const ownerEid = hasComponent(world.ecs, eid, Owner) ? (world.stores.owner.eid[eid] ?? -1) : +1;
     if (
       ownerEid >= 0 &&

[NoCoverage] UnaryOperator
src/core/systems/areaDamageSystem.ts:48:92
     const damage = areaDamage.damage[eid] ?? 0;
     const isHitOnce = (areaDamage.hitOnce[eid] ?? 0) !== 0;
     const areaTeam = hasComponent(world.ecs, eid, Team) ? (team.id[eid] ?? 0) : -1;
-    const ownerEid = hasComponent(world.ecs, eid, Owner) ? (world.stores.owner.eid[eid] ?? -1) : -1;
+    const ownerEid = hasComponent(world.ecs, eid, Owner) ? (world.stores.owner.eid[eid] ?? +1) : -1;
     if (
       ownerEid >= 0 &&

[Survived] ConditionalExpression
src/core/systems/areaDamageSystem.ts:50:7
     const areaTeam = hasComponent(world.ecs, eid, Team) ? (team.id[eid] ?? 0) : -1;
     const ownerEid = hasComponent(world.ecs, eid, Owner) ? (world.stores.owner.eid[eid] ?? -1) : -1;
     if (
-      ownerEid >= 0 &&
-      hasComponent(world.ecs, ownerEid, Player) &&
-      isEntityInSafeSpace(world, ownerEid)
+      false
     ) {
       continue;

[NoCoverage] EqualityOperator
src/core/systems/areaDamageSystem.ts:58:37
     }
     const arcHalfRad = areaDamage.arcHalfRad[eid] ?? 0;
     const arcCenterRad = areaDamage.arcCenterRad[eid] ?? 0;
-    const isArc = arcHalfRad > 0 && arcHalfRad < Math.PI;
+    const isArc = arcHalfRad > 0 && arcHalfRad >= Math.PI;
 
     const hitSet = isHitOnce ? getHitSet(world, eid) : undefined;

[Survived] ConditionalExpression
src/core/systems/areaDamageSystem.ts:58:19
     }
     const arcHalfRad = areaDamage.arcHalfRad[eid] ?? 0;
     const arcCenterRad = areaDamage.arcCenterRad[eid] ?? 0;
-    const isArc = arcHalfRad > 0 && arcHalfRad < Math.PI;
+    const isArc = true;
 
     const hitSet = isHitOnce ? getHitSet(world, eid) : undefined;

[Killed] EqualityOperator
src/core/systems/areaDamageSystem.ts:64:35
     const candidates = collisionResult.grid.queryRadius(x, y, radius);
 
     for (const target of candidates) {
-      if (target === undefined || target === eid || !entityExists(world.ecs, target)) {
+      if (target === undefined || target !== eid || !entityExists(world.ecs, target)) {
         continue;
       }
killedBy: areaDamageSystem damages enemies within radius
statusReason: expected 50 to be 35 // Object.is equality

[Killed] EqualityOperator
src/core/systems/areaDamageSystem.ts:64:11
     const candidates = collisionResult.grid.queryRadius(x, y, radius);
 
     for (const target of candidates) {
-      if (target === undefined || target === eid || !entityExists(world.ecs, target)) {
+      if (target !== undefined || target === eid || !entityExists(world.ecs, target)) {
         continue;
       }
killedBy: areaDamageSystem damages enemies within radius
statusReason: expected 50 to be 35 // Object.is equality

[NoCoverage] BlockStatement
src/core/systems/areaDamageSystem.ts:68:53
         continue;
       }
 
-      if (!hasComponent(world.ecs, target, Health)) {
-        continue;
-      }
+      if (!hasComponent(world.ecs, target, Health)) {}
 
       // Skip same-team entities

[Killed] LogicalOperator
src/core/systems/areaDamageSystem.ts:73:11
       }
 
       // Skip same-team entities
-      if (areaTeam >= 0 && hasComponent(world.ecs, target, Team)) {
+      if (areaTeam >= 0 || hasComponent(world.ecs, target, Team)) {
         const targetTeam = team.id[target] ?? 0;
         if (targetTeam === areaTeam) {
killedBy: areaDamageSystem damages enemies within radius
statusReason: expected 50 to be 35 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/areaDamageSystem.ts:73:11
       }
 
       // Skip same-team entities
-      if (areaTeam >= 0 && hasComponent(world.ecs, target, Team)) {
+      if (true) {
         const targetTeam = team.id[target] ?? 0;
         if (targetTeam === areaTeam) {
killedBy: areaDamageSystem damages enemies within radius
statusReason: expected 50 to be 35 // Object.is equality

[NoCoverage] LogicalOperator
src/core/systems/areaDamageSystem.ts:74:28
 
       // Skip same-team entities
       if (areaTeam >= 0 && hasComponent(world.ecs, target, Team)) {
-        const targetTeam = team.id[target] ?? 0;
+        const targetTeam = team.id[target] && 0;
         if (targetTeam === areaTeam) {
           continue;

[NoCoverage] ConditionalExpression
src/core/systems/areaDamageSystem.ts:75:13
       // Skip same-team entities
       if (areaTeam >= 0 && hasComponent(world.ecs, target, Team)) {
         const targetTeam = team.id[target] ?? 0;
-        if (targetTeam === areaTeam) {
+        if (true) {
           continue;
         }

[NoCoverage] ConditionalExpression
src/core/systems/areaDamageSystem.ts:75:13
       // Skip same-team entities
       if (areaTeam >= 0 && hasComponent(world.ecs, target, Team)) {
         const targetTeam = team.id[target] ?? 0;
-        if (targetTeam === areaTeam) {
+        if (false) {
           continue;
         }

[Killed] BlockStatement
src/core/systems/areaDamageSystem.ts:81:26
       }
 
       // Skip owner
-      if (ownerEid >= 0) {
-        if (target === ownerEid) {
-          continue;
-        }
-      }
+      if (ownerEid >= 0) {}
 
       // Skip non-combatants — only damage Player or Enemy entities
killedBy: areaDamageSystem does not damage the owner
statusReason: expected 85 to be 100 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/areaDamageSystem.ts:81:11
       }
 
       // Skip owner
-      if (ownerEid >= 0) {
+      if (false) {
         if (target === ownerEid) {
           continue;
killedBy: areaDamageSystem does not damage the owner
statusReason: expected 85 to be 100 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/areaDamageSystem.ts:82:13
 
       // Skip owner
       if (ownerEid >= 0) {
-        if (target === ownerEid) {
+        if (true) {
           continue;
         }
killedBy: areaDamageSystem damages enemies within radius
statusReason: expected 50 to be 35 // Object.is equality

[Killed] EqualityOperator
src/core/systems/areaDamageSystem.ts:82:13
 
       // Skip owner
       if (ownerEid >= 0) {
-        if (target === ownerEid) {
+        if (target !== ownerEid) {
           continue;
         }
killedBy: areaDamageSystem damages enemies within radius
statusReason: expected 50 to be 35 // Object.is equality

[Killed] LogicalOperator
src/core/systems/areaDamageSystem.ts:88:11
       }
 
       // Skip non-combatants — only damage Player or Enemy entities
-      if (!hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player)) {
+      if (!hasComponent(world.ecs, target, Enemy) || !hasComponent(world.ecs, target, Player)) {
         continue;
       }
killedBy: areaDamageSystem damages enemies within radius
statusReason: expected 50 to be 35 // Object.is equality

[Killed] BooleanLiteral
src/core/systems/areaDamageSystem.ts:88:11
       }
 
       // Skip non-combatants — only damage Player or Enemy entities
-      if (!hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player)) {
+      if (hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player)) {
         continue;
       }
killedBy: areaDamageSystem damages enemies within radius
statusReason: expected 50 to be 35 // Object.is equality

[Survived] ConditionalExpression
src/core/systems/areaDamageSystem.ts:93:11
       }
 
       // Arc check: skip targets outside the swing arc
-      if (isArc) {
+      if (false) {
         const tx = (position.x[target] ?? 0) - x;
         const ty = (position.y[target] ?? 0) - y;

[Survived] ConditionalExpression
src/core/systems/areaDamageSystem.ts:93:11
       }
 
       // Arc check: skip targets outside the swing arc
-      if (isArc) {
+      if (true) {
         const tx = (position.x[target] ?? 0) - x;
         const ty = (position.y[target] ?? 0) - y;

[NoCoverage] ArithmeticOperator
src/core/systems/areaDamageSystem.ts:94:20
 
       // Arc check: skip targets outside the swing arc
       if (isArc) {
-        const tx = (position.x[target] ?? 0) - x;
+        const tx = (position.x[target] ?? 0) + x;
         const ty = (position.y[target] ?? 0) - y;
         const targetAngle = Math.atan2(ty, tx);

[NoCoverage] ArithmeticOperator
src/core/systems/areaDamageSystem.ts:95:20
       // Arc check: skip targets outside the swing arc
       if (isArc) {
         const tx = (position.x[target] ?? 0) - x;
-        const ty = (position.y[target] ?? 0) - y;
+        const ty = (position.y[target] ?? 0) + y;
         const targetAngle = Math.atan2(ty, tx);
         const delta = Math.atan2(

[NoCoverage] ArithmeticOperator
src/core/systems/areaDamageSystem.ts:98:20
         const ty = (position.y[target] ?? 0) - y;
         const targetAngle = Math.atan2(ty, tx);
         const delta = Math.atan2(
-          Math.sin(targetAngle - arcCenterRad),
+          Math.sin(targetAngle + arcCenterRad),
           Math.cos(targetAngle - arcCenterRad),
         );

[NoCoverage] ArithmeticOperator
src/core/systems/areaDamageSystem.ts:99:20
         const targetAngle = Math.atan2(ty, tx);
         const delta = Math.atan2(
           Math.sin(targetAngle - arcCenterRad),
-          Math.cos(targetAngle - arcCenterRad),
+          Math.cos(targetAngle + arcCenterRad),
         );
         if (Math.abs(delta) > arcHalfRad) {

[NoCoverage] EqualityOperator
src/core/systems/areaDamageSystem.ts:101:13
           Math.sin(targetAngle - arcCenterRad),
           Math.cos(targetAngle - arcCenterRad),
         );
-        if (Math.abs(delta) > arcHalfRad) {
+        if (Math.abs(delta) >= arcHalfRad) {
           continue;
         }

[NoCoverage] EqualityOperator
src/core/systems/areaDamageSystem.ts:101:13
           Math.sin(targetAngle - arcCenterRad),
           Math.cos(targetAngle - arcCenterRad),
         );
-        if (Math.abs(delta) > arcHalfRad) {
+        if (Math.abs(delta) <= arcHalfRad) {
           continue;
         }

[Killed] ConditionalExpression
src/core/systems/areaDamageSystem.ts:106:11
         }
       }
 
-      if (hitSet !== undefined && hitSet.has(target)) {
+      if (false) {
         continue;
       }
killedBy: areaDamageSystem hit-once prevents re-damaging same target
statusReason: expected 20 to be 35 // Object.is equality

[Killed] BlockStatement
src/core/systems/areaDamageSystem.ts:106:55
         }
       }
 
-      if (hitSet !== undefined && hitSet.has(target)) {
-        continue;
-      }
+      if (hitSet !== undefined && hitSet.has(target)) {}
 
       applyDamage(
killedBy: areaDamageSystem hit-once prevents re-damaging same target
statusReason: expected 20 to be 35 // Object.is equality

[Killed] BlockStatement
src/core/systems/areaDamageSystem.ts:121:33
         y,
       );
 
-      if (hitSet !== undefined) {
-        hitSet.add(target);
-      }
+      if (hitSet !== undefined) {}
     }
   }
killedBy: areaDamageSystem hit-once prevents re-damaging same target
statusReason: expected 20 to be 35 // Object.is equality
