[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:35:7
   const apy = py - ay;
   const abLenSq = abx * abx + aby * aby;
 
-  if (abLenSq <= 0.0001) {
+  if (false) {
     return apx * apx + apy * apy;
   }
killedBy: meleeSwingSystem coverage edges handles zero-length blade segment via shaft distance fallback
statusReason: expected 20 to be 13 // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:36:12
   const abLenSq = abx * abx + aby * aby;
 
   if (abLenSq <= 0.0001) {
-    return apx * apx + apy * apy;
+    return apx / apx + apy * apy;
   }
 
killedBy: meleeSwingSystem coverage edges handles zero-length blade segment via shaft distance fallback
statusReason: expected 20 to be 13 // Object.is equality

[Killed] MethodExpression
src/core/systems/meleeSwingSystem.ts:39:25
     return apx * apx + apy * apy;
   }
 
-  const t = Math.max(0, Math.min(1, (apx * abx + apy * aby) / abLenSq));
+  const t = Math.max(0, Math.max(1, (apx * abx + apy * aby) / abLenSq));
   const cx = ax + t * abx;
   const cy = ay + t * aby;
killedBy: melee weapons hammer shaft hit deals partial damage
statusReason: expected 100 to be less than 100

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:44:10
   const cy = ay + t * aby;
   const dx = px - cx;
   const dy = py - cy;
-  return dx * dx + dy * dy;
+  return dx * dx - dy * dy;
 }
 
killedBy: melee weapons hammer head hit deals full damage
statusReason: expected 87.5 to be 75 // Object.is equality

[Killed] BlockStatement
src/core/systems/meleeSwingSystem.ts:64:74
 }
 
 /** Clean up hit tracking for removed melee swing entities. */
-export function clearMeleeSwingHits(world: GameWorld, eid: number): void {
-  const worldHits = hitSets.get(world);
-  if (worldHits !== undefined) {
-    worldHits.delete(eid);
-  }
-}
+export function clearMeleeSwingHits(world: GameWorld, eid: number): void {}
 
 /**
killedBy: meleeSwingSystem coverage edges can hit again after clearMeleeSwingHits removes tracked targets
statusReason: expected 90 to be 80 // Object.is equality

[Survived] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:82:21
 export function meleeSwingSystem(world: GameWorld): void {
   const swings = query(world.ecs, [MeleeSwing, Position]);
   const { position, meleeSwing, team } = world.stores;
-  const hitDistSq = BLADE_HIT_HALF_WIDTH * BLADE_HIT_HALF_WIDTH;
+  const hitDistSq = BLADE_HIT_HALF_WIDTH / BLADE_HIT_HALF_WIDTH;
   const storeSize = position.x.length;
 

[Killed] BooleanLiteral
src/core/systems/meleeSwingSystem.ts:86:9
   const storeSize = position.x.length;
 
   for (const eid of swings) {
-    if (!entityExists(world.ecs, eid) || eid >= storeSize) continue;
+    if (entityExists(world.ecs, eid) || eid >= storeSize) continue;
 
     // Follow owner position
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] EqualityOperator
src/core/systems/meleeSwingSystem.ts:86:42
   const storeSize = position.x.length;
 
   for (const eid of swings) {
-    if (!entityExists(world.ecs, eid) || eid >= storeSize) continue;
+    if (!entityExists(world.ecs, eid) || eid < storeSize) continue;
 
     // Follow owner position
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:89:9
     if (!entityExists(world.ecs, eid) || eid >= storeSize) continue;
 
     // Follow owner position
-    if (hasComponent(world.ecs, eid, Owner)) {
+    if (false) {
       const ownerEid = world.stores.owner.eid[eid]!;
       if (
killedBy: melee weapons sword blade follows player position
statusReason: expected 100 to be 200 // Object.is equality

[Killed] BlockStatement
src/core/systems/meleeSwingSystem.ts:89:46
     if (!entityExists(world.ecs, eid) || eid >= storeSize) continue;
 
     // Follow owner position
-    if (hasComponent(world.ecs, eid, Owner)) {
-      const ownerEid = world.stores.owner.eid[eid]!;
-      if (
-        ownerEid >= 0 &&
-        ownerEid < storeSize &&
-        entityExists(world.ecs, ownerEid) &&
-        hasComponent(world.ecs, ownerEid, Position)
-      ) {
-        position.x[eid] = position.x[ownerEid]!;
-        position.y[eid] = position.y[ownerEid]!;
-      }
-    }
+    if (hasComponent(world.ecs, eid, Owner)) {}
 
     const px = position.x[eid]!;
killedBy: melee weapons sword blade follows player position
statusReason: expected 100 to be 200 // Object.is equality

[Killed] EqualityOperator
src/core/systems/meleeSwingSystem.ts:92:9
     if (hasComponent(world.ecs, eid, Owner)) {
       const ownerEid = world.stores.owner.eid[eid]!;
       if (
-        ownerEid >= 0 &&
+        ownerEid < 0 &&
         ownerEid < storeSize &&
         entityExists(world.ecs, ownerEid) &&
killedBy: melee weapons sword blade follows player position
statusReason: expected 100 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:92:9
     if (hasComponent(world.ecs, eid, Owner)) {
       const ownerEid = world.stores.owner.eid[eid]!;
       if (
-        ownerEid >= 0 &&
-        ownerEid < storeSize &&
-        entityExists(world.ecs, ownerEid) &&
-        hasComponent(world.ecs, ownerEid, Position)
+        true
       ) {
         position.x[eid] = position.x[ownerEid]!;
killedBy: meleeSwingSystem coverage edges keeps swing position when owner exists but has no Position component
statusReason: expected +0 to be 100 // Object.is equality

[Killed] EqualityOperator
src/core/systems/meleeSwingSystem.ts:93:9
       const ownerEid = world.stores.owner.eid[eid]!;
       if (
         ownerEid >= 0 &&
-        ownerEid < storeSize &&
+        ownerEid >= storeSize &&
         entityExists(world.ecs, ownerEid) &&
         hasComponent(world.ecs, ownerEid, Position)
killedBy: melee weapons sword blade follows player position
statusReason: expected 100 to be 200 // Object.is equality

[Survived] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:93:9
       const ownerEid = world.stores.owner.eid[eid]!;
       if (
         ownerEid >= 0 &&
-        ownerEid < storeSize &&
+        true &&
         entityExists(world.ecs, ownerEid) &&
         hasComponent(world.ecs, ownerEid, Position)

[Killed] BlockStatement
src/core/systems/meleeSwingSystem.ts:96:9
         ownerEid < storeSize &&
         entityExists(world.ecs, ownerEid) &&
         hasComponent(world.ecs, ownerEid, Position)
-      ) {
-        position.x[eid] = position.x[ownerEid]!;
-        position.y[eid] = position.y[ownerEid]!;
-      }
+      ) {}
     }
 
killedBy: melee weapons sword blade follows player position
statusReason: expected 100 to be 200 // Object.is equality

[Survived] UnaryOperator
src/core/systems/meleeSwingSystem.ts:114:76
     const headRadius = meleeSwing.headRadius[eid]!;
     const shaftDamageMult = meleeSwing.shaftDamageMult[eid]!;
     const knockback = meleeSwing.knockback[eid]!;
-    const swingTeam = hasComponent(world.ecs, eid, Team) ? team.id[eid]! : -1;
+    const swingTeam = hasComponent(world.ecs, eid, Team) ? team.id[eid]! : +1;
     const ownerEid = hasComponent(world.ecs, eid, Owner) ? world.stores.owner.eid[eid]! : -1;
     if (

[Survived] UnaryOperator
src/core/systems/meleeSwingSystem.ts:115:91
     const shaftDamageMult = meleeSwing.shaftDamageMult[eid]!;
     const knockback = meleeSwing.knockback[eid]!;
     const swingTeam = hasComponent(world.ecs, eid, Team) ? team.id[eid]! : -1;
-    const ownerEid = hasComponent(world.ecs, eid, Owner) ? world.stores.owner.eid[eid]! : -1;
+    const ownerEid = hasComponent(world.ecs, eid, Owner) ? world.stores.owner.eid[eid]! : +1;
     if (
       ownerEid >= 0 &&

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:124:21
       continue;
     }
 
-    const elapsed = world.elapsedMs - spawnAt;
+    const elapsed = world.elapsedMs + spawnAt;
     const progress = Math.min(1, Math.max(0, elapsed / duration));
 
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] MethodExpression
src/core/systems/meleeSwingSystem.ts:125:34
     }
 
     const elapsed = world.elapsedMs - spawnAt;
-    const progress = Math.min(1, Math.max(0, elapsed / duration));
+    const progress = Math.min(1, Math.min(0, elapsed / duration));
 
     let tipX: number;
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] MethodExpression
src/core/systems/meleeSwingSystem.ts:125:22
     }
 
     const elapsed = world.elapsedMs - spawnAt;
-    const progress = Math.min(1, Math.max(0, elapsed / duration));
+    const progress = Math.max(1, Math.max(0, elapsed / duration));
 
     let tipX: number;
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:130:9
     let tipX: number;
     let tipY: number;
 
-    if (style === MeleeStyle.STAB) {
+    if (false) {
       const reach =
         progress <= 0.5 ? (progress / 0.5) * bladeLength : ((1 - progress) / 0.5) * bladeLength;
killedBy: unarmed weapons punch head deals damage to enemy within reach
statusReason: expected 50 to be less than 50

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:130:9
     let tipX: number;
     let tipY: number;
 
-    if (style === MeleeStyle.STAB) {
+    if (true) {
       const reach =
         progress <= 0.5 ? (progress / 0.5) * bladeLength : ((1 - progress) / 0.5) * bladeLength;
killedBy: melee weapons hammer shaft hit deals partial damage
statusReason: expected 25 to be less than or equal to 12.5

[Killed] EqualityOperator
src/core/systems/meleeSwingSystem.ts:132:9
 
     if (style === MeleeStyle.STAB) {
       const reach =
-        progress <= 0.5 ? (progress / 0.5) * bladeLength : ((1 - progress) / 0.5) * bladeLength;
+        progress > 0.5 ? (progress / 0.5) * bladeLength : ((1 - progress) / 0.5) * bladeLength;
       tipX = px + Math.cos(arcCenter) * reach;
       tipY = py + Math.sin(arcCenter) * reach;
killedBy: unarmed weapons punch path still damages because the head overlaps shaft positions
statusReason: expected 50 to be less than 50

[Survived] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:132:27
 
     if (style === MeleeStyle.STAB) {
       const reach =
-        progress <= 0.5 ? (progress / 0.5) * bladeLength : ((1 - progress) / 0.5) * bladeLength;
+        progress <= 0.5 ? progress / 0.5 / bladeLength : ((1 - progress) / 0.5) * bladeLength;
       tipX = px + Math.cos(arcCenter) * reach;
       tipY = py + Math.sin(arcCenter) * reach;

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:133:19
     if (style === MeleeStyle.STAB) {
       const reach =
         progress <= 0.5 ? (progress / 0.5) * bladeLength : ((1 - progress) / 0.5) * bladeLength;
-      tipX = px + Math.cos(arcCenter) * reach;
+      tipX = px + Math.cos(arcCenter) / reach;
       tipY = py + Math.sin(arcCenter) * reach;
     } else {
killedBy: unarmed weapons punch head deals damage to enemy within reach
statusReason: expected 50 to be less than 50

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:133:14
     if (style === MeleeStyle.STAB) {
       const reach =
         progress <= 0.5 ? (progress / 0.5) * bladeLength : ((1 - progress) / 0.5) * bladeLength;
-      tipX = px + Math.cos(arcCenter) * reach;
+      tipX = px - Math.cos(arcCenter) * reach;
       tipY = py + Math.sin(arcCenter) * reach;
     } else {
killedBy: unarmed weapons punch head deals damage to enemy within reach
statusReason: expected 50 to be less than 50

[Survived] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:134:14
       const reach =
         progress <= 0.5 ? (progress / 0.5) * bladeLength : ((1 - progress) / 0.5) * bladeLength;
       tipX = px + Math.cos(arcCenter) * reach;
-      tipY = py + Math.sin(arcCenter) * reach;
+      tipY = py - Math.sin(arcCenter) * reach;
     } else {
       const startAngle = arcCenter + arcHalf;

[Survived] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:134:19
       const reach =
         progress <= 0.5 ? (progress / 0.5) * bladeLength : ((1 - progress) / 0.5) * bladeLength;
       tipX = px + Math.cos(arcCenter) * reach;
-      tipY = py + Math.sin(arcCenter) * reach;
+      tipY = py + Math.sin(arcCenter) / reach;
     } else {
       const startAngle = arcCenter + arcHalf;

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:136:26
       tipX = px + Math.cos(arcCenter) * reach;
       tipY = py + Math.sin(arcCenter) * reach;
     } else {
-      const startAngle = arcCenter + arcHalf;
+      const startAngle = arcCenter - arcHalf;
       const endAngle = arcCenter - arcHalf;
       const currentAngle = startAngle + (endAngle - startAngle) * progress;
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:137:24
       tipY = py + Math.sin(arcCenter) * reach;
     } else {
       const startAngle = arcCenter + arcHalf;
-      const endAngle = arcCenter - arcHalf;
+      const endAngle = arcCenter + arcHalf;
       const currentAngle = startAngle + (endAngle - startAngle) * progress;
       tipX = px + Math.cos(currentAngle) * bladeLength;
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:138:41
     } else {
       const startAngle = arcCenter + arcHalf;
       const endAngle = arcCenter - arcHalf;
-      const currentAngle = startAngle + (endAngle - startAngle) * progress;
+      const currentAngle = startAngle + (endAngle - startAngle) / progress;
       tipX = px + Math.cos(currentAngle) * bladeLength;
       tipY = py + Math.sin(currentAngle) * bladeLength;
killedBy: meleeSwingSystem coverage edges can hit again after clearMeleeSwingHits removes tracked targets
statusReason: expected 100 to be 90 // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:138:28
     } else {
       const startAngle = arcCenter + arcHalf;
       const endAngle = arcCenter - arcHalf;
-      const currentAngle = startAngle + (endAngle - startAngle) * progress;
+      const currentAngle = startAngle - (endAngle - startAngle) * progress;
       tipX = px + Math.cos(currentAngle) * bladeLength;
       tipY = py + Math.sin(currentAngle) * bladeLength;
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:139:19
       const startAngle = arcCenter + arcHalf;
       const endAngle = arcCenter - arcHalf;
       const currentAngle = startAngle + (endAngle - startAngle) * progress;
-      tipX = px + Math.cos(currentAngle) * bladeLength;
+      tipX = px + Math.cos(currentAngle) / bladeLength;
       tipY = py + Math.sin(currentAngle) * bladeLength;
     }
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:139:14
       const startAngle = arcCenter + arcHalf;
       const endAngle = arcCenter - arcHalf;
       const currentAngle = startAngle + (endAngle - startAngle) * progress;
-      tipX = px + Math.cos(currentAngle) * bladeLength;
+      tipX = px - Math.cos(currentAngle) * bladeLength;
       tipY = py + Math.sin(currentAngle) * bladeLength;
     }
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:140:19
       const endAngle = arcCenter - arcHalf;
       const currentAngle = startAngle + (endAngle - startAngle) * progress;
       tipX = px + Math.cos(currentAngle) * bladeLength;
-      tipY = py + Math.sin(currentAngle) * bladeLength;
+      tipY = py + Math.sin(currentAngle) / bladeLength;
     }
 
killedBy: melee weapons hammer shaft hit deals partial damage
statusReason: expected 25 to be less than or equal to 12.5

[Survived] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:140:14
       const endAngle = arcCenter - arcHalf;
       const currentAngle = startAngle + (endAngle - startAngle) * progress;
       tipX = px + Math.cos(currentAngle) * bladeLength;
-      tipY = py + Math.sin(currentAngle) * bladeLength;
+      tipY = py - Math.sin(currentAngle) * bladeLength;
     }
 

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:144:26
     }
 
     const hitSet = getHitSet(world, eid);
-    const headRadiusSq = headRadius * headRadius;
+    const headRadiusSq = headRadius / headRadius;
 
     // Check all Health entities for collision
killedBy: unarmed weapons punch head deals damage to enemy within reach
statusReason: expected 50 to be less than 50

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:149:11
     // Check all Health entities for collision
     const targets = query(world.ecs, [Health, Position]);
     for (const target of targets) {
-      if (target >= storeSize || target === eid || target === ownerEid) continue;
+      if (true) continue;
       if (!entityExists(world.ecs, target)) continue;
       if (!hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player))
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] LogicalOperator
src/core/systems/meleeSwingSystem.ts:149:11
     // Check all Health entities for collision
     const targets = query(world.ecs, [Health, Position]);
     for (const target of targets) {
-      if (target >= storeSize || target === eid || target === ownerEid) continue;
+      if ((target >= storeSize || target === eid) && target === ownerEid) continue;
       if (!entityExists(world.ecs, target)) continue;
       if (!hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player))
killedBy: meleeSwingSystem coverage edges does not damage the owner even when owner is in the Health query
statusReason: expected 90 to be 100 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:150:11
     const targets = query(world.ecs, [Health, Position]);
     for (const target of targets) {
       if (target >= storeSize || target === eid || target === ownerEid) continue;
-      if (!entityExists(world.ecs, target)) continue;
+      if (true) continue;
       if (!hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player))
         continue;
killedBy: meleeSwingSystem coverage edges can hit again after clearMeleeSwingHits removes tracked targets
statusReason: expected 100 to be 90 // Object.is equality

[Killed] BooleanLiteral
src/core/systems/meleeSwingSystem.ts:150:11
     const targets = query(world.ecs, [Health, Position]);
     for (const target of targets) {
       if (target >= storeSize || target === eid || target === ownerEid) continue;
-      if (!entityExists(world.ecs, target)) continue;
+      if (entityExists(world.ecs, target)) continue;
       if (!hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player))
         continue;
killedBy: meleeSwingSystem coverage edges can hit again after clearMeleeSwingHits removes tracked targets
statusReason: expected 100 to be 90 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:151:11
     for (const target of targets) {
       if (target >= storeSize || target === eid || target === ownerEid) continue;
       if (!entityExists(world.ecs, target)) continue;
-      if (!hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player))
+      if (false)
         continue;
       if (swingTeam >= 0 && hasComponent(world.ecs, target, Team)) {
killedBy: meleeSwingSystem coverage edges ignores entities that have Health+Position but are neither Enemy nor Player
statusReason: expected 30 to be 40 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:151:11
     for (const target of targets) {
       if (target >= storeSize || target === eid || target === ownerEid) continue;
       if (!entityExists(world.ecs, target)) continue;
-      if (!hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player))
+      if (true)
         continue;
       if (swingTeam >= 0 && hasComponent(world.ecs, target, Team)) {
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] EqualityOperator
src/core/systems/meleeSwingSystem.ts:153:11
       if (!entityExists(world.ecs, target)) continue;
       if (!hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player))
         continue;
-      if (swingTeam >= 0 && hasComponent(world.ecs, target, Team)) {
+      if (swingTeam < 0 && hasComponent(world.ecs, target, Team)) {
         if (target < team.id.length && team.id[target] === swingTeam) continue;
       }
killedBy: meleeSwingSystem coverage edges skips same-team targets
statusReason: expected 40 to be 50 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:153:11
       if (!entityExists(world.ecs, target)) continue;
       if (!hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player))
         continue;
-      if (swingTeam >= 0 && hasComponent(world.ecs, target, Team)) {
+      if (false) {
         if (target < team.id.length && team.id[target] === swingTeam) continue;
       }
killedBy: meleeSwingSystem coverage edges skips same-team targets
statusReason: expected 40 to be 50 // Object.is equality

[Killed] EqualityOperator
src/core/systems/meleeSwingSystem.ts:154:13
       if (!hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player))
         continue;
       if (swingTeam >= 0 && hasComponent(world.ecs, target, Team)) {
-        if (target < team.id.length && team.id[target] === swingTeam) continue;
+        if (target >= team.id.length && team.id[target] === swingTeam) continue;
       }
       if (hitSet.has(target)) continue;
killedBy: meleeSwingSystem coverage edges skips same-team targets
statusReason: expected 40 to be 50 // Object.is equality

[Killed] EqualityOperator
src/core/systems/meleeSwingSystem.ts:154:40
       if (!hasComponent(world.ecs, target, Enemy) && !hasComponent(world.ecs, target, Player))
         continue;
       if (swingTeam >= 0 && hasComponent(world.ecs, target, Team)) {
-        if (target < team.id.length && team.id[target] === swingTeam) continue;
+        if (target < team.id.length && team.id[target] !== swingTeam) continue;
       }
       if (hitSet.has(target)) continue;
killedBy: meleeSwingSystem coverage edges skips same-team targets
statusReason: expected 40 to be 50 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:156:11
       if (swingTeam >= 0 && hasComponent(world.ecs, target, Team)) {
         if (target < team.id.length && team.id[target] === swingTeam) continue;
       }
-      if (hitSet.has(target)) continue;
+      if (false) continue;
 
       const tx = position.x[target]!;
killedBy: meleeSwingSystem coverage edges can hit again after clearMeleeSwingHits removes tracked targets
statusReason: expected 80 to be 90 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:156:11
       if (swingTeam >= 0 && hasComponent(world.ecs, target, Team)) {
         if (target < team.id.length && team.id[target] === swingTeam) continue;
       }
-      if (hitSet.has(target)) continue;
+      if (true) continue;
 
       const tx = position.x[target]!;
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:163:11
 
       // Check head hit first (circle around tip)
       let hitDamage = 0;
-      if (headRadius > 0) {
+      if (false) {
         const dxHead = tx - tipX;
         const dyHead = ty - tipY;
killedBy: melee weapons hammer head hit deals full damage
statusReason: expected 87.5 to be 75 // Object.is equality

[Killed] EqualityOperator
src/core/systems/meleeSwingSystem.ts:163:11
 
       // Check head hit first (circle around tip)
       let hitDamage = 0;
-      if (headRadius > 0) {
+      if (headRadius <= 0) {
         const dxHead = tx - tipX;
         const dyHead = ty - tipY;
killedBy: melee weapons hammer head hit deals full damage
statusReason: expected 87.5 to be 75 // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:164:24
       // Check head hit first (circle around tip)
       let hitDamage = 0;
       if (headRadius > 0) {
-        const dxHead = tx - tipX;
+        const dxHead = tx + tipX;
         const dyHead = ty - tipY;
         const headDistSq = dxHead * dxHead + dyHead * dyHead;
killedBy: melee weapons hammer head hit deals full damage
statusReason: expected 87.5 to be 75 // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:165:24
       let hitDamage = 0;
       if (headRadius > 0) {
         const dxHead = tx - tipX;
-        const dyHead = ty - tipY;
+        const dyHead = ty + tipY;
         const headDistSq = dxHead * dxHead + dyHead * dyHead;
         if (headDistSq <= headRadiusSq) {
killedBy: melee weapons hammer head hit deals full damage
statusReason: expected 87.5 to be 75 // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:166:46
       if (headRadius > 0) {
         const dxHead = tx - tipX;
         const dyHead = ty - tipY;
-        const headDistSq = dxHead * dxHead + dyHead * dyHead;
+        const headDistSq = dxHead * dxHead + dyHead / dyHead;
         if (headDistSq <= headRadiusSq) {
           hitDamage = damage;
killedBy: melee weapons hammer shaft hit deals partial damage
statusReason: expected 25 to be less than or equal to 12.5

[Killed] ArithmeticOperator
src/core/systems/meleeSwingSystem.ts:166:28
       if (headRadius > 0) {
         const dxHead = tx - tipX;
         const dyHead = ty - tipY;
-        const headDistSq = dxHead * dxHead + dyHead * dyHead;
+        const headDistSq = dxHead * dxHead - dyHead * dyHead;
         if (headDistSq <= headRadiusSq) {
           hitDamage = damage;
killedBy: melee weapons hammer shaft hit deals partial damage
statusReason: expected 25 to be less than or equal to 12.5

[Killed] EqualityOperator
src/core/systems/meleeSwingSystem.ts:167:13
         const dxHead = tx - tipX;
         const dyHead = ty - tipY;
         const headDistSq = dxHead * dxHead + dyHead * dyHead;
-        if (headDistSq <= headRadiusSq) {
+        if (headDistSq > headRadiusSq) {
           hitDamage = damage;
         }
killedBy: melee weapons hammer shaft hit deals partial damage
statusReason: expected 25 to be less than or equal to 12.5

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:167:13
         const dxHead = tx - tipX;
         const dyHead = ty - tipY;
         const headDistSq = dxHead * dxHead + dyHead * dyHead;
-        if (headDistSq <= headRadiusSq) {
+        if (false) {
           hitDamage = damage;
         }
killedBy: melee weapons hammer head hit deals full damage
statusReason: expected 87.5 to be 75 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:173:11
       }
 
       // If no head hit, check shaft hit (line segment)
-      if (hitDamage === 0) {
+      if (false) {
         const segDist = pointToSegmentDistSq(tx, ty, px, py, tipX, tipY);
         if (segDist <= hitDistSq) {
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] BlockStatement
src/core/systems/meleeSwingSystem.ts:173:28
       }
 
       // If no head hit, check shaft hit (line segment)
-      if (hitDamage === 0) {
-        const segDist = pointToSegmentDistSq(tx, ty, px, py, tipX, tipY);
-        if (segDist <= hitDistSq) {
-          hitDamage = damage * shaftDamageMult;
-        }
-      }
+      if (hitDamage === 0) {}
 
       if (hitDamage > 0) {
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] ConditionalExpression
src/core/systems/meleeSwingSystem.ts:175:13
       // If no head hit, check shaft hit (line segment)
       if (hitDamage === 0) {
         const segDist = pointToSegmentDistSq(tx, ty, px, py, tipX, tipY);
-        if (segDist <= hitDistSq) {
+        if (false) {
           hitDamage = damage * shaftDamageMult;
         }
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50

[Killed] EqualityOperator
src/core/systems/meleeSwingSystem.ts:175:13
       // If no head hit, check shaft hit (line segment)
       if (hitDamage === 0) {
         const segDist = pointToSegmentDistSq(tx, ty, px, py, tipX, tipY);
-        if (segDist <= hitDistSq) {
+        if (segDist > hitDistSq) {
           hitDamage = damage * shaftDamageMult;
         }
killedBy: melee weapons sword blade hits enemy via line-segment collision
statusReason: expected 50 to be less than 50
