[Killed] BlockStatement
src/game/systems/abilitySystem.ts:29:98
   return created;
 }
 
-export function equipActiveAbility(world: GameWorld, holderEid: number, abilityId: string): void {
-  const def = getAbilityDefinition(abilityId);
-  if (def === undefined) {
-    throw new Error(`Unknown ability id: ${abilityId}`);
-  }
-  if (def.kind === 'passive') {
-    throw new Error(`Cannot equip passive ability ${abilityId} in an active slot`);
-  }
-
-  const state = getOrCreateAbilityState(world, holderEid);
-  if (state.equippedActiveAbilityIds.includes(abilityId)) {
-    return;
-  }
-  if (state.equippedActiveAbilityIds.length >= ACTIVE_ABILITY_SLOT_LIMIT) {
-    throw new Error(`Active ability slot cap reached (${ACTIVE_ABILITY_SLOT_LIMIT})`);
-  }
-  state.equippedActiveAbilityIds.push(abilityId);
-}
+export function equipActiveAbility(world: GameWorld, holderEid: number, abilityId: string): void {}
 
 export function memorizeSpell(world: GameWorld, holderEid: number, abilityId: string): void {
killedBy: abilitySystem enforces max 10 active abilities equipped
statusReason: expected [Function] to throw an error

[NoCoverage] StringLiteral
src/game/systems/abilitySystem.ts:32:21
 export function equipActiveAbility(world: GameWorld, holderEid: number, abilityId: string): void {
   const def = getAbilityDefinition(abilityId);
   if (def === undefined) {
-    throw new Error(`Unknown ability id: ${abilityId}`);
+    throw new Error(``);
   }
   if (def.kind === 'passive') {

[Killed] ConditionalExpression
src/game/systems/abilitySystem.ts:34:7
   if (def === undefined) {
     throw new Error(`Unknown ability id: ${abilityId}`);
   }
-  if (def.kind === 'passive') {
+  if (true) {
     throw new Error(`Cannot equip passive ability ${abilityId} in an active slot`);
   }
killedBy: abilitySystem enforces max 10 active abilities equipped
statusReason: expected [Function] to throw error matching /slot cap/i but got 'Cannot equip passive ability arcane-b…'

[Killed] EqualityOperator
src/game/systems/abilitySystem.ts:34:7
   if (def === undefined) {
     throw new Error(`Unknown ability id: ${abilityId}`);
   }
-  if (def.kind === 'passive') {
+  if (def.kind !== 'passive') {
     throw new Error(`Cannot equip passive ability ${abilityId} in an active slot`);
   }
killedBy: abilitySystem enforces max 10 active abilities equipped
statusReason: expected [Function] to throw error matching /slot cap/i but got 'Cannot equip passive ability arcane-b…'

[Killed] ConditionalExpression
src/game/systems/abilitySystem.ts:39:7
   }
 
   const state = getOrCreateAbilityState(world, holderEid);
-  if (state.equippedActiveAbilityIds.includes(abilityId)) {
+  if (true) {
     return;
   }
killedBy: abilitySystem enforces max 10 active abilities equipped
statusReason: expected [Function] to throw an error

[NoCoverage] BlockStatement
src/game/systems/abilitySystem.ts:39:59
   }
 
   const state = getOrCreateAbilityState(world, holderEid);
-  if (state.equippedActiveAbilityIds.includes(abilityId)) {
-    return;
-  }
+  if (state.equippedActiveAbilityIds.includes(abilityId)) {}
   if (state.equippedActiveAbilityIds.length >= ACTIVE_ABILITY_SLOT_LIMIT) {
     throw new Error(`Active ability slot cap reached (${ACTIVE_ABILITY_SLOT_LIMIT})`);

[Killed] ConditionalExpression
src/game/systems/abilitySystem.ts:42:7
   if (state.equippedActiveAbilityIds.includes(abilityId)) {
     return;
   }
-  if (state.equippedActiveAbilityIds.length >= ACTIVE_ABILITY_SLOT_LIMIT) {
+  if (false) {
     throw new Error(`Active ability slot cap reached (${ACTIVE_ABILITY_SLOT_LIMIT})`);
   }
killedBy: abilitySystem enforces max 10 active abilities equipped
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/game/systems/abilitySystem.ts:42:7
   if (state.equippedActiveAbilityIds.includes(abilityId)) {
     return;
   }
-  if (state.equippedActiveAbilityIds.length >= ACTIVE_ABILITY_SLOT_LIMIT) {
+  if (state.equippedActiveAbilityIds.length > ACTIVE_ABILITY_SLOT_LIMIT) {
     throw new Error(`Active ability slot cap reached (${ACTIVE_ABILITY_SLOT_LIMIT})`);
   }
killedBy: abilitySystem enforces max 10 active abilities equipped
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/game/systems/abilitySystem.ts:43:21
     return;
   }
   if (state.equippedActiveAbilityIds.length >= ACTIVE_ABILITY_SLOT_LIMIT) {
-    throw new Error(`Active ability slot cap reached (${ACTIVE_ABILITY_SLOT_LIMIT})`);
+    throw new Error(``);
   }
   state.equippedActiveAbilityIds.push(abilityId);
killedBy: abilitySystem enforces max 10 active abilities equipped
statusReason: expected [Function] to throw error matching /slot cap/i but got ''

[Killed] BlockStatement
src/game/systems/abilitySystem.ts:48:93
   state.equippedActiveAbilityIds.push(abilityId);
 }
 
-export function memorizeSpell(world: GameWorld, holderEid: number, abilityId: string): void {
-  const def = getAbilityDefinition(abilityId);
-  if (def === undefined) {
-    throw new Error(`Unknown ability id: ${abilityId}`);
-  }
-  if (def.kind !== 'spell') {
-    throw new Error(`Ability ${abilityId} is not a spell`);
-  }
-  equipActiveAbility(world, holderEid, abilityId);
-}
+export function memorizeSpell(world: GameWorld, holderEid: number, abilityId: string): void {}
 
 export function grantPassiveAbility(world: GameWorld, holderEid: number, abilityId: string): void {
killedBy: abilitySystem memorized spells are active abilities
statusReason: expected [] to include 'arcane-bolt'

[Killed] EqualityOperator
src/game/systems/abilitySystem.ts:53:7
   if (def === undefined) {
     throw new Error(`Unknown ability id: ${abilityId}`);
   }
-  if (def.kind !== 'spell') {
+  if (def.kind === 'spell') {
     throw new Error(`Ability ${abilityId} is not a spell`);
   }
killedBy: abilitySystem memorized spells are active abilities
statusReason: Ability arcane-bolt is not a spell

[Killed] ConditionalExpression
src/game/systems/abilitySystem.ts:53:7
   if (def === undefined) {
     throw new Error(`Unknown ability id: ${abilityId}`);
   }
-  if (def.kind !== 'spell') {
+  if (true) {
     throw new Error(`Ability ${abilityId} is not a spell`);
   }
killedBy: abilitySystem memorized spells are active abilities
statusReason: Ability arcane-bolt is not a spell

[NoCoverage] StringLiteral
src/game/systems/abilitySystem.ts:54:21
     throw new Error(`Unknown ability id: ${abilityId}`);
   }
   if (def.kind !== 'spell') {
-    throw new Error(`Ability ${abilityId} is not a spell`);
+    throw new Error(``);
   }
   equipActiveAbility(world, holderEid, abilityId);

[Killed] BlockStatement
src/game/systems/abilitySystem.ts:59:99
   equipActiveAbility(world, holderEid, abilityId);
 }
 
-export function grantPassiveAbility(world: GameWorld, holderEid: number, abilityId: string): void {
-  const def = getAbilityDefinition(abilityId);
-  if (def === undefined) {
-    throw new Error(`Unknown ability id: ${abilityId}`);
-  }
-  if (def.kind !== 'passive') {
-    throw new Error(`Ability ${abilityId} is not passive`);
-  }
-
-  const state = getOrCreateAbilityState(world, holderEid);
-  if (!state.passiveAbilityIds.includes(abilityId)) {
-    state.passiveAbilityIds.push(abilityId);
-  }
-}
+export function grantPassiveAbility(world: GameWorld, holderEid: number, abilityId: string): void {}
 
 export function queueAbilityTrigger(world: GameWorld, trigger: AbilityTriggerEvent): void {
killedBy: abilitySystem allows unlimited passive grants and applies them once through stat modifiers
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/game/systems/abilitySystem.ts:64:7
   if (def === undefined) {
     throw new Error(`Unknown ability id: ${abilityId}`);
   }
-  if (def.kind !== 'passive') {
+  if (def.kind === 'passive') {
     throw new Error(`Ability ${abilityId} is not passive`);
   }
killedBy: abilitySystem allows unlimited passive grants and applies them once through stat modifiers
statusReason: Ability veteran-instinct is not passive

[Killed] ConditionalExpression
src/game/systems/abilitySystem.ts:64:7
   if (def === undefined) {
     throw new Error(`Unknown ability id: ${abilityId}`);
   }
-  if (def.kind !== 'passive') {
+  if (true) {
     throw new Error(`Ability ${abilityId} is not passive`);
   }
killedBy: abilitySystem allows unlimited passive grants and applies them once through stat modifiers
statusReason: Ability veteran-instinct is not passive

[Killed] ConditionalExpression
src/game/systems/abilitySystem.ts:69:7
   }
 
   const state = getOrCreateAbilityState(world, holderEid);
-  if (!state.passiveAbilityIds.includes(abilityId)) {
+  if (false) {
     state.passiveAbilityIds.push(abilityId);
   }
killedBy: abilitySystem allows unlimited passive grants and applies them once through stat modifiers
statusReason: expected [] to have a length of 2 but got +0

[Killed] BooleanLiteral
src/game/systems/abilitySystem.ts:69:7
   }
 
   const state = getOrCreateAbilityState(world, holderEid);
-  if (!state.passiveAbilityIds.includes(abilityId)) {
+  if (state.passiveAbilityIds.includes(abilityId)) {
     state.passiveAbilityIds.push(abilityId);
   }
killedBy: abilitySystem allows unlimited passive grants and applies them once through stat modifiers
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/game/systems/abilitySystem.ts:74:91
   }
 }
 
-export function queueAbilityTrigger(world: GameWorld, trigger: AbilityTriggerEvent): void {
-  world.abilityTriggerEvents.push(trigger);
-}
+export function queueAbilityTrigger(world: GameWorld, trigger: AbilityTriggerEvent): void {}
 
 function triggerMatches(condition: AbilityTriggerCondition, event: AbilityTriggerEvent): boolean {
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/game/systems/abilitySystem.ts:79:7
 }
 
 function triggerMatches(condition: AbilityTriggerCondition, event: AbilityTriggerEvent): boolean {
-  if (condition.kind !== event.kind) return false;
+  if (true) return false;
 
   if (condition.kind === 'skill_usage') {
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/game/systems/abilitySystem.ts:79:7
 }
 
 function triggerMatches(condition: AbilityTriggerCondition, event: AbilityTriggerEvent): boolean {
-  if (condition.kind !== event.kind) return false;
+  if (condition.kind === event.kind) return false;
 
   if (condition.kind === 'skill_usage') {
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/game/systems/abilitySystem.ts:81:7
 function triggerMatches(condition: AbilityTriggerCondition, event: AbilityTriggerEvent): boolean {
   if (condition.kind !== event.kind) return false;
 
-  if (condition.kind === 'skill_usage') {
+  if (true) {
     if (condition.metric !== undefined && event.metric !== condition.metric) return false;
     if (condition.skillId !== undefined && event.skillId !== condition.skillId) return false;

[Survived] BlockStatement
src/game/systems/abilitySystem.ts:81:41
 function triggerMatches(condition: AbilityTriggerCondition, event: AbilityTriggerEvent): boolean {
   if (condition.kind !== event.kind) return false;
 
-  if (condition.kind === 'skill_usage') {
-    if (condition.metric !== undefined && event.metric !== condition.metric) return false;
-    if (condition.skillId !== undefined && event.skillId !== condition.skillId) return false;
-    if ((event.amount ?? 0) < (condition.minAmount ?? 0)) return false;
-  }
+  if (condition.kind === 'skill_usage') {}
 
   return true;

[Killed] LogicalOperator
src/game/systems/abilitySystem.ts:82:9
   if (condition.kind !== event.kind) return false;
 
   if (condition.kind === 'skill_usage') {
-    if (condition.metric !== undefined && event.metric !== condition.metric) return false;
+    if (condition.metric !== undefined || event.metric !== condition.metric) return false;
     if (condition.skillId !== undefined && event.skillId !== condition.skillId) return false;
     if ((event.amount ?? 0) < (condition.minAmount ?? 0)) return false;
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/game/systems/abilitySystem.ts:82:9
   if (condition.kind !== event.kind) return false;
 
   if (condition.kind === 'skill_usage') {
-    if (condition.metric !== undefined && event.metric !== condition.metric) return false;
+    if (true) return false;
     if (condition.skillId !== undefined && event.skillId !== condition.skillId) return false;
     if ((event.amount ?? 0) < (condition.minAmount ?? 0)) return false;
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/game/systems/abilitySystem.ts:83:9
 
   if (condition.kind === 'skill_usage') {
     if (condition.metric !== undefined && event.metric !== condition.metric) return false;
-    if (condition.skillId !== undefined && event.skillId !== condition.skillId) return false;
+    if (condition.skillId !== undefined || event.skillId !== condition.skillId) return false;
     if ((event.amount ?? 0) < (condition.minAmount ?? 0)) return false;
   }
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/game/systems/abilitySystem.ts:83:9
 
   if (condition.kind === 'skill_usage') {
     if (condition.metric !== undefined && event.metric !== condition.metric) return false;
-    if (condition.skillId !== undefined && event.skillId !== condition.skillId) return false;
+    if (true) return false;
     if ((event.amount ?? 0) < (condition.minAmount ?? 0)) return false;
   }
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/game/systems/abilitySystem.ts:84:9
   if (condition.kind === 'skill_usage') {
     if (condition.metric !== undefined && event.metric !== condition.metric) return false;
     if (condition.skillId !== undefined && event.skillId !== condition.skillId) return false;
-    if ((event.amount ?? 0) < (condition.minAmount ?? 0)) return false;
+    if (true) return false;
   }
 
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/game/systems/abilitySystem.ts:84:9
   if (condition.kind === 'skill_usage') {
     if (condition.metric !== undefined && event.metric !== condition.metric) return false;
     if (condition.skillId !== undefined && event.skillId !== condition.skillId) return false;
-    if ((event.amount ?? 0) < (condition.minAmount ?? 0)) return false;
+    if ((event.amount ?? 0) <= (condition.minAmount ?? 0)) return false;
   }
 
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/game/systems/abilitySystem.ts:91:75
 }
 
 export function abilitySystem(world: GameWorld): void {
-  for (const [holderEid, state] of world.abilityStatesByEntity.entries()) {
-    for (const passiveId of state.passiveAbilityIds) {
-      if (state.appliedPassiveAbilityIds.has(passiveId)) continue;
-      const def = getAbilityDefinition(passiveId);
-      if (def === undefined || def.kind !== 'passive') continue;
-
-      // Include effect index so multi-effect passives keep distinct modifier source ids.
-      def.effects.forEach((effect, i) => {
-        applyCatalogEffect(world, {
-          sourceType: 'ability',
-          sourceId: `${passiveId}:passive:${holderEid}:${i}`,
-          effect,
-        });
-      });
-
-      state.appliedPassiveAbilityIds.add(passiveId);
-    }
-  }
+  for (const [holderEid, state] of world.abilityStatesByEntity.entries()) {}
 
   for (const event of world.abilityTriggerEvents) {
killedBy: abilitySystem allows unlimited passive grants and applies them once through stat modifiers
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/game/systems/abilitySystem.ts:92:54
 
 export function abilitySystem(world: GameWorld): void {
   for (const [holderEid, state] of world.abilityStatesByEntity.entries()) {
-    for (const passiveId of state.passiveAbilityIds) {
-      if (state.appliedPassiveAbilityIds.has(passiveId)) continue;
-      const def = getAbilityDefinition(passiveId);
-      if (def === undefined || def.kind !== 'passive') continue;
-
-      // Include effect index so multi-effect passives keep distinct modifier source ids.
-      def.effects.forEach((effect, i) => {
-        applyCatalogEffect(world, {
-          sourceType: 'ability',
-          sourceId: `${passiveId}:passive:${holderEid}:${i}`,
-          effect,
-        });
-      });
-
-      state.appliedPassiveAbilityIds.add(passiveId);
-    }
+    for (const passiveId of state.passiveAbilityIds) {}
   }
 
killedBy: abilitySystem allows unlimited passive grants and applies them once through stat modifiers
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/game/systems/abilitySystem.ts:93:11
 export function abilitySystem(world: GameWorld): void {
   for (const [holderEid, state] of world.abilityStatesByEntity.entries()) {
     for (const passiveId of state.passiveAbilityIds) {
-      if (state.appliedPassiveAbilityIds.has(passiveId)) continue;
+      if (false) continue;
       const def = getAbilityDefinition(passiveId);
       if (def === undefined || def.kind !== 'passive') continue;
killedBy: abilitySystem allows unlimited passive grants and applies them once through stat modifiers
statusReason: expected [ …(4) ] to have a length of 2 but got 4

[Killed] EqualityOperator
src/game/systems/abilitySystem.ts:95:32
     for (const passiveId of state.passiveAbilityIds) {
       if (state.appliedPassiveAbilityIds.has(passiveId)) continue;
       const def = getAbilityDefinition(passiveId);
-      if (def === undefined || def.kind !== 'passive') continue;
+      if (def === undefined || def.kind === 'passive') continue;
 
       // Include effect index so multi-effect passives keep distinct modifier source ids.
killedBy: abilitySystem allows unlimited passive grants and applies them once through stat modifiers
statusReason: expected [] to have a length of 2 but got +0

[Survived] ConditionalExpression
src/game/systems/abilitySystem.ts:95:32
     for (const passiveId of state.passiveAbilityIds) {
       if (state.appliedPassiveAbilityIds.has(passiveId)) continue;
       const def = getAbilityDefinition(passiveId);
-      if (def === undefined || def.kind !== 'passive') continue;
+      if (def === undefined || false) continue;
 
       // Include effect index so multi-effect passives keep distinct modifier source ids.

[Killed] BlockStatement
src/game/systems/abilitySystem.ts:98:42
       if (def === undefined || def.kind !== 'passive') continue;
 
       // Include effect index so multi-effect passives keep distinct modifier source ids.
-      def.effects.forEach((effect, i) => {
-        applyCatalogEffect(world, {
-          sourceType: 'ability',
-          sourceId: `${passiveId}:passive:${holderEid}:${i}`,
-          effect,
-        });
-      });
+      def.effects.forEach((effect, i) => {});
 
       state.appliedPassiveAbilityIds.add(passiveId);
killedBy: abilitySystem allows unlimited passive grants and applies them once through stat modifiers
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/game/systems/abilitySystem.ts:117:61
     const state = world.abilityStatesByEntity.get(holderEid);
     if (state === undefined) continue;
 
-    for (const abilityId of state.equippedActiveAbilityIds) {
-      const def = getAbilityDefinition(abilityId);
-      if (def === undefined || def.kind === 'passive') continue;
-      if (!triggerMatches(def.trigger, event)) continue;
-
-      const lastTriggerFrame = state.cooldownByAbilityId.get(abilityId) ?? Number.NEGATIVE_INFINITY;
-      if (world.frameCount - lastTriggerFrame < def.cooldownFrames) {
-        continue;
-      }
-
-      removeStatModifiers(world, 'ability', `${abilityId}:active:${holderEid}`);
-      for (const effect of def.effects) {
-        applyCatalogEffect(world, {
-          sourceType: 'ability',
-          sourceId: `${abilityId}:active:${holderEid}`,
-          effect,
-        });
-      }
-      state.cooldownByAbilityId.set(abilityId, world.frameCount);
-    }
+    for (const abilityId of state.equippedActiveAbilityIds) {}
   }
 
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/game/systems/abilitySystem.ts:120:11
     for (const abilityId of state.equippedActiveAbilityIds) {
       const def = getAbilityDefinition(abilityId);
       if (def === undefined || def.kind === 'passive') continue;
-      if (!triggerMatches(def.trigger, event)) continue;
+      if (triggerMatches(def.trigger, event)) continue;
 
       const lastTriggerFrame = state.cooldownByAbilityId.get(abilityId) ?? Number.NEGATIVE_INFINITY;
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/game/systems/abilitySystem.ts:120:11
     for (const abilityId of state.equippedActiveAbilityIds) {
       const def = getAbilityDefinition(abilityId);
       if (def === undefined || def.kind === 'passive') continue;
-      if (!triggerMatches(def.trigger, event)) continue;
+      if (false) continue;
 
       const lastTriggerFrame = state.cooldownByAbilityId.get(abilityId) ?? Number.NEGATIVE_INFINITY;

[Killed] EqualityOperator
src/game/systems/abilitySystem.ts:123:11
       if (!triggerMatches(def.trigger, event)) continue;
 
       const lastTriggerFrame = state.cooldownByAbilityId.get(abilityId) ?? Number.NEGATIVE_INFINITY;
-      if (world.frameCount - lastTriggerFrame < def.cooldownFrames) {
+      if (world.frameCount - lastTriggerFrame >= def.cooldownFrames) {
         continue;
       }
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/game/systems/abilitySystem.ts:123:11
       if (!triggerMatches(def.trigger, event)) continue;
 
       const lastTriggerFrame = state.cooldownByAbilityId.get(abilityId) ?? Number.NEGATIVE_INFINITY;
-      if (world.frameCount - lastTriggerFrame < def.cooldownFrames) {
+      if (world.frameCount + lastTriggerFrame < def.cooldownFrames) {
         continue;
       }
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/game/systems/abilitySystem.ts:128:41
       }
 
       removeStatModifiers(world, 'ability', `${abilityId}:active:${holderEid}`);
-      for (const effect of def.effects) {
-        applyCatalogEffect(world, {
-          sourceType: 'ability',
-          sourceId: `${abilityId}:active:${holderEid}`,
-          effect,
-        });
-      }
+      for (const effect of def.effects) {}
       state.cooldownByAbilityId.set(abilityId, world.frameCount);
     }
killedBy: abilitySystem triggers active ability when conditions match and enforces cooldown
statusReason: expected +0 to be 1 // Object.is equality
