[Survived] ConditionalExpression
src/core/systems/collisionSystem.ts:17:7
 function getCollisionGrid(world: GameWorld): SpatialHashGrid {
   let grid = collisionGrids.get(world);
 
-  if (grid === undefined) {
+  if (true) {
     grid = createSpatialHashGrid();
     collisionGrids.set(world, grid);

[Killed] ArrayDeclaration
src/core/systems/collisionSystem.ts:27:37
 
 export function collisionSystem(world: GameWorld): CollisionResult {
   const grid = getCollisionGrid(world);
-  const entities = query(world.ecs, [Position, Sprite]);
+  const entities = query(world.ecs, []);
   const { position, sprite } = world.stores;
 
killedBy: enemy projectile damage enemy projectile respects player invincibility window
statusReason: expected 90 to be 80 // Object.is equality

[Killed] BlockStatement
src/core/systems/collisionSystem.ts:32:31
 
   grid.clear();
 
-  for (const eid of entities) {
-    if (eid === undefined) {
-      continue;
-    }
-
-    const x = position.x[eid] ?? 0;
-    const y = position.y[eid] ?? 0;
-    const halfWidth = (sprite.width[eid] ?? 0) * 0.5;
-    const halfHeight = (sprite.height[eid] ?? 0) * 0.5;
-
-    grid.insert(eid, x, y, halfWidth, halfHeight);
-  }
+  for (const eid of entities) {}
 
   return {
killedBy: itemPickupSystem picks up gold and adds to playerGold
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/systems/collisionSystem.ts:33:9
   grid.clear();
 
   for (const eid of entities) {
-    if (eid === undefined) {
+    if (true) {
       continue;
     }
killedBy: enemy projectile damage enemy projectile damages the player and is destroyed
statusReason: expected 100 to be 85 // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/collisionSystem.ts:39:23
 
     const x = position.x[eid] ?? 0;
     const y = position.y[eid] ?? 0;
-    const halfWidth = (sprite.width[eid] ?? 0) * 0.5;
+    const halfWidth = (sprite.width[eid] ?? 0) / 0.5;
     const halfHeight = (sprite.height[eid] ?? 0) * 0.5;
 
killedBy: ranged weapons projectile with pierce=2 survives first two hits
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/core/systems/collisionSystem.ts:40:24
     const x = position.x[eid] ?? 0;
     const y = position.y[eid] ?? 0;
     const halfWidth = (sprite.width[eid] ?? 0) * 0.5;
-    const halfHeight = (sprite.height[eid] ?? 0) * 0.5;
+    const halfHeight = (sprite.height[eid] ?? 0) / 0.5;
 
     grid.insert(eid, x, y, halfWidth, halfHeight);
