[Survived] ArrayDeclaration
src/core/systems/questSystem.ts:34:27
 // ---------------------------------------------------------------------------
 
 function findPlayer(world: GameWorld): number | undefined {
-  return query(world.ecs, [Player])[0];
+  return query(world.ecs, [])[0];
 }
 

[Killed] BooleanLiteral
src/core/systems/questSystem.ts:47:7
  */
 export function acceptQuest(world: GameWorld, questId: string): QuestState | undefined {
   const def = getQuestDef(questId);
-  if (!def) {
+  if (def) {
     return undefined;
   }
killedBy: questSystem accepts a quest and tracks the first one automatically
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:47:7
  */
 export function acceptQuest(world: GameWorld, questId: string): QuestState | undefined {
   const def = getQuestDef(questId);
-  if (!def) {
+  if (true) {
     return undefined;
   }
killedBy: floor1Scenario shopkeeper errand questline accepts both Floor 1 quests on initialization
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:51:7
     return undefined;
   }
   const existing = world.questLog.get(questId);
-  if (existing) {
+  if (true) {
     return existing;
   }
killedBy: floor1Scenario shopkeeper errand questline accepts both Floor 1 quests on initialization
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/questSystem.ts:51:17
     return undefined;
   }
   const existing = world.questLog.get(questId);
-  if (existing) {
-    return existing;
-  }
+  if (existing) {}
   const hasTracked = [...world.questLog.values()].some((q) => q.tracked && q.status === 'active');
   const state = createQuestState(questId, !hasTracked);
killedBy: questSystem is idempotent — re-accepting returns the existing state
statusReason: expected { questId: 'floor1-tutorial', …(4) } to be { questId: 'floor1-tutorial', …(4) } // Object.is equality

[Killed] MethodExpression
src/core/systems/questSystem.ts:54:22
   if (existing) {
     return existing;
   }
-  const hasTracked = [...world.questLog.values()].some((q) => q.tracked && q.status === 'active');
+  const hasTracked = [...world.questLog.values()].every(q => q.tracked && q.status === 'active');
   const state = createQuestState(questId, !hasTracked);
   world.questLog.set(questId, state);
killedBy: questSystem accepts a quest and tracks the first one automatically
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:54:63
   if (existing) {
     return existing;
   }
-  const hasTracked = [...world.questLog.values()].some((q) => q.tracked && q.status === 'active');
+  const hasTracked = [...world.questLog.values()].some((q) => false);
   const state = createQuestState(questId, !hasTracked);
   world.questLog.set(questId, state);
killedBy: questSystem accepts a quest and tracks the first one automatically
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/systems/questSystem.ts:55:43
     return existing;
   }
   const hasTracked = [...world.questLog.values()].some((q) => q.tracked && q.status === 'active');
-  const state = createQuestState(questId, !hasTracked);
+  const state = createQuestState(questId, hasTracked);
   world.questLog.set(questId, state);
   return state;
killedBy: questSystem accepts a quest and tracks the first one automatically
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/core/systems/questSystem.ts:62:46
 
 /** Active quests, in insertion order. */
 export function getActiveQuests(world: GameWorld): QuestState[] {
-  return [...world.questLog.values()].filter((q) => q.status === 'active');
+  return [...world.questLog.values()].filter(() => undefined);
 }
 
killedBy: questSystem accepts a quest and tracks the first one automatically
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/core/systems/questSystem.ts:62:53
 
 /** Active quests, in insertion order. */
 export function getActiveQuests(world: GameWorld): QuestState[] {
-  return [...world.questLog.values()].filter((q) => q.status === 'active');
+  return [...world.questLog.values()].filter((q) => q.status !== 'active');
 }
 
killedBy: questSystem accepts a quest and tracks the first one automatically
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArrowFunction
src/core/systems/questSystem.ts:67:38
 
 /** The currently-tracked active quest, if any. */
 export function getTrackedQuest(world: GameWorld): QuestState | undefined {
-  return getActiveQuests(world).find((q) => q.tracked);
+  return getActiveQuests(world).find(() => undefined);
 }
 
killedBy: questSystem setTrackedQuest focuses a single active quest
statusReason: expected undefined to be 'floor1-shopkeeper-errand' // Object.is equality

[Killed] BlockStatement
src/core/systems/questSystem.ts:71:74
 }
 
 /** Focus the tracker on a single active quest, clearing the flag on others. */
-export function setTrackedQuest(world: GameWorld, questId: string): void {
-  for (const quest of world.questLog.values()) {
-    quest.tracked = quest.questId === questId && quest.status === 'active';
-  }
-}
+export function setTrackedQuest(world: GameWorld, questId: string): void {}
 
 /** Latch a `talk` objective complete (e.g. the player spoke to an NPC). */
killedBy: questSystem setTrackedQuest focuses a single active quest
statusReason: expected 'floor1-tutorial' to be 'floor1-shopkeeper-errand' // Object.is equality

[Killed] BlockStatement
src/core/systems/questSystem.ts:72:48
 
 /** Focus the tracker on a single active quest, clearing the flag on others. */
 export function setTrackedQuest(world: GameWorld, questId: string): void {
-  for (const quest of world.questLog.values()) {
-    quest.tracked = quest.questId === questId && quest.status === 'active';
-  }
+  for (const quest of world.questLog.values()) {}
 }
 
killedBy: questSystem setTrackedQuest focuses a single active quest
statusReason: expected 'floor1-tutorial' to be 'floor1-shopkeeper-errand' // Object.is equality

[Killed] EqualityOperator
src/core/systems/questSystem.ts:73:21
 /** Focus the tracker on a single active quest, clearing the flag on others. */
 export function setTrackedQuest(world: GameWorld, questId: string): void {
   for (const quest of world.questLog.values()) {
-    quest.tracked = quest.questId === questId && quest.status === 'active';
+    quest.tracked = quest.questId !== questId && quest.status === 'active';
   }
 }
killedBy: questSystem setTrackedQuest focuses a single active quest
statusReason: expected 'floor1-tutorial' to be 'floor1-shopkeeper-errand' // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:73:21
 /** Focus the tracker on a single active quest, clearing the flag on others. */
 export function setTrackedQuest(world: GameWorld, questId: string): void {
   for (const quest of world.questLog.values()) {
-    quest.tracked = quest.questId === questId && quest.status === 'active';
+    quest.tracked = true;
   }
 }
killedBy: questSystem setTrackedQuest focuses a single active quest
statusReason: expected 'floor1-tutorial' to be 'floor1-shopkeeper-errand' // Object.is equality

[Killed] BlockStatement
src/core/systems/questSystem.ts:78:72
 }
 
 /** Latch a `talk` objective complete (e.g. the player spoke to an NPC). */
-export function notifyQuestTalk(world: GameWorld, npcId: string): void {
-  for (const quest of world.questLog.values()) {
-    if (quest.status !== 'active') {
-      continue;
-    }
-    const def = getQuestDef(quest.questId);
-    if (!def) {
-      continue;
-    }
-    for (const objective of def.objectives) {
-      if (objective.kind === 'talk' && objective.npcId === npcId) {
-        quest.done[objective.id] = true;
-      }
-    }
-  }
-}
+export function notifyQuestTalk(world: GameWorld, npcId: string): void {}
 
 /** Set the absolute progress of a `counter` objective (e.g. kill tally). */
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/questSystem.ts:79:48
 
 /** Latch a `talk` objective complete (e.g. the player spoke to an NPC). */
 export function notifyQuestTalk(world: GameWorld, npcId: string): void {
-  for (const quest of world.questLog.values()) {
-    if (quest.status !== 'active') {
-      continue;
-    }
-    const def = getQuestDef(quest.questId);
-    if (!def) {
-      continue;
-    }
-    for (const objective of def.objectives) {
-      if (objective.kind === 'talk' && objective.npcId === npcId) {
-        quest.done[objective.id] = true;
-      }
-    }
-  }
+  for (const quest of world.questLog.values()) {}
 }
 
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/systems/questSystem.ts:80:9
 /** Latch a `talk` objective complete (e.g. the player spoke to an NPC). */
 export function notifyQuestTalk(world: GameWorld, npcId: string): void {
   for (const quest of world.questLog.values()) {
-    if (quest.status !== 'active') {
+    if (quest.status === 'active') {
       continue;
     }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'not-met' to be 'awaiting-prize' // Object.is equality

[NoCoverage] BlockStatement
src/core/systems/questSystem.ts:80:36
 /** Latch a `talk` objective complete (e.g. the player spoke to an NPC). */
 export function notifyQuestTalk(world: GameWorld, npcId: string): void {
   for (const quest of world.questLog.values()) {
-    if (quest.status !== 'active') {
-      continue;
-    }
+    if (quest.status !== 'active') {}
     const def = getQuestDef(quest.questId);
     if (!def) {

[Killed] BlockStatement
src/core/systems/questSystem.ts:87:45
     if (!def) {
       continue;
     }
-    for (const objective of def.objectives) {
-      if (objective.kind === 'talk' && objective.npcId === npcId) {
-        quest.done[objective.id] = true;
-      }
-    }
+    for (const objective of def.objectives) {}
   }
 }
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/questSystem.ts:88:67
       continue;
     }
     for (const objective of def.objectives) {
-      if (objective.kind === 'talk' && objective.npcId === npcId) {
-        quest.done[objective.id] = true;
-      }
+      if (objective.kind === 'talk' && objective.npcId === npcId) {}
     }
   }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'not-met' to be 'awaiting-prize' // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:88:11
       continue;
     }
     for (const objective of def.objectives) {
-      if (objective.kind === 'talk' && objective.npcId === npcId) {
+      if (false) {
         quest.done[objective.id] = true;
       }
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/systems/questSystem.ts:89:36
     }
     for (const objective of def.objectives) {
       if (objective.kind === 'talk' && objective.npcId === npcId) {
-        quest.done[objective.id] = true;
+        quest.done[objective.id] = false;
       }
     }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'not-met' to be 'awaiting-prize' // Object.is equality

[Killed] BlockStatement
src/core/systems/questSystem.ts:101:9
   questId: string,
   objectiveId: string,
   value: number,
-): void {
-  const quest = world.questLog.get(questId);
-  if (!quest) {
-    return;
-  }
-  quest.progress[objectiveId] = Math.max(0, Math.floor(value));
-}
+): void {}
 
 // ---------------------------------------------------------------------------
killedBy: questSystem completes the counter-based tutorial quest and sets its goal flag
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/core/systems/questSystem.ts:106:33
   if (!quest) {
     return;
   }
-  quest.progress[objectiveId] = Math.max(0, Math.floor(value));
+  quest.progress[objectiveId] = Math.min(0, Math.floor(value));
 }
 
killedBy: questSystem completes the counter-based tutorial quest and sets its goal flag
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:132:5
 ): { current: number; target: number } {
   const target = objectiveTarget(objective);
   switch (objective.kind) {
-    case 'counter':
-      return { current: quest.progress[objective.id] ?? 0, target };
+    case 'counter':
     case 'collect': {
       if (quest.done[objective.id] === true) {
killedBy: questSystem completes the counter-based tutorial quest and sets its goal flag
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:134:5
   switch (objective.kind) {
     case 'counter':
       return { current: quest.progress[objective.id] ?? 0, target };
-    case 'collect': {
-      if (quest.done[objective.id] === true) {
-        return { current: target, target };
-      }
-      const bag = playerEid === undefined ? undefined : world.inventories.get(playerEid);
-      const current = bag && objective.itemId ? getItemCount(bag, objective.itemId) : 0;
-      return { current, target };
-    }
+    case 'collect':
     case 'talk':
     case 'goal':
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/systems/questSystem.ts:135:11
     case 'counter':
       return { current: quest.progress[objective.id] ?? 0, target };
     case 'collect': {
-      if (quest.done[objective.id] === true) {
+      if (quest.done[objective.id] !== true) {
         return { current: target, target };
       }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'complete' // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:135:11
     case 'counter':
       return { current: quest.progress[objective.id] ?? 0, target };
     case 'collect': {
-      if (quest.done[objective.id] === true) {
+      if (false) {
         return { current: target, target };
       }
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/core/systems/questSystem.ts:143:5
       return { current, target };
     }
     case 'talk':
-    case 'goal':
-      return { current: isLatchedComplete(world, quest, objective, playerEid) ? 1 : 0, target: 1 };
+    case 'goal':
     case 'haveEquippable':
     case 'equip':

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:146:5
     case 'goal':
       return { current: isLatchedComplete(world, quest, objective, playerEid) ? 1 : 0, target: 1 };
     case 'haveEquippable':
-    case 'equip':
-      return { current: isLatchedComplete(world, quest, objective, playerEid) ? 1 : 0, target: 1 };
+    case 'equip':
     default:
       return { current: 0, target };
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'complete' // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:160:5
   playerEid: number | undefined,
 ): boolean {
   switch (objective.kind) {
-    case 'talk':
-      return quest.done[objective.id] === true;
+    case 'talk':
     case 'goal':
       return objective.goalId ? world.goalFlags.get(objective.goalId) === true : false;
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'complete' // Object.is equality

[Killed] BooleanLiteral
src/core/systems/questSystem.ts:161:43
 ): boolean {
   switch (objective.kind) {
     case 'talk':
-      return quest.done[objective.id] === true;
+      return quest.done[objective.id] === false;
     case 'goal':
       return objective.goalId ? world.goalFlags.get(objective.goalId) === true : false;
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'complete' // Object.is equality

[Killed] EqualityOperator
src/core/systems/questSystem.ts:161:14
 ): boolean {
   switch (objective.kind) {
     case 'talk':
-      return quest.done[objective.id] === true;
+      return quest.done[objective.id] !== true;
     case 'goal':
       return objective.goalId ? world.goalFlags.get(objective.goalId) === true : false;
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'complete' // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:162:5
   switch (objective.kind) {
     case 'talk':
       return quest.done[objective.id] === true;
-    case 'goal':
-      return objective.goalId ? world.goalFlags.get(objective.goalId) === true : false;
+    case 'goal':
     case 'haveEquippable': {
       if (quest.done[objective.id] === true) {
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'complete' // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:163:33
     case 'talk':
       return quest.done[objective.id] === true;
     case 'goal':
-      return objective.goalId ? world.goalFlags.get(objective.goalId) === true : false;
+      return objective.goalId ? true : false;
     case 'haveEquippable': {
       if (quest.done[objective.id] === true) {
killedBy: questSystem hides multistep objectives beyond the first incomplete one
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/systems/questSystem.ts:163:75
     case 'talk':
       return quest.done[objective.id] === true;
     case 'goal':
-      return objective.goalId ? world.goalFlags.get(objective.goalId) === true : false;
+      return objective.goalId ? world.goalFlags.get(objective.goalId) === false : false;
     case 'haveEquippable': {
       if (quest.done[objective.id] === true) {
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:164:5
       return quest.done[objective.id] === true;
     case 'goal':
       return objective.goalId ? world.goalFlags.get(objective.goalId) === true : false;
-    case 'haveEquippable': {
-      if (quest.done[objective.id] === true) {
-        return true;
-      }
-      const bag = playerEid === undefined ? undefined : world.inventories.get(playerEid);
-      if (!bag) {
-        return false;
-      }
-      return getEquippableItemIds().some((itemId) => hasItem(bag, itemId));
-    }
+    case 'haveEquippable':
     case 'equip': {
       if (playerEid === undefined) {
killedBy: questSystem keeps the haveEquippable step latched once satisfied (equip removes the item)
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/questSystem.ts:165:46
     case 'goal':
       return objective.goalId ? world.goalFlags.get(objective.goalId) === true : false;
     case 'haveEquippable': {
-      if (quest.done[objective.id] === true) {
-        return true;
-      }
+      if (quest.done[objective.id] === true) {}
       const bag = playerEid === undefined ? undefined : world.inventories.get(playerEid);
       if (!bag) {
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/systems/questSystem.ts:165:40
     case 'goal':
       return objective.goalId ? world.goalFlags.get(objective.goalId) === true : false;
     case 'haveEquippable': {
-      if (quest.done[objective.id] === true) {
+      if (quest.done[objective.id] === false) {
         return true;
       }
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/systems/questSystem.ts:166:16
       return objective.goalId ? world.goalFlags.get(objective.goalId) === true : false;
     case 'haveEquippable': {
       if (quest.done[objective.id] === true) {
-        return true;
+        return false;
       }
       const bag = playerEid === undefined ? undefined : world.inventories.get(playerEid);
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/core/systems/questSystem.ts:170:16
       }
       const bag = playerEid === undefined ? undefined : world.inventories.get(playerEid);
       if (!bag) {
-        return false;
+        return true;
       }
       return getEquippableItemIds().some((itemId) => hasItem(bag, itemId));

[Killed] ArrowFunction
src/core/systems/questSystem.ts:172:42
       if (!bag) {
         return false;
       }
-      return getEquippableItemIds().some((itemId) => hasItem(bag, itemId));
+      return getEquippableItemIds().some(() => undefined);
     }
     case 'equip': {
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'complete' // Object.is equality

[Survived] MethodExpression
src/core/systems/questSystem.ts:172:14
       if (!bag) {
         return false;
       }
-      return getEquippableItemIds().some((itemId) => hasItem(bag, itemId));
+      return getEquippableItemIds().every(itemId => hasItem(bag, itemId));
     }
     case 'equip': {

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:174:5
       }
       return getEquippableItemIds().some((itemId) => hasItem(bag, itemId));
     }
-    case 'equip': {
-      if (playerEid === undefined) {
-        return false;
-      }
-      const state = getEquipmentState(world, playerEid);
-      if (!state) {
-        return false;
-      }
-      for (const instanceId of Object.values(state.equipped)) {
-        if (instanceId === null) {
-          continue;
-        }
-        const inst = state.instances.get(instanceId);
-        if (inst && (!objective.equipmentId || inst.def.id === objective.equipmentId)) {
-          return true;
-        }
-      }
-      return false;
-    }
+    case 'equip':
     default:
       return false;
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/core/systems/questSystem.ts:176:16
     }
     case 'equip': {
       if (playerEid === undefined) {
-        return false;
+        return true;
       }
       const state = getEquipmentState(world, playerEid);

[Killed] BooleanLiteral
src/core/systems/questSystem.ts:180:16
       }
       const state = getEquipmentState(world, playerEid);
       if (!state) {
-        return false;
+        return true;
       }
       for (const instanceId of Object.values(state.equipped)) {
killedBy: questSystem hides multistep objectives beyond the first incomplete one
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/questSystem.ts:182:63
       if (!state) {
         return false;
       }
-      for (const instanceId of Object.values(state.equipped)) {
-        if (instanceId === null) {
-          continue;
-        }
-        const inst = state.instances.get(instanceId);
-        if (inst && (!objective.equipmentId || inst.def.id === objective.equipmentId)) {
-          return true;
-        }
-      }
+      for (const instanceId of Object.values(state.equipped)) {}
       return false;
     }
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/systems/questSystem.ts:187:48
           continue;
         }
         const inst = state.instances.get(instanceId);
-        if (inst && (!objective.equipmentId || inst.def.id === objective.equipmentId)) {
+        if (inst && (!objective.equipmentId || inst.def.id !== objective.equipmentId)) {
           return true;
         }
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/systems/questSystem.ts:187:22
           continue;
         }
         const inst = state.instances.get(instanceId);
-        if (inst && (!objective.equipmentId || inst.def.id === objective.equipmentId)) {
+        if (inst && (!objective.equipmentId && inst.def.id === objective.equipmentId)) {
           return true;
         }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'complete' // Object.is equality

[Killed] BooleanLiteral
src/core/systems/questSystem.ts:188:18
         }
         const inst = state.instances.get(instanceId);
         if (inst && (!objective.equipmentId || inst.def.id === objective.equipmentId)) {
-          return true;
+          return false;
         }
       }
killedBy: questSystem advances the shopkeeper errand through every step to completion
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/systems/questSystem.ts:205:10
   playerEid: number | undefined,
 ): boolean {
   const { current, target } = objectiveProgress(world, quest, objective, playerEid);
-  return current >= target;
+  return current < target;
 }
 
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'complete' // Object.is equality

[Killed] EqualityOperator
src/core/systems/questSystem.ts:205:10
   playerEid: number | undefined,
 ): boolean {
   const { current, target } = objectiveProgress(world, quest, objective, playerEid);
-  return current >= target;
+  return current > target;
 }
 
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'complete' // Object.is equality

[Survived] LogicalOperator
src/core/systems/questSystem.ts:222:26
   if (!def) {
     return [];
   }
-  const resolvedPlayer = playerEid ?? findPlayer(world);
+  const resolvedPlayer = playerEid && findPlayer(world);
   const views: QuestObjectiveView[] = [];
   let firstIncompleteSeen = false;

[Killed] BooleanLiteral
src/core/systems/questSystem.ts:224:29
   }
   const resolvedPlayer = playerEid ?? findPlayer(world);
   const views: QuestObjectiveView[] = [];
-  let firstIncompleteSeen = false;
+  let firstIncompleteSeen = true;
   for (const objective of def.objectives) {
     const { current, target } = objectiveProgress(world, quest, objective, resolvedPlayer);
killedBy: questSystem hides multistep objectives beyond the first incomplete one
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/questSystem.ts:225:43
   const resolvedPlayer = playerEid ?? findPlayer(world);
   const views: QuestObjectiveView[] = [];
   let firstIncompleteSeen = false;
-  for (const objective of def.objectives) {
-    const { current, target } = objectiveProgress(world, quest, objective, resolvedPlayer);
-    const complete = current >= target;
-    const active = !complete && !firstIncompleteSeen;
-    const hidden = !complete && firstIncompleteSeen;
-    if (!complete) {
-      firstIncompleteSeen = true;
-    }
-    views.push({ def: objective, current, target, complete, active, hidden });
-  }
+  for (const objective of def.objectives) {}
   return views;
 }
killedBy: questSystem hides multistep objectives beyond the first incomplete one
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/core/systems/questSystem.ts:227:22
   let firstIncompleteSeen = false;
   for (const objective of def.objectives) {
     const { current, target } = objectiveProgress(world, quest, objective, resolvedPlayer);
-    const complete = current >= target;
+    const complete = true;
     const active = !complete && !firstIncompleteSeen;
     const hidden = !complete && firstIncompleteSeen;
killedBy: questSystem hides multistep objectives beyond the first incomplete one
statusReason: expected false to be true // Object.is equality
