[Survived] ArrayDeclaration
src/core/systems/statSystem.ts:23:37
  * Safe to call every frame — idempotent, deterministic.
  */
 export function statSystem(world: GameWorld): void {
-  const entities = query(world.ecs, [Equipment, BaseStats, EffectiveStats]);
+  const entities = query(world.ecs, []);
   const stores = world.stores;
 

[Killed] BlockStatement
src/core/systems/statSystem.ts:28:40
 
   for (const entity of entities) {
     // Start from base
-    for (const statId of ALL_STAT_IDS) {
-      stores.effectiveStats[statId][entity] = stores.baseStats[statId][entity] ?? 0;
-    }
+    for (const statId of ALL_STAT_IDS) {}
 
     // Add equipment bonuses (unique instances only)
killedBy: Equipment System does not double-count stats on repeated recompute
statusReason: expected 15 to be 5 // Object.is equality

[Killed] BlockStatement
src/core/systems/statSystem.ts:34:18
 
     // Add equipment bonuses (unique instances only)
     const eqState = getEquipmentState(world, entity);
-    if (eqState) {
-      const seenInstances = new Set<EquipmentInstanceId>();
-      for (const slotId of Object.keys(eqState.equipped)) {
-        const instId = eqState.equipped[slotId] ?? null;
-        if (instId === null || seenInstances.has(instId)) continue;
-        seenInstances.add(instId);
-        const inst = eqState.instances.get(instId);
-        if (!inst) continue;
-        for (const [stat, bonus] of Object.entries(inst.def.statBonuses)) {
-          if (typeof bonus === 'number' && isValidStatId(stat)) {
-            stores.effectiveStats[stat][entity] =
-              (stores.effectiveStats[stat][entity] ?? 0) + bonus;
-          }
-        }
-      }
-    }
+    if (eqState) {}
 
     // Clamp
killedBy: Equipment System does not double-count stats on repeated recompute
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BlockStatement
src/core/systems/statSystem.ts:36:59
     const eqState = getEquipmentState(world, entity);
     if (eqState) {
       const seenInstances = new Set<EquipmentInstanceId>();
-      for (const slotId of Object.keys(eqState.equipped)) {
-        const instId = eqState.equipped[slotId] ?? null;
-        if (instId === null || seenInstances.has(instId)) continue;
-        seenInstances.add(instId);
-        const inst = eqState.instances.get(instId);
-        if (!inst) continue;
-        for (const [stat, bonus] of Object.entries(inst.def.statBonuses)) {
-          if (typeof bonus === 'number' && isValidStatId(stat)) {
-            stores.effectiveStats[stat][entity] =
-              (stores.effectiveStats[stat][entity] ?? 0) + bonus;
-          }
-        }
-      }
+      for (const slotId of Object.keys(eqState.equipped)) {}
     }
 
killedBy: Equipment System does not double-count stats on repeated recompute
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BlockStatement
src/core/systems/statSystem.ts:42:75
         seenInstances.add(instId);
         const inst = eqState.instances.get(instId);
         if (!inst) continue;
-        for (const [stat, bonus] of Object.entries(inst.def.statBonuses)) {
-          if (typeof bonus === 'number' && isValidStatId(stat)) {
-            stores.effectiveStats[stat][entity] =
-              (stores.effectiveStats[stat][entity] ?? 0) + bonus;
-          }
-        }
+        for (const [stat, bonus] of Object.entries(inst.def.statBonuses)) {}
       }
     }
killedBy: Equipment System does not double-count stats on repeated recompute
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BlockStatement
src/core/systems/statSystem.ts:43:65
         const inst = eqState.instances.get(instId);
         if (!inst) continue;
         for (const [stat, bonus] of Object.entries(inst.def.statBonuses)) {
-          if (typeof bonus === 'number' && isValidStatId(stat)) {
-            stores.effectiveStats[stat][entity] =
-              (stores.effectiveStats[stat][entity] ?? 0) + bonus;
-          }
+          if (typeof bonus === 'number' && isValidStatId(stat)) {}
         }
       }
killedBy: Equipment System does not double-count stats on repeated recompute
statusReason: expected +0 to be 5 // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/statSystem.ts:45:15
         for (const [stat, bonus] of Object.entries(inst.def.statBonuses)) {
           if (typeof bonus === 'number' && isValidStatId(stat)) {
             stores.effectiveStats[stat][entity] =
-              (stores.effectiveStats[stat][entity] ?? 0) + bonus;
+              (stores.effectiveStats[stat][entity] ?? 0) - bonus;
           }
         }
killedBy: Equipment System does not double-count stats on repeated recompute
statusReason: expected +0 to be 5 // Object.is equality

[Survived] BlockStatement
src/core/systems/statSystem.ts:52:40
     }
 
     // Clamp
-    for (const statId of ALL_STAT_IDS) {
-      stores.effectiveStats[statId][entity] = clampStat(
-        statId,
-        stores.effectiveStats[statId][entity] ?? 0,
-      );
-    }
+    for (const statId of ALL_STAT_IDS) {}
   }
 }
