[Killed] BlockStatement
src/core/systems/lifetimeSystem.ts:10:56
 import type { GameWorld } from '../world.js';
 
 /** Removes entities whose Lifetime.expiresAtMs has passed. */
-export function lifetimeSystem(world: GameWorld): void {
-  const entities = query(world.ecs, [Lifetime]);
-
-  for (const eid of entities) {
-    if (eid === undefined || !entityExists(world.ecs, eid)) {
-      continue;
-    }
-
-    const expiresAt = world.stores.lifetime.expiresAtMs[eid] ?? 0;
-
-    if (world.elapsedMs >= expiresAt) {
-      clearAreaDamageHits(world, eid);
-      clearMeleeSwingHits(world, eid);
-      clearProjectilePierceHits(world, eid);
-      clearEntityStores(world, eid);
-      removeEntity(world.ecs, eid);
-    }
-  }
-}
+export function lifetimeSystem(world: GameWorld): void {}
 
killedBy: lifetimeSystem removes entities past their expiry time
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/core/systems/lifetimeSystem.ts:13:31
 export function lifetimeSystem(world: GameWorld): void {
   const entities = query(world.ecs, [Lifetime]);
 
-  for (const eid of entities) {
-    if (eid === undefined || !entityExists(world.ecs, eid)) {
-      continue;
-    }
-
-    const expiresAt = world.stores.lifetime.expiresAtMs[eid] ?? 0;
-
-    if (world.elapsedMs >= expiresAt) {
-      clearAreaDamageHits(world, eid);
-      clearMeleeSwingHits(world, eid);
-      clearProjectilePierceHits(world, eid);
-      clearEntityStores(world, eid);
-      removeEntity(world.ecs, eid);
-    }
-  }
+  for (const eid of entities) {}
 }
 
killedBy: lifetimeSystem removes entities past their expiry time
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/systems/lifetimeSystem.ts:14:9
   const entities = query(world.ecs, [Lifetime]);
 
   for (const eid of entities) {
-    if (eid === undefined || !entityExists(world.ecs, eid)) {
+    if (true) {
       continue;
     }
killedBy: lifetimeSystem removes entities past their expiry time
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/systems/lifetimeSystem.ts:14:9
   const entities = query(world.ecs, [Lifetime]);
 
   for (const eid of entities) {
-    if (eid === undefined || !entityExists(world.ecs, eid)) {
+    if (eid !== undefined || !entityExists(world.ecs, eid)) {
       continue;
     }
killedBy: lifetimeSystem removes entities past their expiry time
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/systems/lifetimeSystem.ts:20:9
 
     const expiresAt = world.stores.lifetime.expiresAtMs[eid] ?? 0;
 
-    if (world.elapsedMs >= expiresAt) {
+    if (world.elapsedMs > expiresAt) {
       clearAreaDamageHits(world, eid);
       clearMeleeSwingHits(world, eid);
killedBy: lifetimeSystem removes entities past their expiry time
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/systems/lifetimeSystem.ts:20:9
 
     const expiresAt = world.stores.lifetime.expiresAtMs[eid] ?? 0;
 
-    if (world.elapsedMs >= expiresAt) {
+    if (true) {
       clearAreaDamageHits(world, eid);
       clearMeleeSwingHits(world, eid);
killedBy: lifetimeSystem removes entities past their expiry time
statusReason: expected false to be true // Object.is equality
