[Killed] ConditionalExpression
src/core/systems/returningProjectileSystem.ts:17:9
   const storeSize = position.x.length;
 
   for (const eid of entities) {
-    if (!entityExists(world.ecs, eid) || eid >= storeSize) {
+    if (true) {
       continue;
     }
killedBy: returningProjectileSystem coverage edges despawns returning projectile when owner entity is missing
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/systems/returningProjectileSystem.ts:17:9
   const storeSize = position.x.length;
 
   for (const eid of entities) {
-    if (!entityExists(world.ecs, eid) || eid >= storeSize) {
+    if (entityExists(world.ecs, eid) || eid >= storeSize) {
       continue;
     }
killedBy: returningProjectileSystem coverage edges despawns returning projectile when owner entity is missing
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/systems/returningProjectileSystem.ts:21:25
       continue;
     }
 
-    const isReturning = returning.isReturning[eid] !== 0;
+    const isReturning = returning.isReturning[eid] === 0;
     const ownerEid = hasComponent(world.ecs, eid, Owner) ? owner.eid[eid]! : -1;
 
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/returningProjectileSystem.ts:21:25
       continue;
     }
 
-    const isReturning = returning.isReturning[eid] !== 0;
+    const isReturning = true;
     const ownerEid = hasComponent(world.ecs, eid, Owner) ? owner.eid[eid]! : -1;
 
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Survived] UnaryOperator
src/core/systems/returningProjectileSystem.ts:22:78
     }
 
     const isReturning = returning.isReturning[eid] !== 0;
-    const ownerEid = hasComponent(world.ecs, eid, Owner) ? owner.eid[eid]! : -1;
+    const ownerEid = hasComponent(world.ecs, eid, Owner) ? owner.eid[eid]! : +1;
 
     if (!isReturning) {

[Killed] ConditionalExpression
src/core/systems/returningProjectileSystem.ts:24:9
     const isReturning = returning.isReturning[eid] !== 0;
     const ownerEid = hasComponent(world.ecs, eid, Owner) ? owner.eid[eid]! : -1;
 
-    if (!isReturning) {
+    if (false) {
       // Check if projectile has exceeded max range
       const originX = returning.originX[eid]!;
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/core/systems/returningProjectileSystem.ts:24:9
     const isReturning = returning.isReturning[eid] !== 0;
     const ownerEid = hasComponent(world.ecs, eid, Owner) ? owner.eid[eid]! : -1;
 
-    if (!isReturning) {
+    if (isReturning) {
       // Check if projectile has exceeded max range
       const originX = returning.originX[eid]!;
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ArithmeticOperator
src/core/systems/returningProjectileSystem.ts:30:18
       const originY = returning.originY[eid]!;
       const x = position.x[eid]!;
       const y = position.y[eid]!;
-      const dx = x - originX;
+      const dx = x + originX;
       const dy = y - originY;
       const distSq = dx * dx + dy * dy;

[Killed] ArithmeticOperator
src/core/systems/returningProjectileSystem.ts:32:32
       const y = position.y[eid]!;
       const dx = x - originX;
       const dy = y - originY;
-      const distSq = dx * dx + dy * dy;
+      const distSq = dx * dx + dy / dy;
       const maxRange = returning.maxRange[eid]!;
 
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/returningProjectileSystem.ts:35:21
       const distSq = dx * dx + dy * dy;
       const maxRange = returning.maxRange[eid]!;
 
-      if (distSq >= maxRange * maxRange) {
+      if (distSq >= maxRange / maxRange) {
         // Start returning with infinite pierce on inbound leg
         returning.isReturning[eid] = 1;
killedBy: returningProjectileSystem coverage edges does not switch to returning before max range is reached
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/systems/returningProjectileSystem.ts:35:42
       const distSq = dx * dx + dy * dy;
       const maxRange = returning.maxRange[eid]!;
 
-      if (distSq >= maxRange * maxRange) {
-        // Start returning with infinite pierce on inbound leg
-        returning.isReturning[eid] = 1;
-        if (hasComponent(world.ecs, eid, Projectile)) {
-          world.stores.projectile.pierce[eid] = 255;
-          world.stores.projectile.hitCount[eid] = 0;
-          clearProjectilePierceHits(world, eid);
-        }
-      }
+      if (distSq >= maxRange * maxRange) {}
     }
 
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/systems/returningProjectileSystem.ts:38:55
       if (distSq >= maxRange * maxRange) {
         // Start returning with infinite pierce on inbound leg
         returning.isReturning[eid] = 1;
-        if (hasComponent(world.ecs, eid, Projectile)) {
-          world.stores.projectile.pierce[eid] = 255;
-          world.stores.projectile.hitCount[eid] = 0;
-          clearProjectilePierceHits(world, eid);
-        }
+        if (hasComponent(world.ecs, eid, Projectile)) {}
       }
     }
killedBy: returningProjectileSystem coverage edges restores inbound infinite pierce and clears hit count when turning back
statusReason: expected +0 to be 255 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/returningProjectileSystem.ts:38:13
       if (distSq >= maxRange * maxRange) {
         // Start returning with infinite pierce on inbound leg
         returning.isReturning[eid] = 1;
-        if (hasComponent(world.ecs, eid, Projectile)) {
+        if (false) {
           world.stores.projectile.pierce[eid] = 255;
           world.stores.projectile.hitCount[eid] = 0;
killedBy: returningProjectileSystem coverage edges restores inbound infinite pierce and clears hit count when turning back
statusReason: expected +0 to be 255 // Object.is equality

[Killed] ConditionalExpression
src/core/systems/returningProjectileSystem.ts:46:9
       }
     }
 
-    if (returning.isReturning[eid] !== 0) {
+    if (true) {
       // Owner dead/missing? Despawn.
       if (
killedBy: returningProjectileSystem coverage edges does not switch to returning before max range is reached
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/systems/returningProjectileSystem.ts:46:9
       }
     }
 
-    if (returning.isReturning[eid] !== 0) {
+    if (false) {
       // Owner dead/missing? Despawn.
       if (
killedBy: returningProjectileSystem coverage edges despawns returning projectile when owner entity is missing
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/systems/returningProjectileSystem.ts:49:9
     if (returning.isReturning[eid] !== 0) {
       // Owner dead/missing? Despawn.
       if (
-        ownerEid < 0 ||
-        ownerEid >= storeSize ||
-        !entityExists(world.ecs, ownerEid) ||
-        !hasComponent(world.ecs, ownerEid, Position)
+        true
       ) {
         clearEntityStores(world, eid);
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/core/systems/returningProjectileSystem.ts:49:9
     if (returning.isReturning[eid] !== 0) {
       // Owner dead/missing? Despawn.
       if (
-        ownerEid < 0 ||
+        ownerEid >= 0 ||
         ownerEid >= storeSize ||
         !entityExists(world.ecs, ownerEid) ||
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/core/systems/returningProjectileSystem.ts:50:9
       // Owner dead/missing? Despawn.
       if (
         ownerEid < 0 ||
-        ownerEid >= storeSize ||
+        ownerEid < storeSize ||
         !entityExists(world.ecs, ownerEid) ||
         !hasComponent(world.ecs, ownerEid, Position)
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/core/systems/returningProjectileSystem.ts:50:9
       // Owner dead/missing? Despawn.
       if (
         ownerEid < 0 ||
-        ownerEid >= storeSize ||
+        false ||
         !entityExists(world.ecs, ownerEid) ||
         !hasComponent(world.ecs, ownerEid, Position)

[Killed] BooleanLiteral
src/core/systems/returningProjectileSystem.ts:51:9
       if (
         ownerEid < 0 ||
         ownerEid >= storeSize ||
-        !entityExists(world.ecs, ownerEid) ||
+        entityExists(world.ecs, ownerEid) ||
         !hasComponent(world.ecs, ownerEid, Position)
       ) {
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/core/systems/returningProjectileSystem.ts:52:9
         ownerEid < 0 ||
         ownerEid >= storeSize ||
         !entityExists(world.ecs, ownerEid) ||
-        !hasComponent(world.ecs, ownerEid, Position)
+        hasComponent(world.ecs, ownerEid, Position)
       ) {
         clearEntityStores(world, eid);
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/systems/returningProjectileSystem.ts:53:9
         ownerEid >= storeSize ||
         !entityExists(world.ecs, ownerEid) ||
         !hasComponent(world.ecs, ownerEid, Position)
-      ) {
-        clearEntityStores(world, eid);
-        removeEntity(world.ecs, eid);
-        continue;
-      }
+      ) {}
 
       const x = position.x[eid]!;
killedBy: returningProjectileSystem coverage edges despawns returning projectile without Owner component
statusReason: expected true to be false // Object.is equality

[Survived] ArithmeticOperator
src/core/systems/returningProjectileSystem.ts:63:18
       const y = position.y[eid]!;
       const ownerX = position.x[ownerEid]!;
       const ownerY = position.y[ownerEid]!;
-      const dx = ownerX - x;
+      const dx = ownerX + x;
       const dy = ownerY - y;
       const distSq = dx * dx + dy * dy;

[Survived] ArithmeticOperator
src/core/systems/returningProjectileSystem.ts:64:18
       const ownerX = position.x[ownerEid]!;
       const ownerY = position.y[ownerEid]!;
       const dx = ownerX - x;
-      const dy = ownerY - y;
+      const dy = ownerY + y;
       const distSq = dx * dx + dy * dy;
 

[Killed] ArithmeticOperator
src/core/systems/returningProjectileSystem.ts:65:22
       const ownerY = position.y[ownerEid]!;
       const dx = ownerX - x;
       const dy = ownerY - y;
-      const distSq = dx * dx + dy * dy;
+      const distSq = dx / dx + dy * dy;
 
       // Arrived back at owner
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/returningProjectileSystem.ts:65:32
       const ownerY = position.y[ownerEid]!;
       const dx = ownerX - x;
       const dy = ownerY - y;
-      const distSq = dx * dx + dy * dy;
+      const distSq = dx * dx + dy / dy;
 
       // Arrived back at owner
killedBy: returningProjectileSystem coverage edges steers velocity toward owner while returning
statusReason: expected NaN to be close to 20, received difference is NaN, but expected 5e-7

[Killed] BlockStatement
src/core/systems/returningProjectileSystem.ts:68:39
       const distSq = dx * dx + dy * dy;
 
       // Arrived back at owner
-      if (distSq <= PICKUP_RADIUS_SQ) {
-        clearEntityStores(world, eid);
-        removeEntity(world.ecs, eid);
-        continue;
-      }
+      if (distSq <= PICKUP_RADIUS_SQ) {}
 
       // Steer towards owner
killedBy: returningProjectileSystem coverage edges removes projectile when it reaches pickup radius while returning
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/systems/returningProjectileSystem.ts:68:11
       const distSq = dx * dx + dy * dy;
 
       // Arrived back at owner
-      if (distSq <= PICKUP_RADIUS_SQ) {
+      if (distSq > PICKUP_RADIUS_SQ) {
         clearEntityStores(world, eid);
         removeEntity(world.ecs, eid);
killedBy: returningProjectileSystem coverage edges switches to returning without projectile component after exceeding range
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/core/systems/returningProjectileSystem.ts:77:18
       // Steer towards owner
       const dist = Math.sqrt(distSq);
       const returnSpeed = returning.returnSpeed[eid]!;
-      const vx = (dx / dist) * returnSpeed;
+      const vx = dx / dist / returnSpeed;
       const vy = (dy / dist) * returnSpeed;
 
killedBy: returningProjectileSystem coverage edges steers velocity toward owner while returning
statusReason: expected 0.05000000074505806 to be close to 20, received difference is 19.949999999254942, but expected 5e-7

[Killed] ArithmeticOperator
src/core/systems/returningProjectileSystem.ts:77:19
       // Steer towards owner
       const dist = Math.sqrt(distSq);
       const returnSpeed = returning.returnSpeed[eid]!;
-      const vx = (dx / dist) * returnSpeed;
+      const vx = (dx * dist) * returnSpeed;
       const vy = (dy / dist) * returnSpeed;
 
killedBy: returningProjectileSystem coverage edges steers velocity toward owner while returning
statusReason: expected 200000 to be close to 20, received difference is 199980, but expected 5e-7

[Survived] ArithmeticOperator
src/core/systems/returningProjectileSystem.ts:78:19
       const dist = Math.sqrt(distSq);
       const returnSpeed = returning.returnSpeed[eid]!;
       const vx = (dx / dist) * returnSpeed;
-      const vy = (dy / dist) * returnSpeed;
+      const vy = (dy * dist) * returnSpeed;
 
       setComponent(world.ecs, eid, Velocity, { x: vx, y: vy });

[Survived] ArithmeticOperator
src/core/systems/returningProjectileSystem.ts:78:18
       const dist = Math.sqrt(distSq);
       const returnSpeed = returning.returnSpeed[eid]!;
       const vx = (dx / dist) * returnSpeed;
-      const vy = (dy / dist) * returnSpeed;
+      const vy = dy / dist / returnSpeed;
 
       setComponent(world.ecs, eid, Velocity, { x: vx, y: vy });
