[Killed] StringLiteral
src/game/floor1Scenario.ts:52:29
 } from '../shared/quest-types.js';
 import { acceptQuest, notifyQuestTalk, setQuestCounter } from '../core/systems/questSystem.js';
 
-const FLOOR_1_PROTAGONIST = 'Rhea Vale';
+const FLOOR_1_PROTAGONIST = "";
 const FLOOR_1_STARTER_POOL = ['sword', 'knife', 'bow', 'pistol', 'throwing-knife'] as const;
 const FLOOR_1_TIMER_MS = 300_000;
killedBy: floor1Scenario initializes Floor 1 into loadout state with deterministic starter choices
statusReason: expected '' to be 'Rhea Vale' // Object.is equality

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:95:35
 const FLOOR_1_ENEMY_CAP = 14;
 const FLOOR_1_SPAWN_INTERVAL_MS = 900;
 const FLOOR_1_CAMERA_ZOOM = 2.0;
-const FLOOR_1_VIEWPORT_WIDTH_PX = GAME.WIDTH / FLOOR_1_CAMERA_ZOOM;
+const FLOOR_1_VIEWPORT_WIDTH_PX = GAME.WIDTH * FLOOR_1_CAMERA_ZOOM;
 const FLOOR_1_AMBIENT_SPAWN_MAX_DISTANCE_PX = FLOOR_1_VIEWPORT_WIDTH_PX * 2;
 const FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX = FLOOR_1_VIEWPORT_WIDTH_PX * 3;

[Killed] ArithmeticOperator
src/game/floor1Scenario.ts:96:47
 const FLOOR_1_SPAWN_INTERVAL_MS = 900;
 const FLOOR_1_CAMERA_ZOOM = 2.0;
 const FLOOR_1_VIEWPORT_WIDTH_PX = GAME.WIDTH / FLOOR_1_CAMERA_ZOOM;
-const FLOOR_1_AMBIENT_SPAWN_MAX_DISTANCE_PX = FLOOR_1_VIEWPORT_WIDTH_PX * 2;
+const FLOOR_1_AMBIENT_SPAWN_MAX_DISTANCE_PX = FLOOR_1_VIEWPORT_WIDTH_PX / 2;
 const FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX = FLOOR_1_VIEWPORT_WIDTH_PX * 3;
 const FLOOR_1_SPAWN_RADIUS_MIN = 160;
killedBy: floor1Scenario spawns deterministic rat/slime encounters from the floor director
statusReason: expected undefined to be defined

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:97:45
 const FLOOR_1_CAMERA_ZOOM = 2.0;
 const FLOOR_1_VIEWPORT_WIDTH_PX = GAME.WIDTH / FLOOR_1_CAMERA_ZOOM;
 const FLOOR_1_AMBIENT_SPAWN_MAX_DISTANCE_PX = FLOOR_1_VIEWPORT_WIDTH_PX * 2;
-const FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX = FLOOR_1_VIEWPORT_WIDTH_PX * 3;
+const FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX = FLOOR_1_VIEWPORT_WIDTH_PX / 3;
 const FLOOR_1_SPAWN_RADIUS_MIN = 160;
 const FLOOR_1_SPAWN_RADIUS_MAX = FLOOR_1_AMBIENT_SPAWN_MAX_DISTANCE_PX;

[Survived] StringLiteral
src/game/floor1Scenario.ts:103:29
 const FLOOR_1_PLAYER_HP_BONUS = 20;
 const FLOOR_1_PLAYER_MOVE_SPEED_BONUS = 0.2;
 const FLOOR_1_PLAYER_PICKUP_RANGE_BONUS = 8;
-const FLOOR_1_GOAL_PREFIX = 'floor1.objective';
+const FLOOR_1_GOAL_PREFIX = "";
 
 interface Floor1SpawnerState {

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:114:9
   playerX: number,
   playerY: number,
   overflowCount: number,
-): void {
-  if (!world.floor1 || overflowCount <= 0) {
-    return;
-  }
-  const rankedAmbient = [...world.floor1.enemyArchetypes.keys()]
-    .filter((eid) => entityExists(world.ecs, eid))
-    .map((eid) => {
-      const ex = world.stores.position.x[eid] ?? 0;
-      const ey = world.stores.position.y[eid] ?? 0;
-      const dx = ex - playerX;
-      const dy = ey - playerY;
-      return { eid, distanceSq: dx * dx + dy * dy };
-    })
-    .sort((a, b) => b.distanceSq - a.distanceSq);
-  for (let i = 0; i < Math.min(overflowCount, rankedAmbient.length); i += 1) {
-    const victim = rankedAmbient[i]?.eid;
-    if (victim === undefined) {
-      continue;
-    }
-    clearEntityStores(world, victim);
-    removeEntity(world.ecs, victim);
-    world.floor1.enemyArchetypes.delete(victim);
-  }
-}
+): void {}
 
 function pruneAmbientOutOfRange(world: GameWorld, playerX: number, playerY: number): void {

[NoCoverage] EqualityOperator
src/game/floor1Scenario.ts:115:24
   playerY: number,
   overflowCount: number,
 ): void {
-  if (!world.floor1 || overflowCount <= 0) {
+  if (!world.floor1 || overflowCount < 0) {
     return;
   }

[NoCoverage] ConditionalExpression
src/game/floor1Scenario.ts:115:24
   playerY: number,
   overflowCount: number,
 ): void {
-  if (!world.floor1 || overflowCount <= 0) {
+  if (!world.floor1 || false) {
     return;
   }

[NoCoverage] MethodExpression
src/game/floor1Scenario.ts:118:25
   if (!world.floor1 || overflowCount <= 0) {
     return;
   }
-  const rankedAmbient = [...world.floor1.enemyArchetypes.keys()]
-    .filter((eid) => entityExists(world.ecs, eid))
+  const rankedAmbient = [...world.floor1.enemyArchetypes.keys()]
     .map((eid) => {
       const ex = world.stores.position.x[eid] ?? 0;

[NoCoverage] MethodExpression
src/game/floor1Scenario.ts:118:25
   if (!world.floor1 || overflowCount <= 0) {
     return;
   }
-  const rankedAmbient = [...world.floor1.enemyArchetypes.keys()]
-    .filter((eid) => entityExists(world.ecs, eid))
-    .map((eid) => {
-      const ex = world.stores.position.x[eid] ?? 0;
-      const ey = world.stores.position.y[eid] ?? 0;
-      const dx = ex - playerX;
-      const dy = ey - playerY;
-      return { eid, distanceSq: dx * dx + dy * dy };
-    })
-    .sort((a, b) => b.distanceSq - a.distanceSq);
+  const rankedAmbient = [...world.floor1.enemyArchetypes.keys()].filter(eid => entityExists(world.ecs, eid)).map(eid => {
+  const ex = world.stores.position.x[eid] ?? 0;
+  const ey = world.stores.position.y[eid] ?? 0;
+  const dx = ex - playerX;
+  const dy = ey - playerY;
+  return {
+    eid,
+    distanceSq: dx * dx + dy * dy
+  };
+});
   for (let i = 0; i < Math.min(overflowCount, rankedAmbient.length); i += 1) {
     const victim = rankedAmbient[i]?.eid;

[NoCoverage] ArrowFunction
src/game/floor1Scenario.ts:119:13
     return;
   }
   const rankedAmbient = [...world.floor1.enemyArchetypes.keys()]
-    .filter((eid) => entityExists(world.ecs, eid))
+    .filter(() => undefined)
     .map((eid) => {
       const ex = world.stores.position.x[eid] ?? 0;

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:123:18
     .map((eid) => {
       const ex = world.stores.position.x[eid] ?? 0;
       const ey = world.stores.position.y[eid] ?? 0;
-      const dx = ex - playerX;
+      const dx = ex + playerX;
       const dy = ey - playerY;
       return { eid, distanceSq: dx * dx + dy * dy };

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:124:18
       const ex = world.stores.position.x[eid] ?? 0;
       const ey = world.stores.position.y[eid] ?? 0;
       const dx = ex - playerX;
-      const dy = ey - playerY;
+      const dy = ey + playerY;
       return { eid, distanceSq: dx * dx + dy * dy };
     })

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:125:33
       const ey = world.stores.position.y[eid] ?? 0;
       const dx = ex - playerX;
       const dy = ey - playerY;
-      return { eid, distanceSq: dx * dx + dy * dy };
+      return { eid, distanceSq: dx / dx + dy * dy };
     })
     .sort((a, b) => b.distanceSq - a.distanceSq);

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:125:33
       const ey = world.stores.position.y[eid] ?? 0;
       const dx = ex - playerX;
       const dy = ey - playerY;
-      return { eid, distanceSq: dx * dx + dy * dy };
+      return { eid, distanceSq: dx * dx - dy * dy };
     })
     .sort((a, b) => b.distanceSq - a.distanceSq);

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:127:21
       const dy = ey - playerY;
       return { eid, distanceSq: dx * dx + dy * dy };
     })
-    .sort((a, b) => b.distanceSq - a.distanceSq);
+    .sort((a, b) => b.distanceSq + a.distanceSq);
   for (let i = 0; i < Math.min(overflowCount, rankedAmbient.length); i += 1) {
     const victim = rankedAmbient[i]?.eid;

[NoCoverage] AssignmentOperator
src/game/floor1Scenario.ts:128:70
       return { eid, distanceSq: dx * dx + dy * dy };
     })
     .sort((a, b) => b.distanceSq - a.distanceSq);
-  for (let i = 0; i < Math.min(overflowCount, rankedAmbient.length); i += 1) {
+  for (let i = 0; i < Math.min(overflowCount, rankedAmbient.length); i -= 1) {
     const victim = rankedAmbient[i]?.eid;
     if (victim === undefined) {

[NoCoverage] MethodExpression
src/game/floor1Scenario.ts:128:23
       return { eid, distanceSq: dx * dx + dy * dy };
     })
     .sort((a, b) => b.distanceSq - a.distanceSq);
-  for (let i = 0; i < Math.min(overflowCount, rankedAmbient.length); i += 1) {
+  for (let i = 0; i < Math.max(overflowCount, rankedAmbient.length); i += 1) {
     const victim = rankedAmbient[i]?.eid;
     if (victim === undefined) {

[Survived] BlockStatement
src/game/floor1Scenario.ts:139:91
   }
 }
 
-function pruneAmbientOutOfRange(world: GameWorld, playerX: number, playerY: number): void {
-  if (!world.floor1) {
-    return;
-  }
-  const maxDistanceSq = FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX * FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX;
-  for (const eid of [...world.floor1.enemyArchetypes.keys()]) {
-    if (!entityExists(world.ecs, eid)) {
-      world.floor1.enemyArchetypes.delete(eid);
-      continue;
-    }
-    const ex = world.stores.position.x[eid] ?? 0;
-    const ey = world.stores.position.y[eid] ?? 0;
-    const dx = ex - playerX;
-    const dy = ey - playerY;
-    if (dx * dx + dy * dy <= maxDistanceSq) {
-      continue;
-    }
-    clearEntityStores(world, eid);
-    removeEntity(world.ecs, eid);
-    world.floor1.enemyArchetypes.delete(eid);
-  }
-}
+function pruneAmbientOutOfRange(world: GameWorld, playerX: number, playerY: number): void {}
 
 const spawnerStateByWorld = new WeakMap<GameWorld, Floor1SpawnerState>();

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:143:25
   if (!world.floor1) {
     return;
   }
-  const maxDistanceSq = FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX * FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX;
+  const maxDistanceSq = FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX / FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX;
   for (const eid of [...world.floor1.enemyArchetypes.keys()]) {
     if (!entityExists(world.ecs, eid)) {

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:144:63
     return;
   }
   const maxDistanceSq = FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX * FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX;
-  for (const eid of [...world.floor1.enemyArchetypes.keys()]) {
-    if (!entityExists(world.ecs, eid)) {
-      world.floor1.enemyArchetypes.delete(eid);
-      continue;
-    }
-    const ex = world.stores.position.x[eid] ?? 0;
-    const ey = world.stores.position.y[eid] ?? 0;
-    const dx = ex - playerX;
-    const dy = ey - playerY;
-    if (dx * dx + dy * dy <= maxDistanceSq) {
-      continue;
-    }
-    clearEntityStores(world, eid);
-    removeEntity(world.ecs, eid);
-    world.floor1.enemyArchetypes.delete(eid);
-  }
+  for (const eid of [...world.floor1.enemyArchetypes.keys()]) {}
 }
 

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:145:40
   }
   const maxDistanceSq = FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX * FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX;
   for (const eid of [...world.floor1.enemyArchetypes.keys()]) {
-    if (!entityExists(world.ecs, eid)) {
-      world.floor1.enemyArchetypes.delete(eid);
-      continue;
-    }
+    if (!entityExists(world.ecs, eid)) {}
     const ex = world.stores.position.x[eid] ?? 0;
     const ey = world.stores.position.y[eid] ?? 0;

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:145:9
   }
   const maxDistanceSq = FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX * FLOOR_1_AMBIENT_DESPAWN_DISTANCE_PX;
   for (const eid of [...world.floor1.enemyArchetypes.keys()]) {
-    if (!entityExists(world.ecs, eid)) {
+    if (entityExists(world.ecs, eid)) {
       world.floor1.enemyArchetypes.delete(eid);
       continue;

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:153:9
     const ey = world.stores.position.y[eid] ?? 0;
     const dx = ex - playerX;
     const dy = ey - playerY;
-    if (dx * dx + dy * dy <= maxDistanceSq) {
+    if (dx * dx - dy * dy <= maxDistanceSq) {
       continue;
     }

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:153:45
     const ey = world.stores.position.y[eid] ?? 0;
     const dx = ex - playerX;
     const dy = ey - playerY;
-    if (dx * dx + dy * dy <= maxDistanceSq) {
-      continue;
-    }
+    if (dx * dx + dy * dy <= maxDistanceSq) {}
     clearEntityStores(world, eid);
     removeEntity(world.ecs, eid);

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:167:7
 
 function getSpawnerState(world: GameWorld): Floor1SpawnerState {
   let state = spawnerStateByWorld.get(world);
-  if (state === undefined) {
+  if (true) {
     state = { lastSpawnMs: Number.NEGATIVE_INFINITY };
     spawnerStateByWorld.set(world, state);

[Killed] EqualityOperator
src/game/floor1Scenario.ts:177:10
 function pickStarterChoices(world: GameWorld): string[] {
   const pool = [...FLOOR_1_STARTER_POOL];
   const selected: string[] = [];
-  while (pool.length > 0 && selected.length < 3) {
+  while (pool.length <= 0 && selected.length < 3) {
     const idx = world.rng.nextInt(0, pool.length - 1);
     const id = pool.splice(idx, 1)[0];
killedBy: floor1Scenario initializes Floor 1 into loadout state with deterministic starter choices
statusReason: expected [] to have a length of 3 but got +0

[Killed] ConditionalExpression
src/game/floor1Scenario.ts:177:29
 function pickStarterChoices(world: GameWorld): string[] {
   const pool = [...FLOOR_1_STARTER_POOL];
   const selected: string[] = [];
-  while (pool.length > 0 && selected.length < 3) {
+  while (pool.length > 0 && true) {
     const idx = world.rng.nextInt(0, pool.length - 1);
     const id = pool.splice(idx, 1)[0];
killedBy: floor1Scenario initializes Floor 1 into loadout state with deterministic starter choices
statusReason: expected [ 'sword', 'pistol', 'knife', …(2) ] to have a length of 3 but got 5

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:178:38
   const pool = [...FLOOR_1_STARTER_POOL];
   const selected: string[] = [];
   while (pool.length > 0 && selected.length < 3) {
-    const idx = world.rng.nextInt(0, pool.length - 1);
+    const idx = world.rng.nextInt(0, pool.length + 1);
     const id = pool.splice(idx, 1)[0];
     if (id !== undefined) {

[Killed] BlockStatement
src/game/floor1Scenario.ts:180:27
   while (pool.length > 0 && selected.length < 3) {
     const idx = world.rng.nextInt(0, pool.length - 1);
     const id = pool.splice(idx, 1)[0];
-    if (id !== undefined) {
-      selected.push(id);
-    }
+    if (id !== undefined) {}
   }
   return selected;
killedBy: floor1Scenario initializes Floor 1 into loadout state with deterministic starter choices
statusReason: expected [] to have a length of 3 but got +0

[Killed] ArithmeticOperator
src/game/floor1Scenario.ts:192:35
   y: number;
 } {
   return {
-    x: Math.floor(room.bounds.x + room.bounds.width / 2),
+    x: Math.floor(room.bounds.x + room.bounds.width * 2),
     y: Math.floor(room.bounds.y + room.bounds.height / 2),
   };
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/game/floor1Scenario.ts:192:19
   y: number;
 } {
   return {
-    x: Math.floor(room.bounds.x + room.bounds.width / 2),
+    x: Math.floor(room.bounds.x - room.bounds.width / 2),
     y: Math.floor(room.bounds.y + room.bounds.height / 2),
   };
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/game/floor1Scenario.ts:193:19
 } {
   return {
     x: Math.floor(room.bounds.x + room.bounds.width / 2),
-    y: Math.floor(room.bounds.y + room.bounds.height / 2),
+    y: Math.floor(room.bounds.y - room.bounds.height / 2),
   };
 }
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/game/floor1Scenario.ts:193:35
 } {
   return {
     x: Math.floor(room.bounds.x + room.bounds.width / 2),
-    y: Math.floor(room.bounds.y + room.bounds.height / 2),
+    y: Math.floor(room.bounds.y + room.bounds.height * 2),
   };
 }
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:204:49
   questItemPos: { x: number; y: number };
 } {
   const floorMap = world.floorMap;
-  const fallbackSafe = { x: floorMap?.widthPx ? floorMap.widthPx - 120 : 1120, y: 120 };
+  const fallbackSafe = { x: floorMap?.widthPx ? floorMap.widthPx + 120 : 1120, y: 120 };
   const fallbackStair = { x: floorMap?.widthPx ? floorMap.widthPx - 120 : 1120, y: 560 };
   const fallbackShop = { x: floorMap?.widthPx ? floorMap.widthPx - 240 : 880, y: 340 };

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:205:50
 } {
   const floorMap = world.floorMap;
   const fallbackSafe = { x: floorMap?.widthPx ? floorMap.widthPx - 120 : 1120, y: 120 };
-  const fallbackStair = { x: floorMap?.widthPx ? floorMap.widthPx - 120 : 1120, y: 560 };
+  const fallbackStair = { x: floorMap?.widthPx ? floorMap.widthPx + 120 : 1120, y: 560 };
   const fallbackShop = { x: floorMap?.widthPx ? floorMap.widthPx - 240 : 880, y: 340 };
   const fallbackItem = { x: floorMap?.widthPx ? Math.floor(floorMap.widthPx / 2) : 640, y: 340 };

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:206:49
   const floorMap = world.floorMap;
   const fallbackSafe = { x: floorMap?.widthPx ? floorMap.widthPx - 120 : 1120, y: 120 };
   const fallbackStair = { x: floorMap?.widthPx ? floorMap.widthPx - 120 : 1120, y: 560 };
-  const fallbackShop = { x: floorMap?.widthPx ? floorMap.widthPx - 240 : 880, y: 340 };
+  const fallbackShop = { x: floorMap?.widthPx ? floorMap.widthPx + 240 : 880, y: 340 };
   const fallbackItem = { x: floorMap?.widthPx ? Math.floor(floorMap.widthPx / 2) : 640, y: 340 };
 

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:207:60
   const fallbackSafe = { x: floorMap?.widthPx ? floorMap.widthPx - 120 : 1120, y: 120 };
   const fallbackStair = { x: floorMap?.widthPx ? floorMap.widthPx - 120 : 1120, y: 560 };
   const fallbackShop = { x: floorMap?.widthPx ? floorMap.widthPx - 240 : 880, y: 340 };
-  const fallbackItem = { x: floorMap?.widthPx ? Math.floor(floorMap.widthPx / 2) : 640, y: 340 };
+  const fallbackItem = { x: floorMap?.widthPx ? Math.floor(floorMap.widthPx * 2) : 640, y: 340 };
 
   if (!floorMap) {

[NoCoverage] ConditionalExpression
src/game/floor1Scenario.ts:231:14
       centerOfRoom(bossStairRoom).x,
       centerOfRoom(bossStairRoom).y,
     );
-  } else if (floorMap.rooms.length < 2) {
+  } else if (false) {
     safeRoomPos = fallbackSafe;
     staircasePos = fallbackStair;

[NoCoverage] EqualityOperator
src/game/floor1Scenario.ts:231:14
       centerOfRoom(bossStairRoom).x,
       centerOfRoom(bossStairRoom).y,
     );
-  } else if (floorMap.rooms.length < 2) {
+  } else if (floorMap.rooms.length >= 2) {
     safeRoomPos = fallbackSafe;
     staircasePos = fallbackStair;

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:238:18
     const spawnTile = floorMap.playerSpawn;
     const scored = floorMap.rooms.map((room) => {
       const center = centerOfRoom(room);
-      const dx = center.x - spawnTile.x;
+      const dx = center.x + spawnTile.x;
       const dy = center.y - spawnTile.y;
       return { room, distanceSq: dx * dx + dy * dy };

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:239:18
     const scored = floorMap.rooms.map((room) => {
       const center = centerOfRoom(room);
       const dx = center.x - spawnTile.x;
-      const dy = center.y - spawnTile.y;
+      const dy = center.y + spawnTile.y;
       return { room, distanceSq: dx * dx + dy * dy };
     });

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:240:44
       const center = centerOfRoom(room);
       const dx = center.x - spawnTile.x;
       const dy = center.y - spawnTile.y;
-      return { room, distanceSq: dx * dx + dy * dy };
+      return { room, distanceSq: dx * dx + dy / dy };
     });
     scored.sort((a, b) => b.distanceSq - a.distanceSq);

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:240:34
       const center = centerOfRoom(room);
       const dx = center.x - spawnTile.x;
       const dy = center.y - spawnTile.y;
-      return { room, distanceSq: dx * dx + dy * dy };
+      return { room, distanceSq: dx / dx + dy * dy };
     });
     scored.sort((a, b) => b.distanceSq - a.distanceSq);

[NoCoverage] MethodExpression
src/game/floor1Scenario.ts:242:5
       const dy = center.y - spawnTile.y;
       return { room, distanceSq: dx * dx + dy * dy };
     });
-    scored.sort((a, b) => b.distanceSq - a.distanceSq);
+    scored;
 
     const staircaseRoom = scored[0]?.room ?? floorMap.rooms[floorMap.rooms.length - 1]!;

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:242:27
       const dy = center.y - spawnTile.y;
       return { room, distanceSq: dx * dx + dy * dy };
     });
-    scored.sort((a, b) => b.distanceSq - a.distanceSq);
+    scored.sort((a, b) => b.distanceSq + a.distanceSq);
 
     const staircaseRoom = scored[0]?.room ?? floorMap.rooms[floorMap.rooms.length - 1]!;

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:244:61
     });
     scored.sort((a, b) => b.distanceSq - a.distanceSq);
 
-    const staircaseRoom = scored[0]?.room ?? floorMap.rooms[floorMap.rooms.length - 1]!;
+    const staircaseRoom = scored[0]?.room ?? floorMap.rooms[floorMap.rooms.length + 1]!;
     const safeRoomFallback =
       scored[1]?.room ?? floorMap.rooms[Math.max(0, floorMap.rooms.length - 2)]!;

[NoCoverage] MethodExpression
src/game/floor1Scenario.ts:246:41
 
     const staircaseRoom = scored[0]?.room ?? floorMap.rooms[floorMap.rooms.length - 1]!;
     const safeRoomFallback =
-      scored[1]?.room ?? floorMap.rooms[Math.max(0, floorMap.rooms.length - 2)]!;
+      scored[1]?.room ?? floorMap.rooms[Math.min(0, floorMap.rooms.length - 2)]!;
     safeRoomPos = floorMap.tileToPixel(
       centerOfRoom(safeRoomFallback).x,

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:246:53
 
     const staircaseRoom = scored[0]?.room ?? floorMap.rooms[floorMap.rooms.length - 1]!;
     const safeRoomFallback =
-      scored[1]?.room ?? floorMap.rooms[Math.max(0, floorMap.rooms.length - 2)]!;
+      scored[1]?.room ?? floorMap.rooms[Math.max(0, floorMap.rooms.length + 2)]!;
     safeRoomPos = floorMap.tileToPixel(
       centerOfRoom(safeRoomFallback).x,

[Survived] MethodExpression
src/game/floor1Scenario.ts:261:5
   // Quest item: a distinct, further room so the player has to go find it.
   const spawnTile = floorMap.playerSpawn;
   const reserved = new Set(
-    [floorMap.spawnRoom, floorMap.safeRoom, floorMap.bossStairRoom].filter(
-      (r): r is NonNullable<typeof r> => r != null,
-    ),
+    [floorMap.spawnRoom, floorMap.safeRoom, floorMap.bossStairRoom],
   );
   const candidates = floorMap.rooms

[Survived] EqualityOperator
src/game/floor1Scenario.ts:262:42
   const spawnTile = floorMap.playerSpawn;
   const reserved = new Set(
     [floorMap.spawnRoom, floorMap.safeRoom, floorMap.bossStairRoom].filter(
-      (r): r is NonNullable<typeof r> => r != null,
+      (r): r is NonNullable<typeof r> => r == null,
     ),
   );

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:262:42
   const spawnTile = floorMap.playerSpawn;
   const reserved = new Set(
     [floorMap.spawnRoom, floorMap.safeRoom, floorMap.bossStairRoom].filter(
-      (r): r is NonNullable<typeof r> => r != null,
+      (r): r is NonNullable<typeof r> => true,
     ),
   );

[Survived] MethodExpression
src/game/floor1Scenario.ts:265:22
       (r): r is NonNullable<typeof r> => r != null,
     ),
   );
-  const candidates = floorMap.rooms
-    .filter((room) => !reserved.has(room))
-    .map((room) => {
-      const center = centerOfRoom(room);
-      const dx = center.x - spawnTile.x;
-      const dy = center.y - spawnTile.y;
-      return { room, center, distanceSq: dx * dx + dy * dy };
-    })
-    .sort((a, b) => a.distanceSq - b.distanceSq);
+  const candidates = floorMap.rooms.filter(room => !reserved.has(room)).map(room => {
+  const center = centerOfRoom(room);
+  const dx = center.x - spawnTile.x;
+  const dy = center.y - spawnTile.y;
+  return {
+    room,
+    center,
+    distanceSq: dx * dx + dy * dy
+  };
+});
 
   const shopEntry = candidates[0];

[Survived] MethodExpression
src/game/floor1Scenario.ts:265:22
       (r): r is NonNullable<typeof r> => r != null,
     ),
   );
-  const candidates = floorMap.rooms
-    .filter((room) => !reserved.has(room))
+  const candidates = floorMap.rooms
     .map((room) => {
       const center = centerOfRoom(room);

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:266:23
     ),
   );
   const candidates = floorMap.rooms
-    .filter((room) => !reserved.has(room))
+    .filter((room) => reserved.has(room))
     .map((room) => {
       const center = centerOfRoom(room);

[Survived] ArrowFunction
src/game/floor1Scenario.ts:266:13
     ),
   );
   const candidates = floorMap.rooms
-    .filter((room) => !reserved.has(room))
+    .filter(() => undefined)
     .map((room) => {
       const center = centerOfRoom(room);

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:271:42
       const center = centerOfRoom(room);
       const dx = center.x - spawnTile.x;
       const dy = center.y - spawnTile.y;
-      return { room, center, distanceSq: dx * dx + dy * dy };
+      return { room, center, distanceSq: dx * dx - dy * dy };
     })
     .sort((a, b) => a.distanceSq - b.distanceSq);

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:271:42
       const center = centerOfRoom(room);
       const dx = center.x - spawnTile.x;
       const dy = center.y - spawnTile.y;
-      return { room, center, distanceSq: dx * dx + dy * dy };
+      return { room, center, distanceSq: dx / dx + dy * dy };
     })
     .sort((a, b) => a.distanceSq - b.distanceSq);

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:273:21
       const dy = center.y - spawnTile.y;
       return { room, center, distanceSq: dx * dx + dy * dy };
     })
-    .sort((a, b) => a.distanceSq - b.distanceSq);
+    .sort((a, b) => a.distanceSq + b.distanceSq);
 
   const shopEntry = candidates[0];

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:276:56
     .sort((a, b) => a.distanceSq - b.distanceSq);
 
   const shopEntry = candidates[0];
-  const itemEntry = candidates.length > 1 ? candidates[candidates.length - 1] : candidates[0];
+  const itemEntry = candidates.length > 1 ? candidates[candidates.length + 1] : candidates[0];
   const shopRoomPos = shopEntry
     ? floorMap.tileToPixel(shopEntry.center.x, shopEntry.center.y)

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:276:21
     .sort((a, b) => a.distanceSq - b.distanceSq);
 
   const shopEntry = candidates[0];
-  const itemEntry = candidates.length > 1 ? candidates[candidates.length - 1] : candidates[0];
+  const itemEntry = false ? candidates[candidates.length - 1] : candidates[0];
   const shopRoomPos = shopEntry
     ? floorMap.tileToPixel(shopEntry.center.x, shopEntry.center.y)

[Survived] BlockStatement
src/game/floor1Scenario.ts:288:91
 }
 
 /** Tag the shop room as a safe room and repaint its floor tiles so it renders correctly. */
-function tagShopRoomAsSafe(world: GameWorld, shopRoomPos: { x: number; y: number }): void {
-  const floorMap = world.floorMap;
-  if (!floorMap) return;
-  const tile = floorMap.pixelToTile(shopRoomPos.x, shopRoomPos.y);
-  const roomId = floorMap.roomGraph.getRoomAt(tile.x, tile.y);
-  if (roomId < 0) return;
-  floorMap.roomGraph.setRole(roomId, RoomRole.SAFE);
-  const room = floorMap.roomGraph.get(roomId);
-  if (!room) return;
-  const { x: rx, y: ry, width, height } = room.bounds;
-  const w = floorMap.config.widthTiles;
-  for (let ty = ry; ty < ry + height; ty++) {
-    for (let tx = rx; tx < rx + width; tx++) {
-      if (floorMap.terrain[ty * w + tx] === TerrainType.STONE_FLOOR) {
-        floorMap.terrain[ty * w + tx] = TerrainType.SAFE_ROOM_FLOOR;
-      }
-    }
-  }
-}
+function tagShopRoomAsSafe(world: GameWorld, shopRoomPos: { x: number; y: number }): void {}
 
 /** Called the first time the player talks to the Tutorial Goon. Accepts the quest and unlocks quest tracking. */

[Survived] EqualityOperator
src/game/floor1Scenario.ts:293:7
   if (!floorMap) return;
   const tile = floorMap.pixelToTile(shopRoomPos.x, shopRoomPos.y);
   const roomId = floorMap.roomGraph.getRoomAt(tile.x, tile.y);
-  if (roomId < 0) return;
+  if (roomId >= 0) return;
   floorMap.roomGraph.setRole(roomId, RoomRole.SAFE);
   const room = floorMap.roomGraph.get(roomId);

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:293:7
   if (!floorMap) return;
   const tile = floorMap.pixelToTile(shopRoomPos.x, shopRoomPos.y);
   const roomId = floorMap.roomGraph.getRoomAt(tile.x, tile.y);
-  if (roomId < 0) return;
+  if (false) return;
   floorMap.roomGraph.setRole(roomId, RoomRole.SAFE);
   const room = floorMap.roomGraph.get(roomId);

[Survived] EqualityOperator
src/game/floor1Scenario.ts:299:21
   if (!room) return;
   const { x: rx, y: ry, width, height } = room.bounds;
   const w = floorMap.config.widthTiles;
-  for (let ty = ry; ty < ry + height; ty++) {
+  for (let ty = ry; ty <= ry + height; ty++) {
     for (let tx = rx; tx < rx + width; tx++) {
       if (floorMap.terrain[ty * w + tx] === TerrainType.STONE_FLOOR) {

[Timeout] UpdateOperator
src/game/floor1Scenario.ts:299:39
   if (!room) return;
   const { x: rx, y: ry, width, height } = room.bounds;
   const w = floorMap.config.widthTiles;
-  for (let ty = ry; ty < ry + height; ty++) {
+  for (let ty = ry; ty < ry + height; ty--) {
     for (let tx = rx; tx < rx + width; tx++) {
       if (floorMap.terrain[ty * w + tx] === TerrainType.STONE_FLOOR) {
