[Survived] BlockStatement
src/game/floor1Scenario.ts:300:46
   const { x: rx, y: ry, width, height } = room.bounds;
   const w = floorMap.config.widthTiles;
   for (let ty = ry; ty < ry + height; ty++) {
-    for (let tx = rx; tx < rx + width; tx++) {
-      if (floorMap.terrain[ty * w + tx] === TerrainType.STONE_FLOOR) {
-        floorMap.terrain[ty * w + tx] = TerrainType.SAFE_ROOM_FLOOR;
-      }
-    }
+    for (let tx = rx; tx < rx + width; tx++) {}
   }
 }

[Survived] EqualityOperator
src/game/floor1Scenario.ts:300:23
   const { x: rx, y: ry, width, height } = room.bounds;
   const w = floorMap.config.widthTiles;
   for (let ty = ry; ty < ry + height; ty++) {
-    for (let tx = rx; tx < rx + width; tx++) {
+    for (let tx = rx; tx >= rx + width; tx++) {
       if (floorMap.terrain[ty * w + tx] === TerrainType.STONE_FLOOR) {
         floorMap.terrain[ty * w + tx] = TerrainType.SAFE_ROOM_FLOOR;

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:301:28
   const w = floorMap.config.widthTiles;
   for (let ty = ry; ty < ry + height; ty++) {
     for (let tx = rx; tx < rx + width; tx++) {
-      if (floorMap.terrain[ty * w + tx] === TerrainType.STONE_FLOOR) {
+      if (floorMap.terrain[ty * w - tx] === TerrainType.STONE_FLOOR) {
         floorMap.terrain[ty * w + tx] = TerrainType.SAFE_ROOM_FLOOR;
       }

[Survived] BlockStatement
src/game/floor1Scenario.ts:301:70
   const w = floorMap.config.widthTiles;
   for (let ty = ry; ty < ry + height; ty++) {
     for (let tx = rx; tx < rx + width; tx++) {
-      if (floorMap.terrain[ty * w + tx] === TerrainType.STONE_FLOOR) {
-        floorMap.terrain[ty * w + tx] = TerrainType.SAFE_ROOM_FLOOR;
-      }
+      if (floorMap.terrain[ty * w + tx] === TerrainType.STONE_FLOOR) {}
     }
   }

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:302:26
   for (let ty = ry; ty < ry + height; ty++) {
     for (let tx = rx; tx < rx + width; tx++) {
       if (floorMap.terrain[ty * w + tx] === TerrainType.STONE_FLOOR) {
-        floorMap.terrain[ty * w + tx] = TerrainType.SAFE_ROOM_FLOOR;
+        floorMap.terrain[ty * w - tx] = TerrainType.SAFE_ROOM_FLOOR;
       }
     }

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:302:26
   for (let ty = ry; ty < ry + height; ty++) {
     for (let tx = rx; tx < rx + width; tx++) {
       if (floorMap.terrain[ty * w + tx] === TerrainType.STONE_FLOOR) {
-        floorMap.terrain[ty * w + tx] = TerrainType.SAFE_ROOM_FLOOR;
+        floorMap.terrain[ty / w + tx] = TerrainType.SAFE_ROOM_FLOOR;
       }
     }

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:309:58
 }
 
 /** Called the first time the player talks to the Tutorial Goon. Accepts the quest and unlocks quest tracking. */
-export function meetTutorialGoon(world: GameWorld): void {
-  acceptQuest(world, FLOOR1_TUTORIAL_QUEST_ID);
-  notifyQuestTalk(world, 'tutorial-goon');
-  if (world.floor1) {
-    world.floor1.objective.questAccepted = true;
-  }
-}
+export function meetTutorialGoon(world: GameWorld): void {}
 
 export function initializeFloor1Scenario(world: GameWorld, playerEid: number): void {

[NoCoverage] StringLiteral
src/game/floor1Scenario.ts:311:26
 /** Called the first time the player talks to the Tutorial Goon. Accepts the quest and unlocks quest tracking. */
 export function meetTutorialGoon(world: GameWorld): void {
   acceptQuest(world, FLOOR1_TUTORIAL_QUEST_ID);
-  notifyQuestTalk(world, 'tutorial-goon');
+  notifyQuestTalk(world, "");
   if (world.floor1) {
     world.floor1.objective.questAccepted = true;

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:312:21
 export function meetTutorialGoon(world: GameWorld): void {
   acceptQuest(world, FLOOR1_TUTORIAL_QUEST_ID);
   notifyQuestTalk(world, 'tutorial-goon');
-  if (world.floor1) {
-    world.floor1.objective.questAccepted = true;
-  }
+  if (world.floor1) {}
 }
 

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:313:44
   acceptQuest(world, FLOOR1_TUTORIAL_QUEST_ID);
   notifyQuestTalk(world, 'tutorial-goon');
   if (world.floor1) {
-    world.floor1.objective.questAccepted = true;
+    world.floor1.objective.questAccepted = false;
   }
 }

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:326:7
   world.floorMap = floorMap;
 
   const spawn = floorMap.tileToPixel(floorMap.playerSpawn.x, floorMap.playerSpawn.y);
-  if (hasComponent(world.ecs, playerEid, Position)) {
+  if (false) {
     setComponent(world.ecs, playerEid, Position, { x: spawn.x, y: spawn.y });
   }

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:326:7
   world.floorMap = floorMap;
 
   const spawn = floorMap.tileToPixel(floorMap.playerSpawn.x, floorMap.playerSpawn.y);
-  if (hasComponent(world.ecs, playerEid, Position)) {
+  if (true) {
     setComponent(world.ecs, playerEid, Position, { x: spawn.x, y: spawn.y });
   }

[Survived] BlockStatement
src/game/floor1Scenario.ts:329:60
   if (hasComponent(world.ecs, playerEid, Position)) {
     setComponent(world.ecs, playerEid, Position, { x: spawn.x, y: spawn.y });
   }
-  if (!hasComponent(world.ecs, playerEid, BroadcastScore)) {
-    addComponent(world.ecs, playerEid, set(BroadcastScore, { current: 0 }));
-  }
+  if (!hasComponent(world.ecs, playerEid, BroadcastScore)) {}
 
   const maxHp = (world.stores.health.max[playerEid] ?? 100) + FLOOR_1_PLAYER_HP_BONUS;

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:329:7
   if (hasComponent(world.ecs, playerEid, Position)) {
     setComponent(world.ecs, playerEid, Position, { x: spawn.x, y: spawn.y });
   }
-  if (!hasComponent(world.ecs, playerEid, BroadcastScore)) {
+  if (hasComponent(world.ecs, playerEid, BroadcastScore)) {
     addComponent(world.ecs, playerEid, set(BroadcastScore, { current: 0 }));
   }

[Survived] ObjectLiteral
src/game/floor1Scenario.ts:330:60
     setComponent(world.ecs, playerEid, Position, { x: spawn.x, y: spawn.y });
   }
   if (!hasComponent(world.ecs, playerEid, BroadcastScore)) {
-    addComponent(world.ecs, playerEid, set(BroadcastScore, { current: 0 }));
+    addComponent(world.ecs, playerEid, set(BroadcastScore, {}));
   }
 

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:333:17
     addComponent(world.ecs, playerEid, set(BroadcastScore, { current: 0 }));
   }
 
-  const maxHp = (world.stores.health.max[playerEid] ?? 100) + FLOOR_1_PLAYER_HP_BONUS;
+  const maxHp = (world.stores.health.max[playerEid] ?? 100) - FLOOR_1_PLAYER_HP_BONUS;
   setComponent(world.ecs, playerEid, Health, { current: maxHp, max: maxHp });
 

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:367:22
       shopRoomPos,
       questItemPos,
       markerRadiusPx: FLOOR_1_MARKER_RADIUS_PX,
-      questAccepted: false,
+      questAccepted: true,
       questCompleted: false,
       ratsKilled: 0,
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:368:23
       questItemPos,
       markerRadiusPx: FLOOR_1_MARKER_RADIUS_PX,
       questAccepted: false,
-      questCompleted: false,
+      questCompleted: true,
       ratsKilled: 0,
       slimesKilled: 0,
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:373:27
       slimesKilled: 0,
       goldCollected: 0,
       junkCollected: 0,
-      safeRoomDiscovered: false,
+      safeRoomDiscovered: true,
       staircaseSpawnStartedMs: null,
       staircaseSpawnRemainingMs: null,

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:376:25
       safeRoomDiscovered: false,
       staircaseSpawnStartedMs: null,
       staircaseSpawnRemainingMs: null,
-      staircaseSpawned: false,
+      staircaseSpawned: true,
       staircaseLocked: true,
       staircaseUnlocked: false,
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:377:24
       staircaseSpawnStartedMs: null,
       staircaseSpawnRemainingMs: null,
       staircaseSpawned: false,
-      staircaseLocked: true,
+      staircaseLocked: false,
       staircaseUnlocked: false,
       staircaseDiscovered: false,
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:378:26
       staircaseSpawnRemainingMs: null,
       staircaseSpawned: false,
       staircaseLocked: true,
-      staircaseUnlocked: false,
+      staircaseUnlocked: true,
       staircaseDiscovered: false,
       bossBattleStarted: false,
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:379:28
       staircaseSpawned: false,
       staircaseLocked: true,
       staircaseUnlocked: false,
-      staircaseDiscovered: false,
+      staircaseDiscovered: true,
       bossBattleStarted: false,
       staircaseBossEid: null,
killedBy: floor1Scenario times out the run when the staircase deadline is missed
statusReason: expected 'playing' to be 'game_over' // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:380:26
       staircaseLocked: true,
       staircaseUnlocked: false,
       staircaseDiscovered: false,
-      bossBattleStarted: false,
+      bossBattleStarted: true,
       staircaseBossEid: null,
       staircaseBossDefeated: false,
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:382:30
       staircaseDiscovered: false,
       bossBattleStarted: false,
       staircaseBossEid: null,
-      staircaseBossDefeated: false,
+      staircaseBossDefeated: true,
     },
     failReason: null,

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:387:67
     failReason: null,
     runSummary: null,
   };
-  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.safeRoomDiscovered`, false);
+  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.safeRoomDiscovered`, true);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseUnlocked`, false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, false);

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:388:66
     runSummary: null,
   };
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.safeRoomDiscovered`, false);
-  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseUnlocked`, false);
+  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseUnlocked`, true);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.combatComplete`, false);

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:389:68
   };
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.safeRoomDiscovered`, false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseUnlocked`, false);
-  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, false);
+  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, true);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.combatComplete`, false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.lootComplete`, false);

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:390:63
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.safeRoomDiscovered`, false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseUnlocked`, false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, false);
-  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.combatComplete`, false);
+  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.combatComplete`, true);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.lootComplete`, false);
   setGoalFlag(world, 'floor1-defeat-boss', false);

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:391:61
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseUnlocked`, false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.combatComplete`, false);
-  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.lootComplete`, false);
+  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.lootComplete`, true);
   setGoalFlag(world, 'floor1-defeat-boss', false);
   setGoalFlag(world, 'floor1-boss-active', false);

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:392:44
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.combatComplete`, false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.lootComplete`, false);
-  setGoalFlag(world, 'floor1-defeat-boss', false);
+  setGoalFlag(world, 'floor1-defeat-boss', true);
   setGoalFlag(world, 'floor1-boss-active', false);
   setGoalFlag(world, 'floor1-shop-prize-returned', false);

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:393:44
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.combatComplete`, false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.lootComplete`, false);
   setGoalFlag(world, 'floor1-defeat-boss', false);
-  setGoalFlag(world, 'floor1-boss-active', false);
+  setGoalFlag(world, 'floor1-boss-active', true);
   setGoalFlag(world, 'floor1-shop-prize-returned', false);
   setGoalFlag(world, 'floor1-shop-quest-complete', false);

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:394:52
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.lootComplete`, false);
   setGoalFlag(world, 'floor1-defeat-boss', false);
   setGoalFlag(world, 'floor1-boss-active', false);
-  setGoalFlag(world, 'floor1-shop-prize-returned', false);
+  setGoalFlag(world, 'floor1-shop-prize-returned', true);
   setGoalFlag(world, 'floor1-shop-quest-complete', false);
 
killedBy: floor1Scenario shopkeeper errand questline accepts both Floor 1 quests on initialization
statusReason: expected 'ready-to-buy' to be 'not-met' // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:395:52
   setGoalFlag(world, 'floor1-defeat-boss', false);
   setGoalFlag(world, 'floor1-boss-active', false);
   setGoalFlag(world, 'floor1-shop-prize-returned', false);
-  setGoalFlag(world, 'floor1-shop-quest-complete', false);
+  setGoalFlag(world, 'floor1-shop-quest-complete', true);
 
   // Spawn the tutorial guide NPC near the player's starting position.
killedBy: floor1Scenario shopkeeper errand questline accepts both Floor 1 quests on initialization
statusReason: expected 'complete' to be 'not-met' // Object.is equality

[Survived] StringLiteral
src/game/floor1Scenario.ts:406:81
   );
 
   // Spawn the merchant in his shop room and drop his gross fetch item out in the dungeon.
-  world.floor1.shopkeeperNpcEid = spawnNpc(world, shopRoomPos.x, shopRoomPos.y, 'shopkeeper');
+  world.floor1.shopkeeperNpcEid = spawnNpc(world, shopRoomPos.x, shopRoomPos.y, "");
   world.floor1.questItemEid = spawnDroppedItem(
     world,

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:421:52
   acceptQuest(world, FLOOR1_SHOP_QUEST_ID);
 
   // Keep boss-room doors locked until the Tutorial Goon quest is completed.
-  setGoalFlag(world, 'floor1-goon-quest-complete', false);
+  setGoalFlag(world, 'floor1-goon-quest-complete', true);
   const bossStairRoom = floorMap.bossStairRoom;
   if (bossStairRoom) {

[Survived] BlockStatement
src/game/floor1Scenario.ts:423:22
   // Keep boss-room doors locked until the Tutorial Goon quest is completed.
   setGoalFlag(world, 'floor1-goon-quest-complete', false);
   const bossStairRoom = floorMap.bossStairRoom;
-  if (bossStairRoom) {
-    for (const door of bossStairRoom.doors) {
-      const doorEid = createEntity(world);
-      addComponent(
-        world.ecs,
-        doorEid,
-        set(DoorState, { tileX: door.x, tileY: door.y, isOpen: 0, isLocked: 1, wasUnlocked: 0 }),
-      );
-      setDoorLockConfig(world, doorEid, {
-        unlock: {
-          operator: 'all',
-          conditions: [{ type: 'goal', goalId: 'floor1-goon-quest-complete' }],
-        },
-      });
-      world.floor1.bossDoorEids.push(doorEid);
-    }
-  }
+  if (bossStairRoom) {}
 
   world.state = 'loadout';

[Survived] BlockStatement
src/game/floor1Scenario.ts:424:45
   setGoalFlag(world, 'floor1-goon-quest-complete', false);
   const bossStairRoom = floorMap.bossStairRoom;
   if (bossStairRoom) {
-    for (const door of bossStairRoom.doors) {
-      const doorEid = createEntity(world);
-      addComponent(
-        world.ecs,
-        doorEid,
-        set(DoorState, { tileX: door.x, tileY: door.y, isOpen: 0, isLocked: 1, wasUnlocked: 0 }),
-      );
-      setDoorLockConfig(world, doorEid, {
-        unlock: {
-          operator: 'all',
-          conditions: [{ type: 'goal', goalId: 'floor1-goon-quest-complete' }],
-        },
-      });
-      world.floor1.bossDoorEids.push(doorEid);
-    }
+    for (const door of bossStairRoom.doors) {}
   }
 

[Killed] BlockStatement
src/game/floor1Scenario.ts:444:88
   world.state = 'loadout';
 }
 
-export function selectFloor1StarterWeapon(world: GameWorld, optionIndex: number): void {
-  if (!world.floor1 || world.state !== 'loadout') {
-    return;
-  }
-
-  const weaponId = world.floor1.starterChoices[optionIndex];
-  if (weaponId === undefined) {
-    return;
-  }
-
-  const weaponDef = getWeaponDef(weaponId);
-  if (weaponDef === undefined) {
-    return;
-  }
-
-  world.floor1.selectedWeaponId = weaponId;
-  world.floor1.selectedChoiceIndex = optionIndex;
-  setActiveWeapon(world, weaponDef);
-  world.state = 'playing';
-}
+export function selectFloor1StarterWeapon(world: GameWorld, optionIndex: number): void {}
 
 function resolveSpawnPosition(
killedBy: floor1Scenario applies selected starter weapon and transitions to playing
statusReason: expected 'loadout' to be 'playing' // Object.is equality

[Killed] EqualityOperator
src/game/floor1Scenario.ts:445:24
 }
 
 export function selectFloor1StarterWeapon(world: GameWorld, optionIndex: number): void {
-  if (!world.floor1 || world.state !== 'loadout') {
+  if (!world.floor1 || world.state === 'loadout') {
     return;
   }
killedBy: floor1Scenario applies selected starter weapon and transitions to playing
statusReason: expected 'loadout' to be 'playing' // Object.is equality

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:445:24
 }
 
 export function selectFloor1StarterWeapon(world: GameWorld, optionIndex: number): void {
-  if (!world.floor1 || world.state !== 'loadout') {
+  if (!world.floor1 || false) {
     return;
   }

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:472:17
 ): { x: number; y: number } {
   const floorMap = world.floorMap;
   if (!floorMap) {
-    return { x: playerX + FLOOR_1_SPAWN_RADIUS_MIN, y: playerY };
+    return { x: playerX - FLOOR_1_SPAWN_RADIUS_MIN, y: playerY };
   }
   for (let attempt = 0; attempt < 16; attempt += 1) {

[Survived] EqualityOperator
src/game/floor1Scenario.ts:474:25
   if (!floorMap) {
     return { x: playerX + FLOOR_1_SPAWN_RADIUS_MIN, y: playerY };
   }
-  for (let attempt = 0; attempt < 16; attempt += 1) {
+  for (let attempt = 0; attempt <= 16; attempt += 1) {
     const angle = world.rng.next() * Math.PI * 2;
     const radius =

[Survived] BlockStatement
src/game/floor1Scenario.ts:474:53
   if (!floorMap) {
     return { x: playerX + FLOOR_1_SPAWN_RADIUS_MIN, y: playerY };
   }
-  for (let attempt = 0; attempt < 16; attempt += 1) {
-    const angle = world.rng.next() * Math.PI * 2;
-    const radius =
-      FLOOR_1_SPAWN_RADIUS_MIN +
-      world.rng.next() * (FLOOR_1_SPAWN_RADIUS_MAX - FLOOR_1_SPAWN_RADIUS_MIN);
-    const x = playerX + Math.cos(angle) * radius;
-    const y = playerY + Math.sin(angle) * radius;
-    if (floorMap.isPassableAt(x, y)) {
-      const tile = floorMap.pixelToTile(x, y);
-      const candidate = floorMap.tileToPixel(tile.x, tile.y);
-      if (isInAnyRoom(world, candidate.x, candidate.y)) {
-        return candidate;
-      }
-    }
-  }
+  for (let attempt = 0; attempt < 16; attempt += 1) {}
   const viableRooms = floorMap.rooms.filter(
     (room) => room.role !== RoomRole.SAFE && room.role !== RoomRole.BOSS_STAIR,

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:475:19
     return { x: playerX + FLOOR_1_SPAWN_RADIUS_MIN, y: playerY };
   }
   for (let attempt = 0; attempt < 16; attempt += 1) {
-    const angle = world.rng.next() * Math.PI * 2;
+    const angle = world.rng.next() / Math.PI * 2;
     const radius =
       FLOOR_1_SPAWN_RADIUS_MIN +

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:475:19
     return { x: playerX + FLOOR_1_SPAWN_RADIUS_MIN, y: playerY };
   }
   for (let attempt = 0; attempt < 16; attempt += 1) {
-    const angle = world.rng.next() * Math.PI * 2;
+    const angle = world.rng.next() * Math.PI / 2;
     const radius =
       FLOOR_1_SPAWN_RADIUS_MIN +

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:477:7
   for (let attempt = 0; attempt < 16; attempt += 1) {
     const angle = world.rng.next() * Math.PI * 2;
     const radius =
-      FLOOR_1_SPAWN_RADIUS_MIN +
-      world.rng.next() * (FLOOR_1_SPAWN_RADIUS_MAX - FLOOR_1_SPAWN_RADIUS_MIN);
+      FLOOR_1_SPAWN_RADIUS_MIN - world.rng.next() * (FLOOR_1_SPAWN_RADIUS_MAX - FLOOR_1_SPAWN_RADIUS_MIN);
     const x = playerX + Math.cos(angle) * radius;
     const y = playerY + Math.sin(angle) * radius;

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:478:27
     const angle = world.rng.next() * Math.PI * 2;
     const radius =
       FLOOR_1_SPAWN_RADIUS_MIN +
-      world.rng.next() * (FLOOR_1_SPAWN_RADIUS_MAX - FLOOR_1_SPAWN_RADIUS_MIN);
+      world.rng.next() * (FLOOR_1_SPAWN_RADIUS_MAX + FLOOR_1_SPAWN_RADIUS_MIN);
     const x = playerX + Math.cos(angle) * radius;
     const y = playerY + Math.sin(angle) * radius;

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:478:7
     const angle = world.rng.next() * Math.PI * 2;
     const radius =
       FLOOR_1_SPAWN_RADIUS_MIN +
-      world.rng.next() * (FLOOR_1_SPAWN_RADIUS_MAX - FLOOR_1_SPAWN_RADIUS_MIN);
+      world.rng.next() / (FLOOR_1_SPAWN_RADIUS_MAX - FLOOR_1_SPAWN_RADIUS_MIN);
     const x = playerX + Math.cos(angle) * radius;
     const y = playerY + Math.sin(angle) * radius;

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:479:25
     const radius =
       FLOOR_1_SPAWN_RADIUS_MIN +
       world.rng.next() * (FLOOR_1_SPAWN_RADIUS_MAX - FLOOR_1_SPAWN_RADIUS_MIN);
-    const x = playerX + Math.cos(angle) * radius;
+    const x = playerX + Math.cos(angle) / radius;
     const y = playerY + Math.sin(angle) * radius;
     if (floorMap.isPassableAt(x, y)) {

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:479:15
     const radius =
       FLOOR_1_SPAWN_RADIUS_MIN +
       world.rng.next() * (FLOOR_1_SPAWN_RADIUS_MAX - FLOOR_1_SPAWN_RADIUS_MIN);
-    const x = playerX + Math.cos(angle) * radius;
+    const x = playerX - Math.cos(angle) * radius;
     const y = playerY + Math.sin(angle) * radius;
     if (floorMap.isPassableAt(x, y)) {

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:480:25
       FLOOR_1_SPAWN_RADIUS_MIN +
       world.rng.next() * (FLOOR_1_SPAWN_RADIUS_MAX - FLOOR_1_SPAWN_RADIUS_MIN);
     const x = playerX + Math.cos(angle) * radius;
-    const y = playerY + Math.sin(angle) * radius;
+    const y = playerY + Math.sin(angle) / radius;
     if (floorMap.isPassableAt(x, y)) {
       const tile = floorMap.pixelToTile(x, y);

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:480:15
       FLOOR_1_SPAWN_RADIUS_MIN +
       world.rng.next() * (FLOOR_1_SPAWN_RADIUS_MAX - FLOOR_1_SPAWN_RADIUS_MIN);
     const x = playerX + Math.cos(angle) * radius;
-    const y = playerY + Math.sin(angle) * radius;
+    const y = playerY - Math.sin(angle) * radius;
     if (floorMap.isPassableAt(x, y)) {
       const tile = floorMap.pixelToTile(x, y);

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:481:9
       world.rng.next() * (FLOOR_1_SPAWN_RADIUS_MAX - FLOOR_1_SPAWN_RADIUS_MIN);
     const x = playerX + Math.cos(angle) * radius;
     const y = playerY + Math.sin(angle) * radius;
-    if (floorMap.isPassableAt(x, y)) {
+    if (true) {
       const tile = floorMap.pixelToTile(x, y);
       const candidate = floorMap.tileToPixel(tile.x, tile.y);

[Survived] BlockStatement
src/game/floor1Scenario.ts:481:38
       world.rng.next() * (FLOOR_1_SPAWN_RADIUS_MAX - FLOOR_1_SPAWN_RADIUS_MIN);
     const x = playerX + Math.cos(angle) * radius;
     const y = playerY + Math.sin(angle) * radius;
-    if (floorMap.isPassableAt(x, y)) {
-      const tile = floorMap.pixelToTile(x, y);
-      const candidate = floorMap.tileToPixel(tile.x, tile.y);
-      if (isInAnyRoom(world, candidate.x, candidate.y)) {
-        return candidate;
-      }
-    }
+    if (floorMap.isPassableAt(x, y)) {}
   }
   const viableRooms = floorMap.rooms.filter(

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:484:11
     if (floorMap.isPassableAt(x, y)) {
       const tile = floorMap.pixelToTile(x, y);
       const candidate = floorMap.tileToPixel(tile.x, tile.y);
-      if (isInAnyRoom(world, candidate.x, candidate.y)) {
+      if (false) {
         return candidate;
       }

[Survived] BlockStatement
src/game/floor1Scenario.ts:484:57
     if (floorMap.isPassableAt(x, y)) {
       const tile = floorMap.pixelToTile(x, y);
       const candidate = floorMap.tileToPixel(tile.x, tile.y);
-      if (isInAnyRoom(world, candidate.x, candidate.y)) {
-        return candidate;
-      }
+      if (isInAnyRoom(world, candidate.x, candidate.y)) {}
     }
   }

[NoCoverage] MethodExpression
src/game/floor1Scenario.ts:489:23
       }
     }
   }
-  const viableRooms = floorMap.rooms.filter(
-    (room) => room.role !== RoomRole.SAFE && room.role !== RoomRole.BOSS_STAIR,
-  );
+  const viableRooms = floorMap.rooms;
   if (viableRooms.length > 0) {
     for (let i = 0; i < 32; i += 1) {

[NoCoverage] EqualityOperator
src/game/floor1Scenario.ts:490:46
     }
   }
   const viableRooms = floorMap.rooms.filter(
-    (room) => room.role !== RoomRole.SAFE && room.role !== RoomRole.BOSS_STAIR,
+    (room) => room.role !== RoomRole.SAFE && room.role === RoomRole.BOSS_STAIR,
   );
   if (viableRooms.length > 0) {

[NoCoverage] ConditionalExpression
src/game/floor1Scenario.ts:490:15
     }
   }
   const viableRooms = floorMap.rooms.filter(
-    (room) => room.role !== RoomRole.SAFE && room.role !== RoomRole.BOSS_STAIR,
+    (room) => true,
   );
   if (viableRooms.length > 0) {

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:492:31
   const viableRooms = floorMap.rooms.filter(
     (room) => room.role !== RoomRole.SAFE && room.role !== RoomRole.BOSS_STAIR,
   );
-  if (viableRooms.length > 0) {
-    for (let i = 0; i < 32; i += 1) {
-      const room = viableRooms[world.rng.nextInt(0, viableRooms.length - 1)]!;
-      const minX = room.bounds.x + 1;
-      const maxX = Math.max(minX, room.bounds.x + room.bounds.width - 2);
-      const minY = room.bounds.y + 1;
-      const maxY = Math.max(minY, room.bounds.y + room.bounds.height - 2);
-      const tx = world.rng.nextInt(minX, maxX);
-      const ty = world.rng.nextInt(minY, maxY);
-      const candidate = floorMap.tileToPixel(tx, ty);
-      if (floorMap.isPassableAt(candidate.x, candidate.y)) {
-        return candidate;
-      }
-    }
-  }
+  if (viableRooms.length > 0) {}
   const fallbackTile = floorMap.pixelToTile(playerX + FLOOR_1_SPAWN_RADIUS_MIN, playerY);
   return floorMap.tileToPixel(fallbackTile.x, fallbackTile.y);

[NoCoverage] EqualityOperator
src/game/floor1Scenario.ts:492:7
   const viableRooms = floorMap.rooms.filter(
     (room) => room.role !== RoomRole.SAFE && room.role !== RoomRole.BOSS_STAIR,
   );
-  if (viableRooms.length > 0) {
+  if (viableRooms.length <= 0) {
     for (let i = 0; i < 32; i += 1) {
       const room = viableRooms[world.rng.nextInt(0, viableRooms.length - 1)]!;

[NoCoverage] AssignmentOperator
src/game/floor1Scenario.ts:493:29
     (room) => room.role !== RoomRole.SAFE && room.role !== RoomRole.BOSS_STAIR,
   );
   if (viableRooms.length > 0) {
-    for (let i = 0; i < 32; i += 1) {
+    for (let i = 0; i < 32; i -= 1) {
       const room = viableRooms[world.rng.nextInt(0, viableRooms.length - 1)]!;
       const minX = room.bounds.x + 1;

[NoCoverage] EqualityOperator
src/game/floor1Scenario.ts:493:21
     (room) => room.role !== RoomRole.SAFE && room.role !== RoomRole.BOSS_STAIR,
   );
   if (viableRooms.length > 0) {
-    for (let i = 0; i < 32; i += 1) {
+    for (let i = 0; i <= 32; i += 1) {
       const room = viableRooms[world.rng.nextInt(0, viableRooms.length - 1)]!;
       const minX = room.bounds.x + 1;

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:494:53
   );
   if (viableRooms.length > 0) {
     for (let i = 0; i < 32; i += 1) {
-      const room = viableRooms[world.rng.nextInt(0, viableRooms.length - 1)]!;
+      const room = viableRooms[world.rng.nextInt(0, viableRooms.length + 1)]!;
       const minX = room.bounds.x + 1;
       const maxX = Math.max(minX, room.bounds.x + room.bounds.width - 2);

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:495:20
   if (viableRooms.length > 0) {
     for (let i = 0; i < 32; i += 1) {
       const room = viableRooms[world.rng.nextInt(0, viableRooms.length - 1)]!;
-      const minX = room.bounds.x + 1;
+      const minX = room.bounds.x - 1;
       const maxX = Math.max(minX, room.bounds.x + room.bounds.width - 2);
       const minY = room.bounds.y + 1;
