[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:496:35
     for (let i = 0; i < 32; i += 1) {
       const room = viableRooms[world.rng.nextInt(0, viableRooms.length - 1)]!;
       const minX = room.bounds.x + 1;
-      const maxX = Math.max(minX, room.bounds.x + room.bounds.width - 2);
+      const maxX = Math.max(minX, room.bounds.x - room.bounds.width - 2);
       const minY = room.bounds.y + 1;
       const maxY = Math.max(minY, room.bounds.y + room.bounds.height - 2);

[NoCoverage] MethodExpression
src/game/floor1Scenario.ts:496:20
     for (let i = 0; i < 32; i += 1) {
       const room = viableRooms[world.rng.nextInt(0, viableRooms.length - 1)]!;
       const minX = room.bounds.x + 1;
-      const maxX = Math.max(minX, room.bounds.x + room.bounds.width - 2);
+      const maxX = Math.min(minX, room.bounds.x + room.bounds.width - 2);
       const minY = room.bounds.y + 1;
       const maxY = Math.max(minY, room.bounds.y + room.bounds.height - 2);

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:497:20
       const room = viableRooms[world.rng.nextInt(0, viableRooms.length - 1)]!;
       const minX = room.bounds.x + 1;
       const maxX = Math.max(minX, room.bounds.x + room.bounds.width - 2);
-      const minY = room.bounds.y + 1;
+      const minY = room.bounds.y - 1;
       const maxY = Math.max(minY, room.bounds.y + room.bounds.height - 2);
       const tx = world.rng.nextInt(minX, maxX);

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:498:35
       const minX = room.bounds.x + 1;
       const maxX = Math.max(minX, room.bounds.x + room.bounds.width - 2);
       const minY = room.bounds.y + 1;
-      const maxY = Math.max(minY, room.bounds.y + room.bounds.height - 2);
+      const maxY = Math.max(minY, room.bounds.y - room.bounds.height - 2);
       const tx = world.rng.nextInt(minX, maxX);
       const ty = world.rng.nextInt(minY, maxY);

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:498:35
       const minX = room.bounds.x + 1;
       const maxX = Math.max(minX, room.bounds.x + room.bounds.width - 2);
       const minY = room.bounds.y + 1;
-      const maxY = Math.max(minY, room.bounds.y + room.bounds.height - 2);
+      const maxY = Math.max(minY, room.bounds.y + room.bounds.height + 2);
       const tx = world.rng.nextInt(minX, maxX);
       const ty = world.rng.nextInt(minY, maxY);

[NoCoverage] ConditionalExpression
src/game/floor1Scenario.ts:502:11
       const tx = world.rng.nextInt(minX, maxX);
       const ty = world.rng.nextInt(minY, maxY);
       const candidate = floorMap.tileToPixel(tx, ty);
-      if (floorMap.isPassableAt(candidate.x, candidate.y)) {
+      if (false) {
         return candidate;
       }

[NoCoverage] ConditionalExpression
src/game/floor1Scenario.ts:502:11
       const tx = world.rng.nextInt(minX, maxX);
       const ty = world.rng.nextInt(minY, maxY);
       const candidate = floorMap.tileToPixel(tx, ty);
-      if (floorMap.isPassableAt(candidate.x, candidate.y)) {
+      if (true) {
         return candidate;
       }

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:507:45
       }
     }
   }
-  const fallbackTile = floorMap.pixelToTile(playerX + FLOOR_1_SPAWN_RADIUS_MIN, playerY);
+  const fallbackTile = floorMap.pixelToTile(playerX - FLOOR_1_SPAWN_RADIUS_MIN, playerY);
   return floorMap.tileToPixel(fallbackTile.x, fallbackTile.y);
 }

[Survived] BlockStatement
src/game/floor1Scenario.ts:518:29
   stairY: number,
 ): { x: number; y: number } {
   const floorMap = world.floorMap;
-  if (floorMap && bossRoom) {
-    const center = centerOfRoom(bossRoom);
-    const minX = Math.max(bossRoom.bounds.x + 2, center.x - 2);
-    const maxX = Math.min(bossRoom.bounds.x + bossRoom.bounds.width - 3, center.x + 2);
-    const minY = Math.max(bossRoom.bounds.y + 2, center.y - 2);
-    const maxY = Math.min(bossRoom.bounds.y + bossRoom.bounds.height - 3, center.y + 2);
-    for (let attempt = 0; attempt < 24; attempt += 1) {
-      const tx = world.rng.nextInt(minX, maxX);
-      const ty = world.rng.nextInt(minY, maxY);
-      const candidate = floorMap.tileToPixel(tx, ty);
-      if (floorMap.isPassableAt(candidate.x, candidate.y)) {
-        return candidate;
-      }
-    }
-    const centerCandidate = floorMap.tileToPixel(center.x, center.y);
-    if (floorMap.isPassableAt(centerCandidate.x, centerCandidate.y)) {
-      return centerCandidate;
-    }
-  }
+  if (floorMap && bossRoom) {}
   if (!floorMap) {
     return { x: stairX + FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN, y: stairY };

[Survived] MethodExpression
src/game/floor1Scenario.ts:520:18
   const floorMap = world.floorMap;
   if (floorMap && bossRoom) {
     const center = centerOfRoom(bossRoom);
-    const minX = Math.max(bossRoom.bounds.x + 2, center.x - 2);
+    const minX = Math.min(bossRoom.bounds.x + 2, center.x - 2);
     const maxX = Math.min(bossRoom.bounds.x + bossRoom.bounds.width - 3, center.x + 2);
     const minY = Math.max(bossRoom.bounds.y + 2, center.y - 2);

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:520:50
   const floorMap = world.floorMap;
   if (floorMap && bossRoom) {
     const center = centerOfRoom(bossRoom);
-    const minX = Math.max(bossRoom.bounds.x + 2, center.x - 2);
+    const minX = Math.max(bossRoom.bounds.x + 2, center.x + 2);
     const maxX = Math.min(bossRoom.bounds.x + bossRoom.bounds.width - 3, center.x + 2);
     const minY = Math.max(bossRoom.bounds.y + 2, center.y - 2);

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:521:27
   if (floorMap && bossRoom) {
     const center = centerOfRoom(bossRoom);
     const minX = Math.max(bossRoom.bounds.x + 2, center.x - 2);
-    const maxX = Math.min(bossRoom.bounds.x + bossRoom.bounds.width - 3, center.x + 2);
+    const maxX = Math.min(bossRoom.bounds.x + bossRoom.bounds.width + 3, center.x + 2);
     const minY = Math.max(bossRoom.bounds.y + 2, center.y - 2);
     const maxY = Math.min(bossRoom.bounds.y + bossRoom.bounds.height - 3, center.y + 2);

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:521:27
   if (floorMap && bossRoom) {
     const center = centerOfRoom(bossRoom);
     const minX = Math.max(bossRoom.bounds.x + 2, center.x - 2);
-    const maxX = Math.min(bossRoom.bounds.x + bossRoom.bounds.width - 3, center.x + 2);
+    const maxX = Math.min(bossRoom.bounds.x - bossRoom.bounds.width - 3, center.x + 2);
     const minY = Math.max(bossRoom.bounds.y + 2, center.y - 2);
     const maxY = Math.min(bossRoom.bounds.y + bossRoom.bounds.height - 3, center.y + 2);

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:522:27
     const center = centerOfRoom(bossRoom);
     const minX = Math.max(bossRoom.bounds.x + 2, center.x - 2);
     const maxX = Math.min(bossRoom.bounds.x + bossRoom.bounds.width - 3, center.x + 2);
-    const minY = Math.max(bossRoom.bounds.y + 2, center.y - 2);
+    const minY = Math.max(bossRoom.bounds.y - 2, center.y - 2);
     const maxY = Math.min(bossRoom.bounds.y + bossRoom.bounds.height - 3, center.y + 2);
     for (let attempt = 0; attempt < 24; attempt += 1) {

[Survived] MethodExpression
src/game/floor1Scenario.ts:522:18
     const center = centerOfRoom(bossRoom);
     const minX = Math.max(bossRoom.bounds.x + 2, center.x - 2);
     const maxX = Math.min(bossRoom.bounds.x + bossRoom.bounds.width - 3, center.x + 2);
-    const minY = Math.max(bossRoom.bounds.y + 2, center.y - 2);
+    const minY = Math.min(bossRoom.bounds.y + 2, center.y - 2);
     const maxY = Math.min(bossRoom.bounds.y + bossRoom.bounds.height - 3, center.y + 2);
     for (let attempt = 0; attempt < 24; attempt += 1) {

[Survived] ArithmeticOperator
src/game/floor1Scenario.ts:523:27
     const minX = Math.max(bossRoom.bounds.x + 2, center.x - 2);
     const maxX = Math.min(bossRoom.bounds.x + bossRoom.bounds.width - 3, center.x + 2);
     const minY = Math.max(bossRoom.bounds.y + 2, center.y - 2);
-    const maxY = Math.min(bossRoom.bounds.y + bossRoom.bounds.height - 3, center.y + 2);
+    const maxY = Math.min(bossRoom.bounds.y + bossRoom.bounds.height + 3, center.y + 2);
     for (let attempt = 0; attempt < 24; attempt += 1) {
       const tx = world.rng.nextInt(minX, maxX);

[Survived] MethodExpression
src/game/floor1Scenario.ts:523:18
     const minX = Math.max(bossRoom.bounds.x + 2, center.x - 2);
     const maxX = Math.min(bossRoom.bounds.x + bossRoom.bounds.width - 3, center.x + 2);
     const minY = Math.max(bossRoom.bounds.y + 2, center.y - 2);
-    const maxY = Math.min(bossRoom.bounds.y + bossRoom.bounds.height - 3, center.y + 2);
+    const maxY = Math.max(bossRoom.bounds.y + bossRoom.bounds.height - 3, center.y + 2);
     for (let attempt = 0; attempt < 24; attempt += 1) {
       const tx = world.rng.nextInt(minX, maxX);

[Survived] EqualityOperator
src/game/floor1Scenario.ts:524:27
     const maxX = Math.min(bossRoom.bounds.x + bossRoom.bounds.width - 3, center.x + 2);
     const minY = Math.max(bossRoom.bounds.y + 2, center.y - 2);
     const maxY = Math.min(bossRoom.bounds.y + bossRoom.bounds.height - 3, center.y + 2);
-    for (let attempt = 0; attempt < 24; attempt += 1) {
+    for (let attempt = 0; attempt >= 24; attempt += 1) {
       const tx = world.rng.nextInt(minX, maxX);
       const ty = world.rng.nextInt(minY, maxY);

[Survived] EqualityOperator
src/game/floor1Scenario.ts:524:27
     const maxX = Math.min(bossRoom.bounds.x + bossRoom.bounds.width - 3, center.x + 2);
     const minY = Math.max(bossRoom.bounds.y + 2, center.y - 2);
     const maxY = Math.min(bossRoom.bounds.y + bossRoom.bounds.height - 3, center.y + 2);
-    for (let attempt = 0; attempt < 24; attempt += 1) {
+    for (let attempt = 0; attempt <= 24; attempt += 1) {
       const tx = world.rng.nextInt(minX, maxX);
       const ty = world.rng.nextInt(minY, maxY);

[Survived] BlockStatement
src/game/floor1Scenario.ts:528:60
       const tx = world.rng.nextInt(minX, maxX);
       const ty = world.rng.nextInt(minY, maxY);
       const candidate = floorMap.tileToPixel(tx, ty);
-      if (floorMap.isPassableAt(candidate.x, candidate.y)) {
-        return candidate;
-      }
+      if (floorMap.isPassableAt(candidate.x, candidate.y)) {}
     }
     const centerCandidate = floorMap.tileToPixel(center.x, center.y);

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:533:70
       }
     }
     const centerCandidate = floorMap.tileToPixel(center.x, center.y);
-    if (floorMap.isPassableAt(centerCandidate.x, centerCandidate.y)) {
-      return centerCandidate;
-    }
+    if (floorMap.isPassableAt(centerCandidate.x, centerCandidate.y)) {}
   }
   if (!floorMap) {

[NoCoverage] ConditionalExpression
src/game/floor1Scenario.ts:533:9
       }
     }
     const centerCandidate = floorMap.tileToPixel(center.x, center.y);
-    if (floorMap.isPassableAt(centerCandidate.x, centerCandidate.y)) {
+    if (false) {
       return centerCandidate;
     }

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:538:17
     }
   }
   if (!floorMap) {
-    return { x: stairX + FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN, y: stairY };
+    return { x: stairX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN, y: stairY };
   }
   for (let attempt = 0; attempt < 16; attempt += 1) {

[NoCoverage] EqualityOperator
src/game/floor1Scenario.ts:540:25
   if (!floorMap) {
     return { x: stairX + FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN, y: stairY };
   }
-  for (let attempt = 0; attempt < 16; attempt += 1) {
+  for (let attempt = 0; attempt >= 16; attempt += 1) {
     const angle = world.rng.next() * Math.PI * 2;
     const radius =

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:543:7
   for (let attempt = 0; attempt < 16; attempt += 1) {
     const angle = world.rng.next() * Math.PI * 2;
     const radius =
-      FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN +
-      world.rng.next() *
-        (FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MAX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN);
+      FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN - world.rng.next() * (FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MAX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN);
     const x = stairX + Math.cos(angle) * radius;
     const y = stairY + Math.sin(angle) * radius;

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:544:7
     const angle = world.rng.next() * Math.PI * 2;
     const radius =
       FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN +
-      world.rng.next() *
-        (FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MAX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN);
+      world.rng.next() / (FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MAX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN);
     const x = stairX + Math.cos(angle) * radius;
     const y = stairY + Math.sin(angle) * radius;

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:545:10
     const radius =
       FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN +
       world.rng.next() *
-        (FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MAX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN);
+        (FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MAX + FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN);
     const x = stairX + Math.cos(angle) * radius;
     const y = stairY + Math.sin(angle) * radius;

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:546:15
       FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN +
       world.rng.next() *
         (FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MAX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN);
-    const x = stairX + Math.cos(angle) * radius;
+    const x = stairX - Math.cos(angle) * radius;
     const y = stairY + Math.sin(angle) * radius;
     if (floorMap.isPassableAt(x, y)) {

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:546:24
       FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN +
       world.rng.next() *
         (FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MAX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN);
-    const x = stairX + Math.cos(angle) * radius;
+    const x = stairX + Math.cos(angle) / radius;
     const y = stairY + Math.sin(angle) * radius;
     if (floorMap.isPassableAt(x, y)) {

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:547:24
       world.rng.next() *
         (FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MAX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN);
     const x = stairX + Math.cos(angle) * radius;
-    const y = stairY + Math.sin(angle) * radius;
+    const y = stairY + Math.sin(angle) / radius;
     if (floorMap.isPassableAt(x, y)) {
       const tile = floorMap.pixelToTile(x, y);

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:547:15
       world.rng.next() *
         (FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MAX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN);
     const x = stairX + Math.cos(angle) * radius;
-    const y = stairY + Math.sin(angle) * radius;
+    const y = stairY - Math.sin(angle) * radius;
     if (floorMap.isPassableAt(x, y)) {
       const tile = floorMap.pixelToTile(x, y);

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:548:38
         (FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MAX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN);
     const x = stairX + Math.cos(angle) * radius;
     const y = stairY + Math.sin(angle) * radius;
-    if (floorMap.isPassableAt(x, y)) {
-      const tile = floorMap.pixelToTile(x, y);
-      return floorMap.tileToPixel(tile.x, tile.y);
-    }
+    if (floorMap.isPassableAt(x, y)) {}
   }
   const fallbackTile = floorMap.pixelToTile(stairX + FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN, stairY);

[NoCoverage] ConditionalExpression
src/game/floor1Scenario.ts:548:9
         (FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MAX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN);
     const x = stairX + Math.cos(angle) * radius;
     const y = stairY + Math.sin(angle) * radius;
-    if (floorMap.isPassableAt(x, y)) {
+    if (true) {
       const tile = floorMap.pixelToTile(x, y);
       return floorMap.tileToPixel(tile.x, tile.y);

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:553:45
       return floorMap.tileToPixel(tile.x, tile.y);
     }
   }
-  const fallbackTile = floorMap.pixelToTile(stairX + FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN, stairY);
+  const fallbackTile = floorMap.pixelToTile(stairX - FLOOR_1_STAIR_BOSS_SPAWN_RADIUS_MIN, stairY);
   return floorMap.tileToPixel(fallbackTile.x, fallbackTile.y);
 }

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:563:40
   py: number,
   room: { bounds: { x: number; y: number; width: number; height: number } } | null,
 ): boolean {
-  if (!world.floorMap || !room) return false;
+  if (!world.floorMap || !room) return true;
   const tile = world.floorMap.pixelToTile(px, py);
   const { x, y, width, height } = room.bounds;

[Killed] EqualityOperator
src/game/floor1Scenario.ts:566:62
   if (!world.floorMap || !room) return false;
   const tile = world.floorMap.pixelToTile(px, py);
   const { x, y, width, height } = room.bounds;
-  return tile.x >= x && tile.x < x + width && tile.y >= y && tile.y < y + height;
+  return tile.x >= x && tile.x < x + width && tile.y >= y && tile.y >= y + height;
 }
 
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/game/floor1Scenario.ts:566:10
   if (!world.floorMap || !room) return false;
   const tile = world.floorMap.pixelToTile(px, py);
   const { x, y, width, height } = room.bounds;
-  return tile.x >= x && tile.x < x + width && tile.y >= y && tile.y < y + height;
+  return tile.x < x && tile.x < x + width && tile.y >= y && tile.y < y + height;
 }
 
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:572:33
 function isFullyInsideBossRoom(world: GameWorld, px: number, py: number): boolean {
   const floorMap = world.floorMap;
   const bossRoom = floorMap?.bossStairRoom ?? null;
-  if (!floorMap || !bossRoom || !isInRoom(world, px, py, bossRoom)) {
+  if (!floorMap || !bossRoom || isInRoom(world, px, py, bossRoom)) {
     return false;
   }
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected 7 to be null

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:573:12
   const floorMap = world.floorMap;
   const bossRoom = floorMap?.bossStairRoom ?? null;
   if (!floorMap || !bossRoom || !isInRoom(world, px, py, bossRoom)) {
-    return false;
+    return true;
   }
   const playerTile = floorMap.pixelToTile(px, py);
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected 7 to be null

[Survived] BlockStatement
src/game/floor1Scenario.ts:576:38
     return false;
   }
   const playerTile = floorMap.pixelToTile(px, py);
-  for (const door of bossRoom.doors) {
-    if (playerTile.x === door.x && playerTile.y === door.y) {
-      return false;
-    }
-  }
+  for (const door of bossRoom.doors) {}
   return true;
 }

[Killed] EqualityOperator
src/game/floor1Scenario.ts:577:36
   }
   const playerTile = floorMap.pixelToTile(px, py);
   for (const door of bossRoom.doors) {
-    if (playerTile.x === door.x && playerTile.y === door.y) {
+    if (playerTile.x === door.x && playerTile.y !== door.y) {
       return false;
     }
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/game/floor1Scenario.ts:577:36
   }
   const playerTile = floorMap.pixelToTile(px, py);
   for (const door of bossRoom.doors) {
-    if (playerTile.x === door.x && playerTile.y === door.y) {
+    if (playerTile.x === door.x && true) {
       return false;
     }
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:578:14
   const playerTile = floorMap.pixelToTile(px, py);
   for (const door of bossRoom.doors) {
     if (playerTile.x === door.x && playerTile.y === door.y) {
-      return false;
+      return true;
     }
   }

[Killed] BlockStatement
src/game/floor1Scenario.ts:590:38
     return false;
   }
   const tile = floorMap.pixelToTile(px, py);
-  for (const room of floorMap.rooms) {
-    const { x, y, width, height } = room.bounds;
-    if (tile.x >= x && tile.x < x + width && tile.y >= y && tile.y < y + height) {
-      return true;
-    }
-  }
+  for (const room of floorMap.rooms) {}
   return false;
 }
killedBy: floor1Scenario spawns deterministic rat/slime encounters from the floor director
statusReason: expected undefined to be defined

[Killed] ArithmeticOperator
src/game/floor1Scenario.ts:592:33
   const tile = floorMap.pixelToTile(px, py);
   for (const room of floorMap.rooms) {
     const { x, y, width, height } = room.bounds;
-    if (tile.x >= x && tile.x < x + width && tile.y >= y && tile.y < y + height) {
+    if (tile.x >= x && tile.x < x - width && tile.y >= y && tile.y < y + height) {
       return true;
     }
killedBy: floor1Scenario spawns deterministic rat/slime encounters from the floor director
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/game/floor1Scenario.ts:592:82
   const tile = floorMap.pixelToTile(px, py);
   for (const room of floorMap.rooms) {
     const { x, y, width, height } = room.bounds;
-    if (tile.x >= x && tile.x < x + width && tile.y >= y && tile.y < y + height) {
-      return true;
-    }
+    if (tile.x >= x && tile.x < x + width && tile.y >= y && tile.y < y + height) {}
   }
   return false;
killedBy: floor1Scenario spawns deterministic rat/slime encounters from the floor director
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:593:14
   for (const room of floorMap.rooms) {
     const { x, y, width, height } = room.bounds;
     if (tile.x >= x && tile.x < x + width && tile.y >= y && tile.y < y + height) {
-      return true;
+      return false;
     }
   }
killedBy: floor1Scenario spawns deterministic rat/slime encounters from the floor director
statusReason: expected undefined to be defined

[Survived] ObjectLiteral
src/game/floor1Scenario.ts:622:40
     FLOOR_1_STAIR_BOSS_DETECT_RANGE,
     280,
   );
-  setComponent(world.ecs, eid, Sprite, {
-    textureId: SPRITE_TEX_ENEMY_SLIME,
-    width: FLOOR_1_STAIR_BOSS_SPRITE_WIDTH,
-    height: FLOOR_1_STAIR_BOSS_SPRITE_HEIGHT,
-  });
+  setComponent(world.ecs, eid, Sprite, {});
 
   // Boss has melee contact damage for swipe attacks.

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:647:33
     return;
   }
 
-  objective.bossBattleStarted = true;
+  objective.bossBattleStarted = false;
   objective.staircaseLocked = true;
   objective.staircaseUnlocked = false;
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:648:31
   }
 
   objective.bossBattleStarted = true;
-  objective.staircaseLocked = true;
+  objective.staircaseLocked = false;
   objective.staircaseUnlocked = false;
   setGoalFlag(world, 'floor1-boss-active', true);

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:649:33
 
   objective.bossBattleStarted = true;
   objective.staircaseLocked = true;
-  objective.staircaseUnlocked = false;
+  objective.staircaseUnlocked = true;
   setGoalFlag(world, 'floor1-boss-active', true);
   objective.staircaseBossEid = spawnFloor1StairBoss(world);

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:650:44
   objective.bossBattleStarted = true;
   objective.staircaseLocked = true;
   objective.staircaseUnlocked = false;
-  setGoalFlag(world, 'floor1-boss-active', true);
+  setGoalFlag(world, 'floor1-boss-active', false);
   objective.staircaseBossEid = spawnFloor1StairBoss(world);
   const floorMap = world.floorMap;

[Survived] BlockStatement
src/game/floor1Scenario.ts:654:17
   objective.staircaseBossEid = spawnFloor1StairBoss(world);
   const floorMap = world.floorMap;
   const bossRoom = floorMap?.bossStairRoom;
-  if (bossRoom) {
-    for (const door of bossRoom.doors) {
-      floorMap!.tileMap.closeDoor(door.x, door.y);
-    }
-  }
+  if (bossRoom) {}
   // Replace lock config: doors stay locked while boss is active, open once boss defeated.
   for (const doorEid of floor1.bossDoorEids) {

[Survived] BlockStatement
src/game/floor1Scenario.ts:655:40
   const floorMap = world.floorMap;
   const bossRoom = floorMap?.bossStairRoom;
   if (bossRoom) {
-    for (const door of bossRoom.doors) {
-      floorMap!.tileMap.closeDoor(door.x, door.y);
-    }
+    for (const door of bossRoom.doors) {}
   }
   // Replace lock config: doors stay locked while boss is active, open once boss defeated.

[Survived] BlockStatement
src/game/floor1Scenario.ts:660:46
     }
   }
   // Replace lock config: doors stay locked while boss is active, open once boss defeated.
-  for (const doorEid of floor1.bossDoorEids) {
-    world.stores.doorState.isLocked[doorEid] = 1;
-    world.stores.doorState.isOpen[doorEid] = 0;
-    setDoorLockConfig(world, doorEid, {
-      unlock: {
-        operator: 'all',
-        conditions: [{ type: 'goal', goalId: 'floor1-defeat-boss' }],
-      },
-      relock: {
-        operator: 'all',
-        conditions: [{ type: 'goal', goalId: 'floor1-boss-active' }],
-      },
-    });
-  }
+  for (const doorEid of floor1.bossDoorEids) {}
 }
 

[Killed] StringLiteral
src/game/floor1Scenario.ts:666:46
     setDoorLockConfig(world, doorEid, {
       unlock: {
         operator: 'all',
-        conditions: [{ type: 'goal', goalId: 'floor1-defeat-boss' }],
+        conditions: [{ type: 'goal', goalId: "" }],
       },
       relock: {
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: Door unlock goal condition requires a non-empty goalId.

[Killed] ArrayDeclaration
src/game/floor1Scenario.ts:670:21
       },
       relock: {
         operator: 'all',
-        conditions: [{ type: 'goal', goalId: 'floor1-boss-active' }],
+        conditions: [],
       },
     });
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: Door relock condition group must include at least one condition.

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:676:64
   }
 }
 
-export function floor1PlayerStatSystem(world: GameWorld): void {
-  if (!world.floor1) {
-    return;
-  }
-  const players = query(world.ecs, [Player, Position, Health]);
-  const player = players[0];
-  if (player === undefined) {
-    return;
-  }
-
-  if (!playerBonusApplied.has(world)) {
-    const maxHp = Math.max(
-      world.stores.health.max[player] ?? 100,
-      100 + world.floor1.baseStatBonuses.maxHp,
-    );
-    setComponent(world.ecs, player, Health, { current: maxHp, max: maxHp });
-    playerBonusApplied.add(world);
-  }
-
-  const speedScale = (PLAYER_SPEED + world.floor1.baseStatBonuses.moveSpeed) / PLAYER_SPEED;
-  world.stores.velocity.x[player] = (world.stores.velocity.x[player] ?? 0) * speedScale;
-  world.stores.velocity.y[player] = (world.stores.velocity.y[player] ?? 0) * speedScale;
-}
+export function floor1PlayerStatSystem(world: GameWorld): void {}
 
 export function floor1EnemyDirectorSystem(world: GameWorld): void {

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:686:39
     return;
   }
 
-  if (!playerBonusApplied.has(world)) {
-    const maxHp = Math.max(
-      world.stores.health.max[player] ?? 100,
-      100 + world.floor1.baseStatBonuses.maxHp,
-    );
-    setComponent(world.ecs, player, Health, { current: maxHp, max: maxHp });
-    playerBonusApplied.add(world);
-  }
+  if (!playerBonusApplied.has(world)) {}
 
   const speedScale = (PLAYER_SPEED + world.floor1.baseStatBonuses.moveSpeed) / PLAYER_SPEED;

[NoCoverage] ConditionalExpression
src/game/floor1Scenario.ts:686:7
     return;
   }
 
-  if (!playerBonusApplied.has(world)) {
+  if (true) {
     const maxHp = Math.max(
       world.stores.health.max[player] ?? 100,

[NoCoverage] MethodExpression
src/game/floor1Scenario.ts:687:19
   }
 
   if (!playerBonusApplied.has(world)) {
-    const maxHp = Math.max(
-      world.stores.health.max[player] ?? 100,
-      100 + world.floor1.baseStatBonuses.maxHp,
-    );
+    const maxHp = Math.min(world.stores.health.max[player] ?? 100, 100 + world.floor1.baseStatBonuses.maxHp);
     setComponent(world.ecs, player, Health, { current: maxHp, max: maxHp });
     playerBonusApplied.add(world);

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:689:7
   if (!playerBonusApplied.has(world)) {
     const maxHp = Math.max(
       world.stores.health.max[player] ?? 100,
-      100 + world.floor1.baseStatBonuses.maxHp,
+      100 - world.floor1.baseStatBonuses.maxHp,
     );
     setComponent(world.ecs, player, Health, { current: maxHp, max: maxHp });

[NoCoverage] ArithmeticOperator
src/game/floor1Scenario.ts:695:22
     playerBonusApplied.add(world);
   }
 
-  const speedScale = (PLAYER_SPEED + world.floor1.baseStatBonuses.moveSpeed) / PLAYER_SPEED;
+  const speedScale = (PLAYER_SPEED + world.floor1.baseStatBonuses.moveSpeed) * PLAYER_SPEED;
   world.stores.velocity.x[player] = (world.stores.velocity.x[player] ?? 0) * speedScale;
   world.stores.velocity.y[player] = (world.stores.velocity.y[player] ?? 0) * speedScale;
