[Killed] ArithmeticOperator
src/game/floor1Scenario.ts:886:22
   }
 
   const objective = world.floor1.objective;
-  const totalKills = objective.ratsKilled + objective.slimesKilled;
+  const totalKills = objective.ratsKilled - objective.slimesKilled;
   const meetsCombat =
     objective.questAccepted &&
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/game/floor1Scenario.ts:888:5
   const objective = world.floor1.objective;
   const totalKills = objective.ratsKilled + objective.slimesKilled;
   const meetsCombat =
-    objective.questAccepted &&
-    totalKills >= FLOOR_1_REQUIRED_TOTAL_KILLS &&
-    objective.ratsKilled >= objective.requiredRats &&
-    objective.slimesKilled >= objective.requiredSlimes;
+    false;
   const meetsLoot =
     objective.goldCollected >= objective.requiredGold &&
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/game/floor1Scenario.ts:888:5
   const objective = world.floor1.objective;
   const totalKills = objective.ratsKilled + objective.slimesKilled;
   const meetsCombat =
-    objective.questAccepted &&
-    totalKills >= FLOOR_1_REQUIRED_TOTAL_KILLS &&
-    objective.ratsKilled >= objective.requiredRats &&
+    objective.questAccepted && totalKills >= FLOOR_1_REQUIRED_TOTAL_KILLS || objective.ratsKilled >= objective.requiredRats &&
     objective.slimesKilled >= objective.requiredSlimes;
   const meetsLoot =
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/game/floor1Scenario.ts:889:5
   const totalKills = objective.ratsKilled + objective.slimesKilled;
   const meetsCombat =
     objective.questAccepted &&
-    totalKills >= FLOOR_1_REQUIRED_TOTAL_KILLS &&
+    totalKills < FLOOR_1_REQUIRED_TOTAL_KILLS &&
     objective.ratsKilled >= objective.requiredRats &&
     objective.slimesKilled >= objective.requiredSlimes;
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/game/floor1Scenario.ts:889:5
   const totalKills = objective.ratsKilled + objective.slimesKilled;
   const meetsCombat =
     objective.questAccepted &&
-    totalKills >= FLOOR_1_REQUIRED_TOTAL_KILLS &&
+    totalKills > FLOOR_1_REQUIRED_TOTAL_KILLS &&
     objective.ratsKilled >= objective.requiredRats &&
     objective.slimesKilled >= objective.requiredSlimes;
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/game/floor1Scenario.ts:890:5
   const meetsCombat =
     objective.questAccepted &&
     totalKills >= FLOOR_1_REQUIRED_TOTAL_KILLS &&
-    objective.ratsKilled >= objective.requiredRats &&
+    objective.ratsKilled < objective.requiredRats &&
     objective.slimesKilled >= objective.requiredSlimes;
   const meetsLoot =
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/game/floor1Scenario.ts:890:5
   const meetsCombat =
     objective.questAccepted &&
     totalKills >= FLOOR_1_REQUIRED_TOTAL_KILLS &&
-    objective.ratsKilled >= objective.requiredRats &&
+    objective.ratsKilled > objective.requiredRats &&
     objective.slimesKilled >= objective.requiredSlimes;
   const meetsLoot =
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/game/floor1Scenario.ts:891:5
     objective.questAccepted &&
     totalKills >= FLOOR_1_REQUIRED_TOTAL_KILLS &&
     objective.ratsKilled >= objective.requiredRats &&
-    objective.slimesKilled >= objective.requiredSlimes;
+    objective.slimesKilled > objective.requiredSlimes;
   const meetsLoot =
     objective.goldCollected >= objective.requiredGold &&
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/game/floor1Scenario.ts:891:5
     objective.questAccepted &&
     totalKills >= FLOOR_1_REQUIRED_TOTAL_KILLS &&
     objective.ratsKilled >= objective.requiredRats &&
-    objective.slimesKilled >= objective.requiredSlimes;
+    objective.slimesKilled < objective.requiredSlimes;
   const meetsLoot =
     objective.goldCollected >= objective.requiredGold &&
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:893:5
     objective.ratsKilled >= objective.requiredRats &&
     objective.slimesKilled >= objective.requiredSlimes;
   const meetsLoot =
-    objective.goldCollected >= objective.requiredGold &&
-    objective.junkCollected >= objective.requiredJunk;
+    false;
 
   if (meetsCombat && !objective.questCompleted) {

[Survived] LogicalOperator
src/game/floor1Scenario.ts:893:5
     objective.ratsKilled >= objective.requiredRats &&
     objective.slimesKilled >= objective.requiredSlimes;
   const meetsLoot =
-    objective.goldCollected >= objective.requiredGold &&
-    objective.junkCollected >= objective.requiredJunk;
+    objective.goldCollected >= objective.requiredGold || objective.junkCollected >= objective.requiredJunk;
 
   if (meetsCombat && !objective.questCompleted) {

[NoCoverage] ConditionalExpression
src/game/floor1Scenario.ts:894:5
     objective.slimesKilled >= objective.requiredSlimes;
   const meetsLoot =
     objective.goldCollected >= objective.requiredGold &&
-    objective.junkCollected >= objective.requiredJunk;
+    true;
 
   if (meetsCombat && !objective.questCompleted) {

[NoCoverage] EqualityOperator
src/game/floor1Scenario.ts:894:5
     objective.slimesKilled >= objective.requiredSlimes;
   const meetsLoot =
     objective.goldCollected >= objective.requiredGold &&
-    objective.junkCollected >= objective.requiredJunk;
+    objective.junkCollected > objective.requiredJunk;
 
   if (meetsCombat && !objective.questCompleted) {

[Killed] ConditionalExpression
src/game/floor1Scenario.ts:896:7
     objective.goldCollected >= objective.requiredGold &&
     objective.junkCollected >= objective.requiredJunk;
 
-  if (meetsCombat && !objective.questCompleted) {
+  if (false) {
     objective.questCompleted = true;
     setGoalFlag(world, 'floor1-goon-quest-complete', true);
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/game/floor1Scenario.ts:896:49
     objective.goldCollected >= objective.requiredGold &&
     objective.junkCollected >= objective.requiredJunk;
 
-  if (meetsCombat && !objective.questCompleted) {
-    objective.questCompleted = true;
-    setGoalFlag(world, 'floor1-goon-quest-complete', true);
-  }
+  if (meetsCombat && !objective.questCompleted) {}
 
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.safeRoomDiscovered`, objective.safeRoomDiscovered);
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:897:32
     objective.junkCollected >= objective.requiredJunk;
 
   if (meetsCombat && !objective.questCompleted) {
-    objective.questCompleted = true;
+    objective.questCompleted = false;
     setGoalFlag(world, 'floor1-goon-quest-complete', true);
   }
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:898:54
 
   if (meetsCombat && !objective.questCompleted) {
     objective.questCompleted = true;
-    setGoalFlag(world, 'floor1-goon-quest-complete', true);
+    setGoalFlag(world, 'floor1-goon-quest-complete', false);
   }
 

[Killed] LogicalOperator
src/game/floor1Scenario.ts:907:5
 
   // Boss battle starts only after the player fully enters the boss room.
   if (
-    objective.questCompleted &&
-    isFullyInsideBossRoom(world, playerX, playerY) &&
-    !objective.bossBattleStarted
+    objective.questCompleted && isFullyInsideBossRoom(world, playerX, playerY) || !objective.bossBattleStarted
   ) {
     beginFloor1BossBattle(world);
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected 7 to be null

[Killed] ConditionalExpression
src/game/floor1Scenario.ts:907:5
 
   // Boss battle starts only after the player fully enters the boss room.
   if (
-    objective.questCompleted &&
-    isFullyInsideBossRoom(world, playerX, playerY) &&
-    !objective.bossBattleStarted
+    true
   ) {
     beginFloor1BossBattle(world);
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected 7 to be null

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:909:5
   if (
     objective.questCompleted &&
     isFullyInsideBossRoom(world, playerX, playerY) &&
-    !objective.bossBattleStarted
+    objective.bossBattleStarted
   ) {
     beginFloor1BossBattle(world);
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/game/floor1Scenario.ts:910:5
     objective.questCompleted &&
     isFullyInsideBossRoom(world, playerX, playerY) &&
     !objective.bossBattleStarted
-  ) {
-    beginFloor1BossBattle(world);
-  }
+  ) {}
 
   const bossEid = objective.staircaseBossEid;
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/game/floor1Scenario.ts:915:21
   }
 
   const bossEid = objective.staircaseBossEid;
-  const bossAlive = bossEid !== null && entityExists(world.ecs, bossEid);
+  const bossAlive = true;
   if (objective.bossBattleStarted && !bossAlive && !objective.staircaseSpawned) {
     objective.staircaseSpawned = true;
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/game/floor1Scenario.ts:915:21
   }
 
   const bossEid = objective.staircaseBossEid;
-  const bossAlive = bossEid !== null && entityExists(world.ecs, bossEid);
+  const bossAlive = false;
   if (objective.bossBattleStarted && !bossAlive && !objective.staircaseSpawned) {
     objective.staircaseSpawned = true;
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: Expected staircase boss to exist

[Killed] LogicalOperator
src/game/floor1Scenario.ts:916:7
 
   const bossEid = objective.staircaseBossEid;
   const bossAlive = bossEid !== null && entityExists(world.ecs, bossEid);
-  if (objective.bossBattleStarted && !bossAlive && !objective.staircaseSpawned) {
+  if (objective.bossBattleStarted || !bossAlive && !objective.staircaseSpawned) {
     objective.staircaseSpawned = true;
     objective.staircaseLocked = false;
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/game/floor1Scenario.ts:916:81
 
   const bossEid = objective.staircaseBossEid;
   const bossAlive = bossEid !== null && entityExists(world.ecs, bossEid);
-  if (objective.bossBattleStarted && !bossAlive && !objective.staircaseSpawned) {
-    objective.staircaseSpawned = true;
-    objective.staircaseLocked = false;
-    objective.staircaseUnlocked = true;
-    objective.staircaseBossDefeated = true;
-    objective.staircaseBossEid = null;
-    setGoalFlag(world, 'floor1-boss-active', false);
-    const floorMap = world.floorMap;
-    if (floorMap?.bossStairRoom) {
-      for (const door of floorMap.bossStairRoom.doors) {
-        floorMap.tileMap.openDoor(door.x, door.y);
-      }
-    }
-    for (const doorEid of world.floor1.bossDoorEids) {
-      world.stores.doorState.isLocked[doorEid] = 0;
-      world.stores.doorState.isOpen[doorEid] = 1;
-    }
-    setGoalFlag(world, 'floor1-defeat-boss', true);
-  }
+  if (objective.bossBattleStarted && !bossAlive && !objective.staircaseSpawned) {}
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseUnlocked`, objective.staircaseUnlocked);
 
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:917:34
   const bossEid = objective.staircaseBossEid;
   const bossAlive = bossEid !== null && entityExists(world.ecs, bossEid);
   if (objective.bossBattleStarted && !bossAlive && !objective.staircaseSpawned) {
-    objective.staircaseSpawned = true;
+    objective.staircaseSpawned = false;
     objective.staircaseLocked = false;
     objective.staircaseUnlocked = true;
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:918:33
   const bossAlive = bossEid !== null && entityExists(world.ecs, bossEid);
   if (objective.bossBattleStarted && !bossAlive && !objective.staircaseSpawned) {
     objective.staircaseSpawned = true;
-    objective.staircaseLocked = false;
+    objective.staircaseLocked = true;
     objective.staircaseUnlocked = true;
     objective.staircaseBossDefeated = true;
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:919:35
   if (objective.bossBattleStarted && !bossAlive && !objective.staircaseSpawned) {
     objective.staircaseSpawned = true;
     objective.staircaseLocked = false;
-    objective.staircaseUnlocked = true;
+    objective.staircaseUnlocked = false;
     objective.staircaseBossDefeated = true;
     objective.staircaseBossEid = null;
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:920:39
     objective.staircaseSpawned = true;
     objective.staircaseLocked = false;
     objective.staircaseUnlocked = true;
-    objective.staircaseBossDefeated = true;
+    objective.staircaseBossDefeated = false;
     objective.staircaseBossEid = null;
     setGoalFlag(world, 'floor1-boss-active', false);
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:922:46
     objective.staircaseUnlocked = true;
     objective.staircaseBossDefeated = true;
     objective.staircaseBossEid = null;
-    setGoalFlag(world, 'floor1-boss-active', false);
+    setGoalFlag(world, 'floor1-boss-active', true);
     const floorMap = world.floorMap;
     if (floorMap?.bossStairRoom) {

[Survived] BlockStatement
src/game/floor1Scenario.ts:924:34
     objective.staircaseBossEid = null;
     setGoalFlag(world, 'floor1-boss-active', false);
     const floorMap = world.floorMap;
-    if (floorMap?.bossStairRoom) {
-      for (const door of floorMap.bossStairRoom.doors) {
-        floorMap.tileMap.openDoor(door.x, door.y);
-      }
-    }
+    if (floorMap?.bossStairRoom) {}
     for (const doorEid of world.floor1.bossDoorEids) {
       world.stores.doorState.isLocked[doorEid] = 0;

[Survived] BlockStatement
src/game/floor1Scenario.ts:925:56
     setGoalFlag(world, 'floor1-boss-active', false);
     const floorMap = world.floorMap;
     if (floorMap?.bossStairRoom) {
-      for (const door of floorMap.bossStairRoom.doors) {
-        floorMap.tileMap.openDoor(door.x, door.y);
-      }
+      for (const door of floorMap.bossStairRoom.doors) {}
     }
     for (const doorEid of world.floor1.bossDoorEids) {

[Survived] BlockStatement
src/game/floor1Scenario.ts:929:54
         floorMap.tileMap.openDoor(door.x, door.y);
       }
     }
-    for (const doorEid of world.floor1.bossDoorEids) {
-      world.stores.doorState.isLocked[doorEid] = 0;
-      world.stores.doorState.isOpen[doorEid] = 1;
-    }
+    for (const doorEid of world.floor1.bossDoorEids) {}
     setGoalFlag(world, 'floor1-defeat-boss', true);
   }

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:933:46
       world.stores.doorState.isLocked[doorEid] = 0;
       world.stores.doorState.isOpen[doorEid] = 1;
     }
-    setGoalFlag(world, 'floor1-defeat-boss', true);
+    setGoalFlag(world, 'floor1-defeat-boss', false);
   }
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseUnlocked`, objective.staircaseUnlocked);

[Killed] StringLiteral
src/game/floor1Scenario.ts:933:24
       world.stores.doorState.isLocked[doorEid] = 0;
       world.stores.doorState.isOpen[doorEid] = 1;
     }
-    setGoalFlag(world, 'floor1-defeat-boss', true);
+    setGoalFlag(world, "", true);
   }
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseUnlocked`, objective.staircaseUnlocked);
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: Goal flag id must be non-empty.

[Killed] LogicalOperator
src/game/floor1Scenario.ts:937:7
   }
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseUnlocked`, objective.staircaseUnlocked);
 
-  if (world.elapsedMs >= objective.deadlineMs && !objective.staircaseDiscovered) {
+  if (world.elapsedMs >= objective.deadlineMs || !objective.staircaseDiscovered) {
     world.floor1.failReason = 'stair_timeout';
     world.state = 'game_over';
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/game/floor1Scenario.ts:937:7
   }
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseUnlocked`, objective.staircaseUnlocked);
 
-  if (world.elapsedMs >= objective.deadlineMs && !objective.staircaseDiscovered) {
+  if (true) {
     world.floor1.failReason = 'stair_timeout';
     world.state = 'game_over';
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:949:47
   const objective = world.floor1?.objective;
   const floorMap = world.floorMap;
   const bossRoom = floorMap?.bossStairRoom;
-  if (!objective || !floorMap || !bossRoom || !entityExists(world.ecs, playerEid)) {
+  if (!objective || !floorMap || !bossRoom || entityExists(world.ecs, playerEid)) {
     return false;
   }

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:950:12
   const floorMap = world.floorMap;
   const bossRoom = floorMap?.bossStairRoom;
   if (!objective || !floorMap || !bossRoom || !entityExists(world.ecs, playerEid)) {
-    return false;
+    return true;
   }
 

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:953:29
     return false;
   }
 
-  objective.questAccepted = true;
+  objective.questAccepted = false;
   objective.questCompleted = true;
   objective.ratsKilled = Math.max(objective.ratsKilled, objective.requiredRats);

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:954:30
   }
 
   objective.questAccepted = true;
-  objective.questCompleted = true;
+  objective.questCompleted = false;
   objective.ratsKilled = Math.max(objective.ratsKilled, objective.requiredRats);
   objective.slimesKilled = Math.max(objective.slimesKilled, objective.requiredSlimes);

[NoCoverage] MethodExpression
src/game/floor1Scenario.ts:955:26
 
   objective.questAccepted = true;
   objective.questCompleted = true;
-  objective.ratsKilled = Math.max(objective.ratsKilled, objective.requiredRats);
+  objective.ratsKilled = Math.min(objective.ratsKilled, objective.requiredRats);
   objective.slimesKilled = Math.max(objective.slimesKilled, objective.requiredSlimes);
   objective.goldCollected = Math.max(objective.goldCollected, objective.requiredGold);

[NoCoverage] MethodExpression
src/game/floor1Scenario.ts:956:28
   objective.questAccepted = true;
   objective.questCompleted = true;
   objective.ratsKilled = Math.max(objective.ratsKilled, objective.requiredRats);
-  objective.slimesKilled = Math.max(objective.slimesKilled, objective.requiredSlimes);
+  objective.slimesKilled = Math.min(objective.slimesKilled, objective.requiredSlimes);
   objective.goldCollected = Math.max(objective.goldCollected, objective.requiredGold);
   objective.junkCollected = Math.max(objective.junkCollected, objective.requiredJunk);

[NoCoverage] MethodExpression
src/game/floor1Scenario.ts:957:29
   objective.questCompleted = true;
   objective.ratsKilled = Math.max(objective.ratsKilled, objective.requiredRats);
   objective.slimesKilled = Math.max(objective.slimesKilled, objective.requiredSlimes);
-  objective.goldCollected = Math.max(objective.goldCollected, objective.requiredGold);
+  objective.goldCollected = Math.min(objective.goldCollected, objective.requiredGold);
   objective.junkCollected = Math.max(objective.junkCollected, objective.requiredJunk);
   setGoalFlag(world, 'floor1-goon-quest-complete', true);

[NoCoverage] MethodExpression
src/game/floor1Scenario.ts:958:29
   objective.ratsKilled = Math.max(objective.ratsKilled, objective.requiredRats);
   objective.slimesKilled = Math.max(objective.slimesKilled, objective.requiredSlimes);
   objective.goldCollected = Math.max(objective.goldCollected, objective.requiredGold);
-  objective.junkCollected = Math.max(objective.junkCollected, objective.requiredJunk);
+  objective.junkCollected = Math.min(objective.junkCollected, objective.requiredJunk);
   setGoalFlag(world, 'floor1-goon-quest-complete', true);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.combatComplete`, true);

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:959:52
   objective.slimesKilled = Math.max(objective.slimesKilled, objective.requiredSlimes);
   objective.goldCollected = Math.max(objective.goldCollected, objective.requiredGold);
   objective.junkCollected = Math.max(objective.junkCollected, objective.requiredJunk);
-  setGoalFlag(world, 'floor1-goon-quest-complete', true);
+  setGoalFlag(world, 'floor1-goon-quest-complete', false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.combatComplete`, true);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.lootComplete`, true);

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:960:63
   objective.goldCollected = Math.max(objective.goldCollected, objective.requiredGold);
   objective.junkCollected = Math.max(objective.junkCollected, objective.requiredJunk);
   setGoalFlag(world, 'floor1-goon-quest-complete', true);
-  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.combatComplete`, true);
+  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.combatComplete`, false);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.lootComplete`, true);
 

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:961:61
   objective.junkCollected = Math.max(objective.junkCollected, objective.requiredJunk);
   setGoalFlag(world, 'floor1-goon-quest-complete', true);
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.combatComplete`, true);
-  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.lootComplete`, true);
+  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.lootComplete`, false);
 
   const center = centerOfRoom(bossRoom);

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:970:10
   world.stores.velocity.y[playerEid] = 0;
 
   beginFloor1BossBattle(world);
-  return true;
+  return false;
 }
 

[Killed] EqualityOperator
src/game/floor1Scenario.ts:974:24
 }
 
 export function confirmFloor1StairDescend(world: GameWorld, _playerEid: number): boolean {
-  if (!world.floor1 || world.state !== 'playing') {
+  if (!world.floor1 || world.state === 'playing') {
     return false;
   }
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:974:24
 }
 
 export function confirmFloor1StairDescend(world: GameWorld, _playerEid: number): boolean {
-  if (!world.floor1 || world.state !== 'playing') {
+  if (!world.floor1 || false) {
     return false;
   }

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:975:12
 
 export function confirmFloor1StairDescend(world: GameWorld, _playerEid: number): boolean {
   if (!world.floor1 || world.state !== 'playing') {
-    return false;
+    return true;
   }
   const objective = world.floor1.objective;

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:979:5
   }
   const objective = world.floor1.objective;
   if (
-    !objective.staircaseSpawned ||
+    objective.staircaseSpawned ||
     !objective.staircaseUnlocked ||
     objective.staircaseDiscovered
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/game/floor1Scenario.ts:979:5
   }
   const objective = world.floor1.objective;
   if (
-    !objective.staircaseSpawned ||
-    !objective.staircaseUnlocked ||
-    objective.staircaseDiscovered
+    true
   ) {
     return false;
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:980:5
   const objective = world.floor1.objective;
   if (
     !objective.staircaseSpawned ||
-    !objective.staircaseUnlocked ||
+    objective.staircaseUnlocked ||
     objective.staircaseDiscovered
   ) {
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:982:5
     !objective.staircaseSpawned ||
     !objective.staircaseUnlocked ||
     objective.staircaseDiscovered
-  ) {
-    return false;
-  }
+  ) {}
   objective.staircaseDiscovered = true;
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, true);

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:985:35
   ) {
     return false;
   }
-  objective.staircaseDiscovered = true;
+  objective.staircaseDiscovered = false;
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, true);
   world.state = 'safe_room';
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/game/floor1Scenario.ts:986:68
     return false;
   }
   objective.staircaseDiscovered = true;
-  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, true);
+  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, false);
   world.state = 'safe_room';
   finalizeRunSummary(world, 'cleared_floor');

[Killed] StringLiteral
src/game/floor1Scenario.ts:986:22
     return false;
   }
   objective.staircaseDiscovered = true;
-  setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, true);
+  setGoalFlag(world, ``, true);
   world.state = 'safe_room';
   finalizeRunSummary(world, 'cleared_floor');
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: Goal flag id must be non-empty.

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:989:10
   setGoalFlag(world, `${FLOOR_1_GOAL_PREFIX}.staircaseDiscovered`, true);
   world.state = 'safe_room';
   finalizeRunSummary(world, 'cleared_floor');
-  return true;
+  return false;
 }
 
killedBy: floor1Scenario starts boss battle on boss-room entry after goon quest, then spawns stairs after boss death
statusReason: expected false to be true // Object.is equality

[Survived] ArrayDeclaration
src/game/floor1Scenario.ts:997:27
 // ---------------------------------------------------------------------------
 
 function findPlayerEid(world: GameWorld): number | undefined {
-  return query(world.ecs, [Player])[0];
+  return query(world.ecs, [])[0];
 }
 
