[Killed] ConditionalExpression
src/game/floor1Scenario.ts:1007:7
 
 /** Current stage of the merchant's errand, derived from world state. */
 export function getShopkeeperStage(world: GameWorld): ShopkeeperStage {
-  if (world.goalFlags.get('floor1-shop-quest-complete') === true) {
+  if (false) {
     return 'complete';
   }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'complete' // Object.is equality

[Killed] EqualityOperator
src/game/floor1Scenario.ts:1007:7
 
 /** Current stage of the merchant's errand, derived from world state. */
 export function getShopkeeperStage(world: GameWorld): ShopkeeperStage {
-  if (world.goalFlags.get('floor1-shop-quest-complete') === true) {
+  if (world.goalFlags.get('floor1-shop-quest-complete') !== true) {
     return 'complete';
   }
killedBy: floor1Scenario shopkeeper errand questline accepts both Floor 1 quests on initialization
statusReason: expected 'complete' to be 'not-met' // Object.is equality

[Killed] MethodExpression
src/game/floor1Scenario.ts:1011:31
     return 'complete';
   }
   const bag = playerBag(world);
-  const hasEquippable = bag ? bag.slots.some((s) => isEquippableItem(s.itemId)) : false;
+  const hasEquippable = bag ? bag.slots.every(s => isEquippableItem(s.itemId)) : false;
   if (hasEquippable) {
     return 'awaiting-equip';
killedBy: floor1Scenario shopkeeper errand questline accepts both Floor 1 quests on initialization
statusReason: expected 'awaiting-equip' to be 'not-met' // Object.is equality

[Killed] ArrowFunction
src/game/floor1Scenario.ts:1011:46
     return 'complete';
   }
   const bag = playerBag(world);
-  const hasEquippable = bag ? bag.slots.some((s) => isEquippableItem(s.itemId)) : false;
+  const hasEquippable = bag ? bag.slots.some(() => undefined) : false;
   if (hasEquippable) {
     return 'awaiting-equip';
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'awaiting-equip' // Object.is equality

[Killed] BlockStatement
src/game/floor1Scenario.ts:1012:22
   }
   const bag = playerBag(world);
   const hasEquippable = bag ? bag.slots.some((s) => isEquippableItem(s.itemId)) : false;
-  if (hasEquippable) {
-    return 'awaiting-equip';
-  }
+  if (hasEquippable) {}
   if (world.goalFlags.get('floor1-shop-prize-returned') === true) {
     return 'ready-to-buy';
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'awaiting-equip' // Object.is equality

[Killed] ConditionalExpression
src/game/floor1Scenario.ts:1012:7
   }
   const bag = playerBag(world);
   const hasEquippable = bag ? bag.slots.some((s) => isEquippableItem(s.itemId)) : false;
-  if (hasEquippable) {
+  if (false) {
     return 'awaiting-equip';
   }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'ready-to-buy' to be 'awaiting-equip' // Object.is equality

[Killed] EqualityOperator
src/game/floor1Scenario.ts:1015:7
   if (hasEquippable) {
     return 'awaiting-equip';
   }
-  if (world.goalFlags.get('floor1-shop-prize-returned') === true) {
+  if (world.goalFlags.get('floor1-shop-prize-returned') !== true) {
     return 'ready-to-buy';
   }
killedBy: floor1Scenario shopkeeper errand questline accepts both Floor 1 quests on initialization
statusReason: expected 'ready-to-buy' to be 'not-met' // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:1015:61
   if (hasEquippable) {
     return 'awaiting-equip';
   }
-  if (world.goalFlags.get('floor1-shop-prize-returned') === true) {
+  if (world.goalFlags.get('floor1-shop-prize-returned') === false) {
     return 'ready-to-buy';
   }
killedBy: floor1Scenario shopkeeper errand questline accepts both Floor 1 quests on initialization
statusReason: expected 'ready-to-buy' to be 'not-met' // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:1019:49
     return 'ready-to-buy';
   }
   const quest = world.questLog.get(FLOOR1_SHOP_QUEST_ID);
-  if (!quest || quest.done['meet-merchant'] !== true) {
+  if (!quest || quest.done['meet-merchant'] !== false) {
     return 'not-met';
   }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'not-met' to be 'awaiting-prize' // Object.is equality

[Killed] ConditionalExpression
src/game/floor1Scenario.ts:1019:7
     return 'ready-to-buy';
   }
   const quest = world.questLog.get(FLOOR1_SHOP_QUEST_ID);
-  if (!quest || quest.done['meet-merchant'] !== true) {
+  if (false) {
     return 'not-met';
   }
killedBy: floor1Scenario shopkeeper errand questline accepts both Floor 1 quests on initialization
statusReason: expected 'awaiting-prize' to be 'not-met' // Object.is equality

[Killed] BlockStatement
src/game/floor1Scenario.ts:1026:56
 }
 
 /** Mark the merchant as met (advances the first quest step). */
-export function meetShopkeeper(world: GameWorld): void {
-  notifyQuestTalk(world, 'shopkeeper');
-}
+export function meetShopkeeper(world: GameWorld): void {}
 
 /**
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'not-met' to be 'awaiting-prize' // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:1036:15
  */
 export function returnShopkeeperPrize(world: GameWorld, playerEid: number): boolean {
   const bag = world.inventories.get(playerEid);
-  if (!bag || !hasItem(bag, SHOPKEEPER_FETCH_ITEM_ID)) {
+  if (!bag || hasItem(bag, SHOPKEEPER_FETCH_ITEM_ID)) {
     return false;
   }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:1037:12
 export function returnShopkeeperPrize(world: GameWorld, playerEid: number): boolean {
   const bag = world.inventories.get(playerEid);
   if (!bag || !hasItem(bag, SHOPKEEPER_FETCH_ITEM_ID)) {
-    return false;
+    return true;
   }
   if (world.goalFlags.get('floor1-shop-prize-returned') === true) {
killedBy: floor1Scenario shopkeeper errand questline does not let the player return a prize they do not hold
statusReason: expected true to be false // Object.is equality

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:1040:12
     return false;
   }
   if (world.goalFlags.get('floor1-shop-prize-returned') === true) {
-    return false;
+    return true;
   }
   removeItem(bag, SHOPKEEPER_FETCH_ITEM_ID, 1);

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:1043:52
     return false;
   }
   removeItem(bag, SHOPKEEPER_FETCH_ITEM_ID, 1);
-  setGoalFlag(world, 'floor1-shop-prize-returned', true);
+  setGoalFlag(world, 'floor1-shop-prize-returned', false);
   return true;
 }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 'awaiting-prize' to be 'ready-to-buy' // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:1044:10
   }
   removeItem(bag, SHOPKEEPER_FETCH_ITEM_ID, 1);
   setGoalFlag(world, 'floor1-shop-prize-returned', true);
-  return true;
+  return false;
 }
 
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:1059:61
   if (!bag) {
     return false;
   }
-  if (world.goalFlags.get('floor1-shop-prize-returned') !== true) {
+  if (world.goalFlags.get('floor1-shop-prize-returned') !== false) {
     return false;
   }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/game/floor1Scenario.ts:1059:7
   if (!bag) {
     return false;
   }
-  if (world.goalFlags.get('floor1-shop-prize-returned') !== true) {
+  if (world.goalFlags.get('floor1-shop-prize-returned') === true) {
     return false;
   }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:1060:12
     return false;
   }
   if (world.goalFlags.get('floor1-shop-prize-returned') !== true) {
-    return false;
+    return true;
   }
   if (hasItem(bag, SHOPKEEPER_EQUIPMENT_ITEM_ID)) {

[NoCoverage] BlockStatement
src/game/floor1Scenario.ts:1062:51
   if (world.goalFlags.get('floor1-shop-prize-returned') !== true) {
     return false;
   }
-  if (hasItem(bag, SHOPKEEPER_EQUIPMENT_ITEM_ID)) {
-    return false;
-  }
+  if (hasItem(bag, SHOPKEEPER_EQUIPMENT_ITEM_ID)) {}
   if (world.playerGold < SHOPKEEPER_EQUIPMENT_COST) {
     return false;

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:1062:7
   if (world.goalFlags.get('floor1-shop-prize-returned') !== true) {
     return false;
   }
-  if (hasItem(bag, SHOPKEEPER_EQUIPMENT_ITEM_ID)) {
+  if (false) {
     return false;
   }

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:1063:12
     return false;
   }
   if (hasItem(bag, SHOPKEEPER_EQUIPMENT_ITEM_ID)) {
-    return false;
+    return true;
   }
   if (world.playerGold < SHOPKEEPER_EQUIPMENT_COST) {

[Killed] EqualityOperator
src/game/floor1Scenario.ts:1065:7
   if (hasItem(bag, SHOPKEEPER_EQUIPMENT_ITEM_ID)) {
     return false;
   }
-  if (world.playerGold < SHOPKEEPER_EQUIPMENT_COST) {
+  if (world.playerGold >= SHOPKEEPER_EQUIPMENT_COST) {
     return false;
   }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/game/floor1Scenario.ts:1065:7
   if (hasItem(bag, SHOPKEEPER_EQUIPMENT_ITEM_ID)) {
     return false;
   }
-  if (world.playerGold < SHOPKEEPER_EQUIPMENT_COST) {
+  if (false) {
     return false;
   }
killedBy: floor1Scenario shopkeeper errand questline refuses to sell when the player cannot afford the charm
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:1066:12
     return false;
   }
   if (world.playerGold < SHOPKEEPER_EQUIPMENT_COST) {
-    return false;
+    return true;
   }
   world.playerGold -= SHOPKEEPER_EQUIPMENT_COST;
killedBy: floor1Scenario shopkeeper errand questline refuses to sell when the player cannot afford the charm
statusReason: expected true to be false // Object.is equality

[Killed] AssignmentOperator
src/game/floor1Scenario.ts:1068:3
   if (world.playerGold < SHOPKEEPER_EQUIPMENT_COST) {
     return false;
   }
-  world.playerGold -= SHOPKEEPER_EQUIPMENT_COST;
+  world.playerGold += SHOPKEEPER_EQUIPMENT_COST;
   addItem(bag, SHOPKEEPER_EQUIPMENT_ITEM_ID, 1);
   return true;
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected 40 to be 10 // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:1070:10
   }
   world.playerGold -= SHOPKEEPER_EQUIPMENT_COST;
   addItem(bag, SHOPKEEPER_EQUIPMENT_ITEM_ID, 1);
-  return true;
+  return false;
 }
 
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/game/floor1Scenario.ts:1082:31
   if (!bag) {
     return false;
   }
-  const slot = bag.slots.find((s) => isEquippableItem(s.itemId));
+  const slot = bag.slots.find(() => undefined);
   if (!slot) {
     return false;
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:1084:12
   }
   const slot = bag.slots.find((s) => isEquippableItem(s.itemId));
   if (!slot) {
-    return false;
+    return true;
   }
   const def = getEquipmentDefForItem(slot.itemId);

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:1088:12
   }
   const def = getEquipmentDefForItem(slot.itemId);
   if (!def) {
-    return false;
+    return true;
   }
   const result = equip(world, playerEid, def, { force: true });

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:1090:56
   if (!def) {
     return false;
   }
-  const result = equip(world, playerEid, def, { force: true });
+  const result = equip(world, playerEid, def, { force: false });
   if (!result.ok) {
     return false;
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:1091:7
     return false;
   }
   const result = equip(world, playerEid, def, { force: true });
-  if (!result.ok) {
+  if (result.ok) {
     return false;
   }
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/game/floor1Scenario.ts:1091:7
     return false;
   }
   const result = equip(world, playerEid, def, { force: true });
-  if (!result.ok) {
+  if (false) {
     return false;
   }

[NoCoverage] BooleanLiteral
src/game/floor1Scenario.ts:1092:12
   }
   const result = equip(world, playerEid, def, { force: true });
   if (!result.ok) {
-    return false;
+    return true;
   }
   removeItem(bag, slot.itemId, 1);

[Killed] BooleanLiteral
src/game/floor1Scenario.ts:1095:10
     return false;
   }
   removeItem(bag, slot.itemId, 1);
-  return true;
+  return false;
 }
 
killedBy: floor1Scenario shopkeeper errand questline walks the merchant errand: meet → fetch → return → buy → equip
statusReason: expected false to be true // Object.is equality
